gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

#define CORE_VERSION  V3XJ

/* CCP signatures */
typedef enum CCP_enum
{
    CCP_SPM_gc = (0x9D<<0),  /* SPM Instruction Protection */
    CCP_IOREG_gc = (0xD8<<0),  /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CTE - CTE Module
--------------------------------------------------------------------------
*/

/* CTE Micro Sequencer */
typedef struct CTEMS_struct
{
    _WORDREGISTER(MSACCAL);  /* MS Accumulator A Low Register */
    _WORDREGISTER(MSACCAH);  /* MS Accumulator A High Register */
    _WORDREGISTER(MSACCBL);  /* MS Accumulator B Low Register (only for MS1) */
    _WORDREGISTER(MSACCBH);  /* MS Accumulator B High Register (only for MS1) */
    _WORDREGISTER(MSACCCNTA);  /* MS Accumulator Counter A Register */
    _WORDREGISTER(MSACCCNTB);  /* MS Accumulator Counter B Register (only for MS1) */
    _WORDREGISTER(MSMAXA);  /* MS Max A */
    _WORDREGISTER(MSMAXB);  /* MS Max B */
    _WORDREGISTER(MSMINA);  /* MS Min A */
    _WORDREGISTER(MSMINB);  /* MS Min B */
    _WORDREGISTER(MSSHIFTRA);  /* MS Shift Register A */
    _WORDREGISTER(MSSHIFTRB);  /* MS Shift Register B (only for MS1) */
    _WORDREGISTER(MSACCSR);  /* MS Accumulator Status Register */
    _WORDREGISTER(MSCRCCLR);  /* MS Control Register C Clear */
    _WORDREGISTER(MSCRCSET);  /* MS Control Register C Set */
    register8_t reserved_1[66];
    _WORDREGISTER(MSCRA);  /* MS Control Register A */
    _WORDREGISTER(MSCRB);  /* MS Control Register B (T/C control) */
    register8_t reserved_2[4];
    _WORDREGISTER(MSSRACLR);  /* MS Status Register A Clear */
    _WORDREGISTER(MSSRASET);  /* MS Status Register A Set */
    _WORDREGISTER(MSSRB);  /* MS Status (Read only) Register B */
    _WORDREGISTER(MSSRC);  /* MS Status (Read only) Register C */
    _WORDREGISTER(MSSRD);  /* MS Status (Read only) Register D */
    _WORDREGISTER(MSSRE);  /* MS Status (Read only) Register E */
    _WORDREGISTER(MSCCR);  /* MS Condition Code Register */
    register8_t reserved_3[4];
    _WORDREGISTER(MSLINK);  /* MS Link Register */
    register8_t reserved_4[4];
} CTEMS_t;


/* CTE Module */
typedef struct CTE_struct
{
    _WORDREGISTER(ADCYCHR);  /* ADC Y Channel Register */
    _WORDREGISTER(INTCRC);  /* Integrator Control Register C */
    _WORDREGISTER(ADCSRACLR);  /* ADC Status Register A Clear */
    _WORDREGISTER(ADCSRASET);  /* ADC Status Register A Set */
    _WORDREGISTER(INTCRBCLR);  /* Integrator Control Register B Clear */
    _WORDREGISTER(INTCRBSET);  /* Integrator Control Register B Set */
    _WORDREGISTER(INTCRECLR);  /* Integrator Control Register E Clear */
    _WORDREGISTER(INTCRESET);  /* Integrator Control Register E Set */
    _WORDREGISTER(INTXCHR);  /* Integrator X Channel Register */
    _WORDREGISTER(INTOENA);  /* Integrator Output Enable A */
    _WORDREGISTER(INTOENB);  /* Integrator Output Enable B */
    _WORDREGISTER(TIMMOECMP);  /* Timer Master Output Enable Compare */
    _WORDREGISTER(HVCRA);  /* High Voltage Control Register A */
    _WORDREGISTER(TIMAPER);  /* Timer A Period Register */
    _WORDREGISTER(TIMBPER);  /* Timer B Period Register */
    _WORDREGISTER(TIMCPER);  /* Timer C Period Register */
    _WORDREGISTER(TIMMOEPER);  /* Timer Master Output Enable Period Register */
    register8_t reserved_1[2];
    _WORDREGISTER(INTDONE);  /* Integrator Done */
    _WORDREGISTER(INTTRIGA);  /* Integrator Trigger Register A */
    _WORDREGISTER(INTTRIGB);  /* Integrator Trigger Register B */
    register8_t reserved_2[2];
    _WORDREGISTER(INTCRFCLR);  /* Integrator Control Register F Clear */
    _WORDREGISTER(INTCRFSET);  /* Integrator Control Register F Set */
    _WORDREGISTER(GCAFSRA);  /* GCAF Status Register A. */
    _WORDREGISTER(GCAFHDLCNT);  /* GCAF Headroom detector Low Counter */
    _WORDREGISTER(GCAFHDHCNT);  /* GCAF Headroom detector High Counter */
    _WORDREGISTER(GCAFCCCLIM);  /* GCAF Computation Complete Counter Limit. */
    _WORDREGISTER(PIFXPORTA);  /* Port Interface X-lines PORT, 0-15 */
    _WORDREGISTER(PIFXPORTB);  /* Port Interface X-lines PORT, 16-30 */
    _WORDREGISTER(PIFYPORTA);  /* Port Interface Y-lines PORT, 0-15 */
    _WORDREGISTER(PIFYPORTB);  /* Port Interface Y-lines PORT, 16-18 */
    _WORDREGISTER(PIFXDDRA);  /* Port Interface X-lines DDR, 0-15 */
    _WORDREGISTER(PIFXDDRB);  /* Port Interface X-lines DDR, 16-30 */
    _WORDREGISTER(PIFYDDRA);  /* Port Interface Y-lines DDR, 0-15 */
    _WORDREGISTER(PIFYDDRB);  /* Port Interface Y-lines DDR, 16-18 */
    _WORDREGISTER(PIFXTGLA);  /* Port Interface X-lines Toggle, 0-15 */
    _WORDREGISTER(PIFXTGLB);  /* Port Interface X-lines Toggle, 16-30 */
    _WORDREGISTER(PIFYTGLA);  /* Port Interface Y-lines Toggle, 0-15 */
    _WORDREGISTER(PIFYTGLB);  /* Port Interface Y-lines Toggle, 16-18 */
    _WORDREGISTER(PIFILA);  /* Interleave register access [15:0] (A) */
    _WORDREGISTER(PIFILB);  /* Interleave register access [31:16] (B) */
    _WORDREGISTER(PIFILE);  /* Interleave register access [30, 28, ..., 0] (Even) */
    _WORDREGISTER(PIFILO);  /* Interleave register access [31, 29, ..., 1] (Odd) */
    register8_t reserved_3[40];
    _WORDREGISTER(ADCCRA);  /* ADC Control Register A */
    _WORDREGISTER(ADCCRB);  /* ADC Control Register B */
    _WORDREGISTER(ADCINTCAL);  /* ADC and Integrator Calibration Register */
    _WORDREGISTER(ADCRES);  /* ADC Result Register */
    _WORDREGISTER(ADCINTTEST);  /* ADC Integrator Test Register */
    _WORDREGISTER(ADCSHVBCAL);  /* ADC and SH */
    _WORDREGISTER(INTCRA);  /* Integrator Control Register A */
    _WORDREGISTER(INTCRD);  /* Integrator Control Register D */
    _WORDREGISTER(INTENA);  /* Integrator Enable Register A */
    _WORDREGISTER(INTENB);  /* Integrator Enable Register B */
    _WORDREGISTER(INTMASKENA);  /* Integrator Mask Enable Register A */
    _WORDREGISTER(INTMASKENB);  /* Integrator Mask Enable Register B */
    _WORDREGISTER(SHENA);  /* Sample-and-Hold Enable Register A */
    _WORDREGISTER(SHENB);  /* Sample-and-Hold Enable Register B */
    _WORDREGISTER(BIASCR);  /* Bias Control Register */
    _WORDREGISTER(HVSEQT);  /* High Voltage Sequencer Timing */
    _WORDREGISTER(INTXCHMAX);  /* Maximum X-channel Number */
    _WORDREGISTER(SCGRNGYN);  /* Selfcap Global Range Y-line NMOS */
    _WORDREGISTER(SCGRNGYP);  /* Selfcap Global Range Y-line PMOS */
    _WORDREGISTER(SCGRNGXN);  /* Selfcap Global Range X-line NMOS */
    _WORDREGISTER(SCGRNGXP);  /* Selfcap Global Range X-line PMOS */
    _WORDREGISTER(SCGRNGPN);  /* Selfcap Global Range Proximity NMOS */
    _WORDREGISTER(SCGRNGPP);  /* Selfcap Global Range Proximity PMOS */
    _WORDREGISTER(INTCAPRSTCR);  /* Integrator Cap Reset Control Register */
    _WORDREGISTER(INTGAIN0);  /* Integrator Gain Register 0 */
    _WORDREGISTER(INTGAIN1);  /* Integrator Gain Register 1 */
    _WORDREGISTER(INTGAIN2);  /* Integrator Gain Register 2 */
    _WORDREGISTER(INTGAIN3);  /* Integrator Gain Register 3 */
    _WORDREGISTER(INTGAIN4);  /* Integrator Gain Register 4 */
    register8_t reserved_4[6];
    _WORDREGISTER(TIMACMP);  /* Timer A Compare Register */
    _WORDREGISTER(TIMBCMP);  /* Timer B Compare Register */
    _WORDREGISTER(PADYCHCOMPA);  /* Enable the selfcap current source at pad_ichargecomp A */
    _WORDREGISTER(PADYCHCOMPB);  /* Enable the selfcap current source at pad_ichargecomp B */
    _WORDREGISTER(PADBNY1);  /* Pad bn y1 */
    _WORDREGISTER(PADBPY1);  /* Pad bp y1 */
    _WORDREGISTER(PADY1);  /* Enable [n/p]mos and extra[n/p] y1 */
    _WORDREGISTER(XYBIAS);  /* XY line bias control */
    _WORDREGISTER(PADSCMEXA);  /* Pad Self Cap Master Enable X A */
    _WORDREGISTER(PADSCMEXB);  /* Pad Self Cap Master Enable X B */
    _WORDREGISTER(PADSCMEYA);  /* Pad Self Cap Master Enable Y A */
    _WORDREGISTER(PADSCMEYB);  /* Pad Self Cap Master Enable Y B */
    _WORDREGISTER(PADYONXENA);  /* Pad YonX Enable A */
    _WORDREGISTER(PADYONXENB);  /* Pad YonX Enable B */
    _WORDREGISTER(PADXONXENA);  /* Pad XonX Enable A */
    _WORDREGISTER(PADXONXENB);  /* Pad XonX Enable B */
    _WORDREGISTER(PADYONYENA);  /* Pad YonY Enable A */
    _WORDREGISTER(PADYONYENB);  /* Pad YonY Enable B */
    _WORDREGISTER(PADPROXENXA);  /* Pad Proximity Enable X A */
    _WORDREGISTER(PADPROXENXB);  /* Pad Proximity Enable X B */
    _WORDREGISTER(PADPROXENYA);  /* Pad Proximity Enable Y A */
    _WORDREGISTER(PADPROXENYB);  /* Pad Proximity Enable Y B */
    register8_t reserved_5[8];
    _WORDREGISTER(PADYRESENA);  /* Pad yres Enable A */
    _WORDREGISTER(PADYRESENB);  /* Pad yres Enable B */
    _WORDREGISTER(PADSCICALENA);  /* Pad sc ical Enable A */
    _WORDREGISTER(PADSCICALENB);  /* Pad sc ical Enable B */
    _WORDREGISTER(PADINTENA);  /* Pad int Enable A */
    _WORDREGISTER(PADINTENB);  /* Pad int Enable B */
    _WORDREGISTER(PADSCX0);  /* Pad Self Cap Control Registers X 0 */
    _WORDREGISTER(PADSCX1);  /* Pad Self Cap Control Registers X 1 */
    _WORDREGISTER(PADSCX2);  /* Pad Self Cap Control Registers X 2 */
    _WORDREGISTER(PADSCX3);  /* Pad Self Cap Control Registers X 3 */
    _WORDREGISTER(PADSCX4);  /* Pad Self Cap Control Registers X 4 */
    _WORDREGISTER(PADSCX5);  /* Pad Self Cap Control Registers X 5 */
    _WORDREGISTER(PADSCX6);  /* Pad Self Cap Control Registers X 6 */
    _WORDREGISTER(PADSCX7);  /* Pad Self Cap Control Registers X 7 */
    _WORDREGISTER(PADSCX8);  /* Pad Self Cap Control Registers X 8 */
    _WORDREGISTER(PADSCX9);  /* Pad Self Cap Control Registers X 9 */
    _WORDREGISTER(PADSCX10);  /* Pad Self Cap Control Registers X 10 */
    _WORDREGISTER(PADSCX11);  /* Pad Self Cap Control Registers X 11 */
    _WORDREGISTER(PADSCX12);  /* Pad Self Cap Control Registers X 12 */
    _WORDREGISTER(PADSCX13);  /* Pad Self Cap Control Registers X 13 */
    _WORDREGISTER(PADSCX14);  /* Pad Self Cap Control Registers X 14 */
    _WORDREGISTER(PADSCX15);  /* Pad Self Cap Control Registers X 15 */
    _WORDREGISTER(PADSCX16);  /* Pad Self Cap Control Registers X 16 */
    _WORDREGISTER(PADSCX17);  /* Pad Self Cap Control Registers X 17 */
    _WORDREGISTER(PADSCX18);  /* Pad Self Cap Control Registers X 18 */
    _WORDREGISTER(PADSCX19);  /* Pad Self Cap Control Registers X 19 */
    _WORDREGISTER(PADSCX20);  /* Pad Self Cap Control Registers X 20 */
    _WORDREGISTER(PADSCX21);  /* Pad Self Cap Control Registers X 21 */
    _WORDREGISTER(PADSCX22);  /* Pad Self Cap Control Registers X 22 */
    _WORDREGISTER(PADSCX23);  /* Pad Self Cap Control Registers X 23 */
    _WORDREGISTER(PADSCX24);  /* Pad Self Cap Control Registers X 24 */
    _WORDREGISTER(PADSCX25);  /* Pad Self Cap Control Registers X 25 */
    _WORDREGISTER(PADSCX26);  /* Pad Self Cap Control Registers X 26 */
    _WORDREGISTER(PADSCX27);  /* Pad Self Cap Control Registers X 27 */
    _WORDREGISTER(PADSCX28);  /* Pad Self Cap Control Registers X 28 */
    _WORDREGISTER(PADSCX29);  /* Pad Self Cap Control Registers X 29 */
    _WORDREGISTER(PADSCX30);  /* Pad Self Cap Control Registers X 30 */
    _WORDREGISTER(PADSCX31);  /* Pad Self Cap Control Registers X 31 */
    _WORDREGISTER(PADSCX32);  /* Pad Self Cap Control Registers X 32 */
    _WORDREGISTER(PADSCX33);  /* Pad Self Cap Control Registers X 33 */
    _WORDREGISTER(PADSCX34);  /* Pad Self Cap Control Registers X 34 */
    _WORDREGISTER(PADSCX35);  /* Pad Self Cap Control Registers X 35 */
    _WORDREGISTER(PADSCX36);  /* Pad Self Cap Control Registers X 36 */
    _WORDREGISTER(PADSCX37);  /* Pad Self Cap Control Registers X 37 */
    _WORDREGISTER(PADSCX38);  /* Pad Self Cap Control Registers X 38 */
    _WORDREGISTER(PADSCX39);  /* Pad Self Cap Control Registers X 39 */
    _WORDREGISTER(PADSCX40);  /* Pad Self Cap Control Registers X 40 */
    _WORDREGISTER(PADSCX41);  /* Pad Self Cap Control Registers X 41 */
    _WORDREGISTER(PADSCX42);  /* Pad Self Cap Control Registers X 42 */
    _WORDREGISTER(PADSCX43);  /* Pad Self Cap Control Registers X 43 */
    _WORDREGISTER(PADSCX44);  /* Pad Self Cap Control Registers X 44 */
    _WORDREGISTER(PADSCX45);  /* Pad Self Cap Control Registers X 45 */
    _WORDREGISTER(PADSCX46);  /* Pad Self Cap Control Registers X 46 */
    _WORDREGISTER(PADSCX47);  /* Pad Self Cap Control Registers X 47 */
    _WORDREGISTER(PADSCX48);  /* Pad Self Cap Control Registers X 48 */
    _WORDREGISTER(PADSCX49);  /* Pad Self Cap Control Registers X 49 */
    _WORDREGISTER(PADSCX50);  /* Pad Self Cap Control Registers X 50 */
    _WORDREGISTER(PADSCX51);  /* Pad Self Cap Control Registers X 51 */
    _WORDREGISTER(PADSCX52);  /* Pad Self Cap Control Registers X 52 */
    _WORDREGISTER(PADSCX53);  /* Pad Self Cap Control Registers X 53 */
    _WORDREGISTER(PADSCX54);  /* Pad Self Cap Control Registers X 54 */
    _WORDREGISTER(PADSCX55);  /* Pad Self Cap Control Registers X 55 */
    _WORDREGISTER(PADSCX56);  /* Pad Self Cap Control Registers X 56 */
    _WORDREGISTER(PADSCX57);  /* Pad Self Cap Control Registers X 57 */
    _WORDREGISTER(PADSCX58);  /* Pad Self Cap Control Registers X 58 */
    _WORDREGISTER(PADSCX59);  /* Pad Self Cap Control Registers X 59 */
    register8_t reserved_6[8];
    _WORDREGISTER(PADSCY0);  /* Pad Self Cap Control Registers Y 0 */
    _WORDREGISTER(PADSCY1);  /* Pad Self Cap Control Registers Y 1 */
    _WORDREGISTER(PADSCY2);  /* Pad Self Cap Control Registers Y 2 */
    _WORDREGISTER(PADSCY3);  /* Pad Self Cap Control Registers Y 3 */
    _WORDREGISTER(PADSCY4);  /* Pad Self Cap Control Registers Y 4 */
    _WORDREGISTER(PADSCY5);  /* Pad Self Cap Control Registers Y 5 */
    _WORDREGISTER(PADSCY6);  /* Pad Self Cap Control Registers Y 6 */
    _WORDREGISTER(PADSCY7);  /* Pad Self Cap Control Registers Y 7 */
    _WORDREGISTER(PADSCY8);  /* Pad Self Cap Control Registers Y 8 */
    _WORDREGISTER(PADSCY9);  /* Pad Self Cap Control Registers Y 9 */
    _WORDREGISTER(PADSCY10);  /* Pad Self Cap Control Registers Y 10 */
    _WORDREGISTER(PADSCY11);  /* Pad Self Cap Control Registers Y 11 */
    _WORDREGISTER(PADSCY12);  /* Pad Self Cap Control Registers Y 12 */
    _WORDREGISTER(PADSCY13);  /* Pad Self Cap Control Registers Y 13 */
    _WORDREGISTER(PADSCY14);  /* Pad Self Cap Control Registers Y 14 */
    _WORDREGISTER(PADSCY15);  /* Pad Self Cap Control Registers Y 15 */
    _WORDREGISTER(PADSCY16);  /* Pad Self Cap Control Registers Y 16 */
    _WORDREGISTER(PADSCY17);  /* Pad Self Cap Control Registers Y 17 */
    _WORDREGISTER(PADSCY18);  /* Pad Self Cap Control Registers Y 18 */
    _WORDREGISTER(PADSCY19);  /* Pad Self Cap Control Registers Y 19 */
    _WORDREGISTER(PADSCY20);  /* Pad Self Cap Control Registers Y 20 */
    _WORDREGISTER(PADSCY21);  /* Pad Self Cap Control Registers Y 21 */
    _WORDREGISTER(PADSCY22);  /* Pad Self Cap Control Registers Y 22 */
    _WORDREGISTER(PADSCY23);  /* Pad Self Cap Control Registers Y 23 */
    _WORDREGISTER(PADSCY24);  /* Pad Self Cap Control Registers Y 24 */
    _WORDREGISTER(PADSCY25);  /* Pad Self Cap Control Registers Y 25 */
    _WORDREGISTER(PADSCY26);  /* Pad Self Cap Control Registers Y 26 */
    _WORDREGISTER(PADSCY27);  /* Pad Self Cap Control Registers Y 27 */
    _WORDREGISTER(PADSCY28);  /* Pad Self Cap Control Registers Y 28 */
    _WORDREGISTER(PADSCY29);  /* Pad Self Cap Control Registers Y 29 */
    _WORDREGISTER(PADSCY30);  /* Pad Self Cap Control Registers Y 30 */
    _WORDREGISTER(PADSCY31);  /* Pad Self Cap Control Registers Y 31 */
    _WORDREGISTER(PADSCY32);  /* Pad Self Cap Control Registers Y 32 */
    _WORDREGISTER(PADSCY33);  /* Pad Self Cap Control Registers Y 33 */
    _WORDREGISTER(PADSCY34);  /* Pad Self Cap Control Registers Y 34 */
    _WORDREGISTER(PADSCY35);  /* Pad Self Cap Control Registers Y 35 */
    _WORDREGISTER(PADSCP0);  /* Pad Selfcap Control Register Prox 0 */
    _WORDREGISTER(PADSCP1);  /* Pad Selfcap Control Register Prox 1 */
    _WORDREGISTER(INTCRG);  /* Integrator Control Register G */
    _WORDREGISTER(VMCTRL);  /* Voltage Modulation Control Register */
    _WORDREGISTER(PADHVSWENA);  /* Pad hvsw Enable A */
    _WORDREGISTER(PADHVSWENB);  /* Pad hvsw Enable B */
    _WORDREGISTER(PADBNX1);  /* Pad bn x1 */
    _WORDREGISTER(PADBPX1);  /* Pad bp x1 */
    _WORDREGISTER(PADX1);  /* Enable [n/p]mos and extra[n/p] x1 */
    _WORDREGISTER(PADBNP1);  /* Pad bn p1 */
    _WORDREGISTER(PADBPP1);  /* Pad bp p1 */
    _WORDREGISTER(PADP1);  /* Enable [n/p]mos and extra[n/p] p1 */
    _WORDREGISTER(PADSCCP);  /* Pad Self Cap Control Registers C Prox */
    register8_t reserved_7[2];
    _WORDREGISTER(PADBCX);  /* Pad Bias Control C X-line */
    _WORDREGISTER(PADCX);  /* Pad Extra Bias Control C X-line */
    _WORDREGISTER(PADBCY);  /* Pad Bias Control C Y-line */
    _WORDREGISTER(PADCY);  /* Pad Extra Bias Control C Y-line */
    _WORDREGISTER(PADBCP);  /* Pad Bias Control C Prox */
    _WORDREGISTER(PADCP);  /* Pad Extra Bias Control C Prox */
    _WORDREGISTER(PADSCCX0);  /* Pad Self Cap Control Registers C X 0 */
    _WORDREGISTER(PADSCCX13);  /* Pad Self Cap Control Registers C X 13 */
    _WORDREGISTER(PADSCCX29);  /* Pad Self Cap Control Registers C X 29 */
    _WORDREGISTER(PADSCCY0);  /* Pad Self Cap Control Registers C Y 0 */
    _WORDREGISTER(PADSCCY12);  /* Pad Self Cap Control Registers C Y 12 */
    _WORDREGISTER(PADSCCY17);  /* Pad Self Cap Control Registers C Y 17 */
    _WORDREGISTER(PADHYONXENA);  /* Pad Hot Y-on-X Enable A */
    _WORDREGISTER(PADHYONXENB);  /* Pad Hot Y-on-X Enable B */
    _WORDREGISTER(GCAFCRA);  /* GCAF Control Register A. */
    _WORDREGISTER(GCAFCRB);  /* GCAF Control Register B. */
    _WORDREGISTER(GCAFMCENA);  /* GCAF Multi-cut enable A. */
    _WORDREGISTER(GCAFMCENB);  /* GCAF Multi-cut enable B. */
    _WORDREGISTER(GCAFBASELIM);  /* GCAF Base Address and Delta Limit. */
    _WORDREGISTER(GCAFPCLL);  /* GCAF Pre-cut lower limit. */
    _WORDREGISTER(GCAFPCUL);  /* GCAF Pre-cut upper limit. */
    _WORDREGISTER(GCAFWFCR);  /* GCAF Window Function Control Register */
    _WORDREGISTER(GCAFADCMIN);  /* GCAF Minimum ADC Result */
    _WORDREGISTER(GCAFADCMAX);  /* GCAF Maximum ADC Result */
    _WORDREGISTER(GCAFNORMEN0A);  /* GCAF Normalization enable 0 A. */
    _WORDREGISTER(GCAFNORMEN0B);  /* GCAF Normalization enable 0 B. */
    _WORDREGISTER(GCAFNORMEN1A);  /* GCAF Normalization enable 1 A. */
    _WORDREGISTER(GCAFNORMEN1B);  /* GCAF Normalization enable 1 B. */
    register8_t reserved_8[36];
    _WORDREGISTER(PIFXENA);  /* Port Interface X-line Enable, 0-15 */
    _WORDREGISTER(PIFXENB);  /* Port Interface X-line Enable, 16-30 */
    _WORDREGISTER(PIFYENA);  /* Port Interface Y-line Enable, 0-15 */
    _WORDREGISTER(PIFYENB);  /* Port Interface Y-line Enable, 16-18 */
    _WORDREGISTER(PIFXPINA);  /* Port Interface X-lines PIN, 0-15 */
    _WORDREGISTER(PIFXPINB);  /* Port Interface X-lines PIN, 16-30 */
    _WORDREGISTER(PIFYPINA);  /* Port Interface Y-lines PIN, 0-15 */
    _WORDREGISTER(PIFYPINB);  /* Port Interface Y-lines PIN, 16-18 */
    _WORDREGISTER(PIFXSRLA);  /* Port Interface X-line Slew Rate Limit Enable, 0-15 */
    _WORDREGISTER(PIFXSRLB);  /* Port Interface X-line Slew Rate Limit Enable, 16-30 */
    _WORDREGISTER(PIFYSRLA);  /* Port Interface Y-line Slew Rate Limit Enable, 0-15 */
    _WORDREGISTER(PIFYSRLB);  /* Port Interface Y-line Slew Rate Limit Enable, 16-18 */
    register8_t reserved_9[40];
    CTEMS_t MS0;  /* Micro sequencer 0 control registers */
    CTEMS_t MS1;  /* Micro sequencer 1 control registers */
    register8_t MS0PCL;  /* MS PC Low */
    register8_t MS0PCH;  /* MS PC High */
    register8_t MS0HIF;  /* MS Host Interface */
    register8_t reserved_10[1];
    register8_t MS0IR0;  /* MS Instruction Register 0 */
    register8_t MS0IR1;  /* MS Instruction Register 1 */
    register8_t MS0IR2;  /* MS Instruction Register 2 */
    register8_t MS0IR3;  /* MS Instruction Register 3 */
    register8_t MS0IRBUFL;  /* MS Instruction Register Buffer (low) */
    register8_t MS0IRBUFH;  /* MS Instruction Register Buffer (high) */
    register8_t MS0R0L;  /* MS R0 in register file (low) */
    register8_t MS0R0H;  /* MS R0 in register file (high) */
    register8_t MS0REPEATL;  /* MS Repeat Register (low) */
    register8_t MS0REPEATH;  /* MS Repeat Register (high) */
    register8_t reserved_11[2];
    register8_t MS1PCL;  /* MS PC Low */
    register8_t MS1PCH;  /* MS PC High */
    register8_t MS1HIF;  /* MS Host Interface */
    register8_t reserved_12[1];
    register8_t MS1IR0;  /* MS Instruction Register 0 */
    register8_t MS1IR1;  /* MS Instruction Register 1 */
    register8_t MS1IR2;  /* MS Instruction Register 2 */
    register8_t MS1IR3;  /* MS Instruction Register 3 */
    register8_t MS1IRBUFL;  /* MS Instruction Register Buffer (low) */
    register8_t MS1IRBUFH;  /* MS Instruction Register Buffer (high) */
    register8_t MS1R0L;  /* MS R0 in register file (low) */
    register8_t MS1R0H;  /* MS R0 in register file (high) */
    register8_t MS1REPEATL;  /* MS Repeat Register (low) */
    register8_t MS1REPEATH;  /* MS Repeat Register (high) */
    register8_t reserved_13[2];
    register8_t CTTEMP;  /* Temp register for 16-bit writes from CPU to uS */
    register8_t CTCRA;  /* CapTouch Control Register A */
    register8_t DMAPSCLR;  /* CapTouch Double Mapping register clr */
    register8_t DMAPSSET;  /* CapTouch Double Mapping register set */
    register8_t reserved_14[92];
} CTE_t;


