gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/*
--------------------------------------------------------------------------
DFLL - DFLL
--------------------------------------------------------------------------
*/

/* DFLL */
typedef struct DFLL_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t reserved_1[1];
    register8_t CALA;  /* Calibration Register A */
    register8_t CALB;  /* Calibration Register B */
    register8_t COMP0;  /* Oscillator Compare Register 0 */
    register8_t COMP1;  /* Oscillator Compare Register 1 */
    register8_t COMP2;  /* Oscillator Compare Register 2 */
    register8_t reserved_2[1];
} DFLL_t;


/*
--------------------------------------------------------------------------
MCU - MCU Control
--------------------------------------------------------------------------
*/

/* MCU Control */
typedef struct MCU_struct
{
    register8_t DEVID0;  /* Device ID byte 0 */
    register8_t DEVID1;  /* Device ID byte 1 */
    register8_t DEVID2;  /* Device ID byte 2 */
    register8_t REVID;  /* Revision ID */
    register8_t JTAGUID;  /* JTAG User ID */
    register8_t reserved_1[1];
    register8_t MCUCR;  /* MCU Control */
    register8_t reserved_2[1];
    register8_t EVSYSLOCK;  /* Event System Lock */
    register8_t AWEXLOCK;  /* AWEX Lock */
    register8_t reserved_3[2];
} MCU_t;


/*
--------------------------------------------------------------------------
NVM - Non Volatile Memory Controller
--------------------------------------------------------------------------
*/

/* Non-volatile Memory Controller */
typedef struct NVM_struct
{
    register8_t ADDR0;  /* Address Register 0 */
    register8_t ADDR1;  /* Address Register 1 */
    register8_t ADDR2;  /* Address Register 2 */
    register8_t reserved_1[1];
    register8_t DATA0;  /* Data Register 0 */
    register8_t DATA1;  /* Data Register 1 */
    register8_t DATA2;  /* Data Register 2 */
    register8_t reserved_2[3];
    register8_t CMD;  /* Command */
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t reserved_3[1];
    register8_t STATUS;  /* Status */
    register8_t LOCK_BITS;  /* Lock Bits (Changed from LOCKBITS to avoid avr-libc collision) */
} NVM_t;


/* Lock Bits */
typedef struct NVM_LOCKBITS_struct
{
    register8_t LOCK_BITS;  /* Lock Bits (Changed from LOCKBITS to avoid avr-libc collision) */
} NVM_LOCKBITS_t;


/* Fuses */
typedef struct NVM_FUSES_struct
{
    register8_t reserved_1[4];
    register8_t FUSEBYTE4;  /* Start-up Configuration */
    register8_t FUSEBYTE5;  /* BOD Level */
} NVM_FUSES_t;


/* Production Signatures */
typedef struct NVM_PROD_SIGNATURES_struct
{
    register8_t RC32MCALB;  /* RCOSC 32MHz Calibration Value B */
    register8_t RC32MCALA;  /* RCOSC 32MHz Calibration Value A */
    register8_t FUSEBYTE1;  /* Fuse Byte 1 Value */
    register8_t FUSE_EEH5;  /* FUSE_EEH5 */
    register8_t RC32K;  /* RC 32kHz Calibration Value */
    register8_t FUSE_EEH6;  /* FUSE_EEH6 */
    register8_t FUSEBYTE2;  /* Fuse Byte 2 Value */
    register8_t FUSE_EEH4;  /* FUSE_EEH4 */
    register8_t LOTNUM0;  /* Lot Number at sort, byte 0, ASCII */
    register8_t LOTNUM1;  /* Lot Number at sort, byte 1, ASCII */
    register8_t LOTNUM2;  /* Lot Number at sort, byte 2, ASCII */
    register8_t LOTNUM3;  /* Lot Number at sort, byte 3, ASCII */
    register8_t LOTNUM4;  /* Lot Number at sort, byte 4, ASCII */
    register8_t LOTNUM5;  /* Lot Number at sort, byte 5, ASCII */
    register8_t LOTNUM6;  /* Lot Number at sort, byte 6, ASCII */
    register8_t LOTNUM7;  /* Lot Number at sort, byte 7, ASCII */
    register8_t WAFNUM;  /* Wafer Number */
    register8_t reserved_1[1];
    register8_t COORDX0;  /* Wafer Coordinate X, byte 0 */
    register8_t COORDX1;  /* Wafer Coordinate X, byte 1 */
    register8_t COORDY0;  /* Wafer Coordinate Y, byte 0 */
    register8_t COORDY1;  /* Wafer Coordinate Y, byte 1 */
    register8_t LOTNUM8;  /* Lot Number at sort, byte 8, ASCII */
    register8_t LOTNUM9;  /* Lot Number at sort, byte 9, ASCII */
    register8_t LOTNUM10;  /* Lot Number at sort, byte 10, ASCII */
    register8_t LOTNUM11;  /* Lot Number at sort, byte 11, ASCII */
    register8_t reserved_2[30];
    register8_t BGCAL0;  /* BOD Bandgap Calibration Byte 0 */
    register8_t BGCAL1;  /* BOD Bandgap Calibration Byte 1 */
    register8_t BGCAL2;  /* BOD Bandgap Calibration Byte 2 */
    register8_t reserved_3[1];
    register8_t XLINE_BIAS_250_H;  /* X-line Bias Calibration 250 High */
    register8_t XLINE_BIAS_250_L;  /* X-line Bias Calibration 250 Low */
    register8_t XLINE_BIAS_350_H;  /* X-line Bias Calibration 350 High */
    register8_t XLINE_BIAS_350_L;  /* X-line Bias Calibration 350 Low */
    register8_t XLINE_BIAS_500_H;  /* X-line Bias Calibration 500 High */
    register8_t XLINE_BIAS_500_L;  /* X-line Bias Calibration 500 Low */
    register8_t YLINE_INT_BIAS;  /* Y-line Integrator Bias */
    register8_t YLINE_INT_CAP;  /* Y-line Integrator Capacitor */
    register8_t ADC10_CAL;  /* ADC10 Calibration Byte */
    register8_t ADCSHVBCALH;  /* ADCSHVBCALH */
    register8_t ADCSHVBCALL;  /* ADCSHVBCALL */
    register8_t YLINE_INT_BIAS_150;  /* Y-line Integrator Bias 150 */
    register8_t reserved_4[8];
    register8_t UID0_RANDOM_BYTE0;  /* UID0_RANDOM_BYTE0 */
    register8_t UID0_RANDOM_BYTE1;  /* UID0_RANDOM_BYTE1 */
    register8_t UID2_IP_HASH_BYTE0;  /* UID2_IP_HASH_BYTE0 */
    register8_t UID3_SITE;  /* UID3_SITE */
    register8_t UID3_UTC_Byte0;  /* UID3_UTC_Byte0 */
    register8_t UID4_UTC_Byte1;  /* UID4_UTC_Byte1 */
    register8_t UID5_UTC_Byte2;  /* UID5_UTC_Byte2 */
    register8_t UID6_UTC_Byte3;  /* UID6_UTC_Byte3 */
    register8_t reserved_5[84];
    register8_t BGEXTREME0_WS;  /* Bandgap Extreme Value 0 */
    register8_t BGEXTREME1_WS;  /* Bandgap Extreme Value 1 */
    register8_t BGEXTREME2_WS;  /* Bandgap Extreme Value 2 */
    register8_t BGEXTREME3_WS;  /* Bandgap Extreme Value 3 */
    register8_t reserved_6[78];
    register8_t CRCMASKL;  /* CRCMASK[7:0] */
    register8_t CRCMASKH;  /* CRCMASK[15:8] */
} NVM_PROD_SIGNATURES_t;

/* Boot lock bits - application section */
typedef enum NVM_BLBA_enum
{
    NVM_BLBA_RWLOCK_gc = (0x00<<4),  /* Read and write not allowed */
    NVM_BLBA_RLOCK_gc = (0x01<<4),  /* Read not allowed */
    NVM_BLBA_WLOCK_gc = (0x02<<4),  /* Write not allowed */
    NVM_BLBA_NOLOCK_gc = (0x03<<4),  /* No locks */
} NVM_BLBA_t;

/* Boot lock bits - application table section */
typedef enum NVM_BLBAT_enum
{
    NVM_BLBAT_RWLOCK_gc = (0x00<<2),  /* Read and write not allowed */
    NVM_BLBAT_RLOCK_gc = (0x01<<2),  /* Read not allowed */
    NVM_BLBAT_WLOCK_gc = (0x02<<2),  /* Write not allowed */
    NVM_BLBAT_NOLOCK_gc = (0x03<<2),  /* No locks */
} NVM_BLBAT_t;

/* Boot lock bits - boot setcion */
typedef enum NVM_BLBB_enum
{
    NVM_BLBB_RWLOCK_gc = (0x00<<6),  /* Read and write not allowed */
    NVM_BLBB_RLOCK_gc = (0x01<<6),  /* Read not allowed */
    NVM_BLBB_WLOCK_gc = (0x02<<6),  /* Write not allowed */
    NVM_BLBB_NOLOCK_gc = (0x03<<6),  /* No locks */
} NVM_BLBB_t;

/* NVM Command */
typedef enum NVM_CMD_enum
{
    NVM_CMD_NO_OPERATION_gc = (0x00<<0),  /* Noop/Ordinary LPM */
    NVM_CMD_READ_USER_SIG_ROW_gc = (0x01<<0),  /* Read user signature row */
    NVM_CMD_READ_CALIB_ROW_gc = (0x02<<0),  /* Read calibration row */
    NVM_CMD_READ_FUSES_gc = (0x07<<0),  /* Read fuse byte */
    NVM_CMD_WRITE_LOCK_BITS_gc = (0x08<<0),  /* Write lock bits */
    NVM_CMD_ERASE_USER_SIG_ROW_gc = (0x18<<0),  /* Erase user signature row */
    NVM_CMD_WRITE_USER_SIG_ROW_gc = (0x1A<<0),  /* Write user signature row */
    NVM_CMD_ERASE_APP_gc = (0x20<<0),  /* Erase Application Section */
    NVM_CMD_ERASE_APP_PAGE_gc = (0x22<<0),  /* Erase Application Section page */
    NVM_CMD_LOAD_FLASH_BUFFER_gc = (0x23<<0),  /* Load Flash page buffer */
    NVM_CMD_WRITE_APP_PAGE_gc = (0x24<<0),  /* Write Application Section page */
    NVM_CMD_ERASE_WRITE_APP_PAGE_gc = (0x25<<0),  /* Erase-and-write Application Section page */
    NVM_CMD_ERASE_FLASH_BUFFER_gc = (0x26<<0),  /* Erase/flush Flash page buffer */
    NVM_CMD_ERASE_BOOT_PAGE_gc = (0x2A<<0),  /* Erase Boot Section page */
    NVM_CMD_WRITE_BOOT_PAGE_gc = (0x2C<<0),  /* Write Boot Section page */
    NVM_CMD_ERASE_WRITE_BOOT_PAGE_gc = (0x2D<<0),  /* Erase-and-write Boot Section page */
    NVM_CMD_APP_CRC_gc = (0x38<<0),  /* Generate Application section CRC */
    NVM_CMD_BOOT_CRC_gc = (0x39<<0),  /* Generate Boot Section CRC */
    NVM_CMD_FLASH_RANGE_CRC_gc = (0x3A<<0),  /* Generate Flash Range CRC */
} NVM_CMD_t;

/* Lock bits */
typedef enum NVM_LB_enum
{
    NVM_LB_RWLOCK_gc = (0x00<<0),  /* Read and write not allowed */
    NVM_LB_WLOCK_gc = (0x02<<0),  /* Write not allowed */
    NVM_LB_NOLOCK_gc = (0x03<<0),  /* No locks */
} NVM_LB_t;

/* SPM ready interrupt level */
typedef enum NVM_SPMLVL_enum
{
    NVM_SPMLVL_OFF_gc = (0x00<<2),  /* Interrupt disabled */
    NVM_SPMLVL_LO_gc = (0x01<<2),  /* Low level */
    NVM_SPMLVL_MED_gc = (0x02<<2),  /* Medium level */
    NVM_SPMLVL_HI_gc = (0x03<<2),  /* High level */
} NVM_SPMLVL_t;

/* Boot lock bits - application section */
typedef enum NVM_LOCKBITS_BLBA_enum
{
    NVM_LOCKBITS_BLBA_RWLOCK_gc = (0x00<<4),  /* Read and write not allowed */
    NVM_LOCKBITS_BLBA_RLOCK_gc = (0x01<<4),  /* Read not allowed */
    NVM_LOCKBITS_BLBA_WLOCK_gc = (0x02<<4),  /* Write not allowed */
    NVM_LOCKBITS_BLBA_NOLOCK_gc = (0x03<<4),  /* No locks */
} NVM_LOCKBITS_BLBA_t;

/* Boot lock bits - application table section */
typedef enum NVM_LOCKBITS_BLBAT_enum
{
    NVM_LOCKBITS_BLBAT_RWLOCK_gc = (0x00<<2),  /* Read and write not allowed */
    NVM_LOCKBITS_BLBAT_RLOCK_gc = (0x01<<2),  /* Read not allowed */
    NVM_LOCKBITS_BLBAT_WLOCK_gc = (0x02<<2),  /* Write not allowed */
    NVM_LOCKBITS_BLBAT_NOLOCK_gc = (0x03<<2),  /* No locks */
} NVM_LOCKBITS_BLBAT_t;

/* Boot lock bits - boot setcion */
typedef enum NVM_LOCKBITS_BLBB_enum
{
    NVM_LOCKBITS_BLBB_RWLOCK_gc = (0x00<<6),  /* Read and write not allowed */
    NVM_LOCKBITS_BLBB_RLOCK_gc = (0x01<<6),  /* Read not allowed */
    NVM_LOCKBITS_BLBB_WLOCK_gc = (0x02<<6),  /* Write not allowed */
    NVM_LOCKBITS_BLBB_NOLOCK_gc = (0x03<<6),  /* No locks */
} NVM_LOCKBITS_BLBB_t;

/* Lock bits */
typedef enum NVM_LOCKBITS_LB_enum
{
    NVM_LOCKBITS_LB_RWLOCK_gc = (0x00<<0),  /* Read and write not allowed */
    NVM_LOCKBITS_LB_WLOCK_gc = (0x02<<0),  /* Write not allowed */
    NVM_LOCKBITS_LB_NOLOCK_gc = (0x03<<0),  /* No locks */
} NVM_LOCKBITS_LB_t;

/* BOD operation */
typedef enum NVM_FUSES_BODACT_enum
{
    NVM_FUSES_BODACT_INSAMPLEDMODE_gc = (0x01<<4),  /* BOD enabled in sampled mode */
    NVM_FUSES_BODACT_CONTINOUSLY_gc = (0x02<<4),  /* BOD enabled continuously */
    NVM_FUSES_BODACT_DISABLED_gc = (0x03<<4),  /* BOD Disabled */
} NVM_FUSES_BODACT_t;

/* Brownout Detection Voltage Level */
typedef enum NVM_FUSES_BODLVL_enum
{
    NVM_FUSES_BODLVL_3V0_gc = (0x00<<0),  /* 3.0 V */
    NVM_FUSES_BODLVL_2V8_gc = (0x01<<0),  /* 2.8 V */
    NVM_FUSES_BODLVL_2V6_gc = (0x02<<0),  /* 2.6 V */
    NVM_FUSES_BODLVL_2V4_gc = (0x03<<0),  /* 2.4 V */
    NVM_FUSES_BODLVL_2V2_gc = (0x04<<0),  /* 2.2 V */
    NVM_FUSES_BODLVL_2V0_gc = (0x05<<0),  /* 2.0 V */
    NVM_FUSES_BODLVL_1V8_gc = (0x06<<0),  /* 1.8 V */
    NVM_FUSES_BODLVL_1V6_gc = (0x07<<0),  /* 1.6 V */
} NVM_FUSES_BODLVL_t;

/* Start-up Time */
typedef enum NVM_FUSES_SUT_enum
{
    NVM_FUSES_SUT_64MS_gc = (0x00<<2),  /* 64 ms */
    NVM_FUSES_SUT_4MS_gc = (0x01<<2),  /* 4 ms */
    NVM_FUSES_SUT_0MS_gc = (0x03<<2),  /* 0 ms */
} NVM_FUSES_SUT_t;

