gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* TC0 (TCC0) - 16-bit Timer/Counter 0 */
#define TCC0_CTRLA  _SFR_MEM8(0x0800)
#define TCC0_CTRLB  _SFR_MEM8(0x0801)
#define TCC0_CTRLC  _SFR_MEM8(0x0802)
#define TCC0_CTRLD  _SFR_MEM8(0x0803)
#define TCC0_CTRLE  _SFR_MEM8(0x0804)
#define TCC0_INTCTRLA  _SFR_MEM8(0x0806)
#define TCC0_INTCTRLB  _SFR_MEM8(0x0807)
#define TCC0_CTRLFCLR  _SFR_MEM8(0x0808)
#define TCC0_CTRLFSET  _SFR_MEM8(0x0809)
#define TCC0_CTRLGCLR  _SFR_MEM8(0x080A)
#define TCC0_CTRLGSET  _SFR_MEM8(0x080B)
#define TCC0_INTFLAGS  _SFR_MEM8(0x080C)
#define TCC0_TEMP  _SFR_MEM8(0x080F)
#define TCC0_CNT  _SFR_MEM16(0x0820)
#define TCC0_CNTL  _SFR_MEM8(0x0820)
#define TCC0_CNTH  _SFR_MEM8(0x0821)
#define TCC0_PER  _SFR_MEM16(0x0826)
#define TCC0_PERL  _SFR_MEM8(0x0826)
#define TCC0_PERH  _SFR_MEM8(0x0827)
#define TCC0_CCA  _SFR_MEM16(0x0828)
#define TCC0_CCAL  _SFR_MEM8(0x0828)
#define TCC0_CCAH  _SFR_MEM8(0x0829)
#define TCC0_CCB  _SFR_MEM16(0x082A)
#define TCC0_CCBL  _SFR_MEM8(0x082A)
#define TCC0_CCBH  _SFR_MEM8(0x082B)
#define TCC0_CCC  _SFR_MEM16(0x082C)
#define TCC0_CCCL  _SFR_MEM8(0x082C)
#define TCC0_CCCH  _SFR_MEM8(0x082D)
#define TCC0_CCD  _SFR_MEM16(0x082E)
#define TCC0_CCDL  _SFR_MEM8(0x082E)
#define TCC0_CCDH  _SFR_MEM8(0x082F)
#define TCC0_PERBUF  _SFR_MEM16(0x0836)
#define TCC0_PERBUFL  _SFR_MEM8(0x0836)
#define TCC0_PERBUFH  _SFR_MEM8(0x0837)
#define TCC0_CCABUF  _SFR_MEM16(0x0838)
#define TCC0_CCABUFL  _SFR_MEM8(0x0838)
#define TCC0_CCABUFH  _SFR_MEM8(0x0839)
#define TCC0_CCBBUF  _SFR_MEM16(0x083A)
#define TCC0_CCBBUFL  _SFR_MEM8(0x083A)
#define TCC0_CCBBUFH  _SFR_MEM8(0x083B)
#define TCC0_CCCBUF  _SFR_MEM16(0x083C)
#define TCC0_CCCBUFL  _SFR_MEM8(0x083C)
#define TCC0_CCCBUFH  _SFR_MEM8(0x083D)
#define TCC0_CCDBUF  _SFR_MEM16(0x083E)
#define TCC0_CCDBUFL  _SFR_MEM8(0x083E)
#define TCC0_CCDBUFH  _SFR_MEM8(0x083F)


/* TC1 (TCC1) - 16-bit Timer/Counter 1 */
#define TCC1_CTRLA  _SFR_MEM8(0x0840)
#define TCC1_CTRLB  _SFR_MEM8(0x0841)
#define TCC1_CTRLC  _SFR_MEM8(0x0842)
#define TCC1_CTRLD  _SFR_MEM8(0x0843)
#define TCC1_CTRLE  _SFR_MEM8(0x0844)
#define TCC1_INTCTRLA  _SFR_MEM8(0x0846)
#define TCC1_INTCTRLB  _SFR_MEM8(0x0847)
#define TCC1_CTRLFCLR  _SFR_MEM8(0x0848)
#define TCC1_CTRLFSET  _SFR_MEM8(0x0849)
#define TCC1_CTRLGCLR  _SFR_MEM8(0x084A)
#define TCC1_CTRLGSET  _SFR_MEM8(0x084B)
#define TCC1_INTFLAGS  _SFR_MEM8(0x084C)
#define TCC1_TEMP  _SFR_MEM8(0x084F)
#define TCC1_CNT  _SFR_MEM16(0x0860)
#define TCC1_CNTL  _SFR_MEM8(0x0860)
#define TCC1_CNTH  _SFR_MEM8(0x0861)
#define TCC1_PER  _SFR_MEM16(0x0866)
#define TCC1_PERL  _SFR_MEM8(0x0866)
#define TCC1_PERH  _SFR_MEM8(0x0867)
#define TCC1_CCA  _SFR_MEM16(0x0868)
#define TCC1_CCAL  _SFR_MEM8(0x0868)
#define TCC1_CCAH  _SFR_MEM8(0x0869)
#define TCC1_CCB  _SFR_MEM16(0x086A)
#define TCC1_CCBL  _SFR_MEM8(0x086A)
#define TCC1_CCBH  _SFR_MEM8(0x086B)
#define TCC1_PERBUF  _SFR_MEM16(0x0876)
#define TCC1_PERBUFL  _SFR_MEM8(0x0876)
#define TCC1_PERBUFH  _SFR_MEM8(0x0877)
#define TCC1_CCABUF  _SFR_MEM16(0x0878)
#define TCC1_CCABUFL  _SFR_MEM8(0x0878)
#define TCC1_CCABUFH  _SFR_MEM8(0x0879)
#define TCC1_CCBBUF  _SFR_MEM16(0x087A)
#define TCC1_CCBBUFL  _SFR_MEM8(0x087A)
#define TCC1_CCBBUFH  _SFR_MEM8(0x087B)


/* USART (USARTC0) - Universal Synchronous/Asynchronous Receiver/Transmitter */
#define USARTC0_DATA  _SFR_MEM8(0x08A0)
#define USARTC0_STATUS  _SFR_MEM8(0x08A1)
#define USARTC0_CTRLA  _SFR_MEM8(0x08A3)
#define USARTC0_CTRLB  _SFR_MEM8(0x08A4)
#define USARTC0_CTRLC  _SFR_MEM8(0x08A5)
#define USARTC0_BAUDCTRLA  _SFR_MEM8(0x08A6)
#define USARTC0_BAUDCTRLB  _SFR_MEM8(0x08A7)


/* SPI (SPIC) - Serial Peripheral Interface */
#define SPIC_CTRL  _SFR_MEM8(0x08C0)
#define SPIC_INTCTRL  _SFR_MEM8(0x08C1)
#define SPIC_STATUS  _SFR_MEM8(0x08C2)
#define SPIC_DATA  _SFR_MEM8(0x08C3)


/* CTE - CTE Module */
#define CTE_ADCYCHR  _SFR_MEM16(0x0C00)
#define CTE_ADCYCHRL  _SFR_MEM8(0x0C00)
#define CTE_ADCYCHRH  _SFR_MEM8(0x0C01)
#define CTE_INTCRC  _SFR_MEM16(0x0C02)
#define CTE_INTCRCL  _SFR_MEM8(0x0C02)
#define CTE_INTCRCH  _SFR_MEM8(0x0C03)
#define CTE_ADCSRACLR  _SFR_MEM16(0x0C04)
#define CTE_ADCSRACLRL  _SFR_MEM8(0x0C04)
#define CTE_ADCSRACLRH  _SFR_MEM8(0x0C05)
#define CTE_ADCSRASET  _SFR_MEM16(0x0C06)
#define CTE_ADCSRASETL  _SFR_MEM8(0x0C06)
#define CTE_ADCSRASETH  _SFR_MEM8(0x0C07)
#define CTE_INTCRBCLR  _SFR_MEM16(0x0C08)
#define CTE_INTCRBCLRL  _SFR_MEM8(0x0C08)
#define CTE_INTCRBCLRH  _SFR_MEM8(0x0C09)
#define CTE_INTCRBSET  _SFR_MEM16(0x0C0A)
#define CTE_INTCRBSETL  _SFR_MEM8(0x0C0A)
#define CTE_INTCRBSETH  _SFR_MEM8(0x0C0B)
#define CTE_INTCRECLR  _SFR_MEM16(0x0C0C)
#define CTE_INTCRECLRL  _SFR_MEM8(0x0C0C)
#define CTE_INTCRECLRH  _SFR_MEM8(0x0C0D)
#define CTE_INTCRESET  _SFR_MEM16(0x0C0E)
#define CTE_INTCRESETL  _SFR_MEM8(0x0C0E)
#define CTE_INTCRESETH  _SFR_MEM8(0x0C0F)
#define CTE_INTXCHR  _SFR_MEM16(0x0C10)
#define CTE_INTXCHRL  _SFR_MEM8(0x0C10)
#define CTE_INTXCHRH  _SFR_MEM8(0x0C11)
#define CTE_INTOENA  _SFR_MEM16(0x0C12)
#define CTE_INTOENAL  _SFR_MEM8(0x0C12)
#define CTE_INTOENAH  _SFR_MEM8(0x0C13)
#define CTE_INTOENB  _SFR_MEM16(0x0C14)
#define CTE_INTOENBL  _SFR_MEM8(0x0C14)
#define CTE_INTOENBH  _SFR_MEM8(0x0C15)
#define CTE_TIMMOECMP  _SFR_MEM16(0x0C16)
#define CTE_TIMMOECMPL  _SFR_MEM8(0x0C16)
#define CTE_TIMMOECMPH  _SFR_MEM8(0x0C17)
#define CTE_HVCRA  _SFR_MEM16(0x0C18)
#define CTE_HVCRAL  _SFR_MEM8(0x0C18)
#define CTE_HVCRAH  _SFR_MEM8(0x0C19)
#define CTE_TIMAPER  _SFR_MEM16(0x0C1A)
#define CTE_TIMAPERL  _SFR_MEM8(0x0C1A)
#define CTE_TIMAPERH  _SFR_MEM8(0x0C1B)
#define CTE_TIMBPER  _SFR_MEM16(0x0C1C)
#define CTE_TIMBPERL  _SFR_MEM8(0x0C1C)
#define CTE_TIMBPERH  _SFR_MEM8(0x0C1D)
#define CTE_TIMCPER  _SFR_MEM16(0x0C1E)
#define CTE_TIMCPERL  _SFR_MEM8(0x0C1E)
#define CTE_TIMCPERH  _SFR_MEM8(0x0C1F)
#define CTE_TIMMOEPER  _SFR_MEM16(0x0C20)
#define CTE_TIMMOEPERL  _SFR_MEM8(0x0C20)
#define CTE_TIMMOEPERH  _SFR_MEM8(0x0C21)
#define CTE_INTDONE  _SFR_MEM16(0x0C24)
#define CTE_INTDONEL  _SFR_MEM8(0x0C24)
#define CTE_INTDONEH  _SFR_MEM8(0x0C25)
#define CTE_INTTRIGA  _SFR_MEM16(0x0C26)
#define CTE_INTTRIGAL  _SFR_MEM8(0x0C26)
#define CTE_INTTRIGAH  _SFR_MEM8(0x0C27)
#define CTE_INTTRIGB  _SFR_MEM16(0x0C28)
#define CTE_INTTRIGBL  _SFR_MEM8(0x0C28)
#define CTE_INTTRIGBH  _SFR_MEM8(0x0C29)
#define CTE_INTCRFCLR  _SFR_MEM16(0x0C2C)
#define CTE_INTCRFCLRL  _SFR_MEM8(0x0C2C)
#define CTE_INTCRFCLRH  _SFR_MEM8(0x0C2D)
#define CTE_INTCRFSET  _SFR_MEM16(0x0C2E)
#define CTE_INTCRFSETL  _SFR_MEM8(0x0C2E)
#define CTE_INTCRFSETH  _SFR_MEM8(0x0C2F)
#define CTE_GCAFSRA  _SFR_MEM16(0x0C30)
#define CTE_GCAFSRAL  _SFR_MEM8(0x0C30)
#define CTE_GCAFSRAH  _SFR_MEM8(0x0C31)
#define CTE_GCAFHDLCNT  _SFR_MEM16(0x0C32)
#define CTE_GCAFHDLCNTL  _SFR_MEM8(0x0C32)
#define CTE_GCAFHDLCNTH  _SFR_MEM8(0x0C33)
#define CTE_GCAFHDHCNT  _SFR_MEM16(0x0C34)
#define CTE_GCAFHDHCNTL  _SFR_MEM8(0x0C34)
#define CTE_GCAFHDHCNTH  _SFR_MEM8(0x0C35)
#define CTE_GCAFCCCLIM  _SFR_MEM16(0x0C36)
#define CTE_GCAFCCCLIML  _SFR_MEM8(0x0C36)
#define CTE_GCAFCCCLIMH  _SFR_MEM8(0x0C37)
#define CTE_PIFXPORTA  _SFR_MEM16(0x0C38)
#define CTE_PIFXPORTAL  _SFR_MEM8(0x0C38)
#define CTE_PIFXPORTAH  _SFR_MEM8(0x0C39)
#define CTE_PIFXPORTB  _SFR_MEM16(0x0C3A)
#define CTE_PIFXPORTBL  _SFR_MEM8(0x0C3A)
#define CTE_PIFXPORTBH  _SFR_MEM8(0x0C3B)
#define CTE_PIFYPORTA  _SFR_MEM16(0x0C3C)
#define CTE_PIFYPORTAL  _SFR_MEM8(0x0C3C)
#define CTE_PIFYPORTAH  _SFR_MEM8(0x0C3D)
#define CTE_PIFYPORTB  _SFR_MEM16(0x0C3E)
#define CTE_PIFYPORTBL  _SFR_MEM8(0x0C3E)
#define CTE_PIFYPORTBH  _SFR_MEM8(0x0C3F)
#define CTE_PIFXDDRA  _SFR_MEM16(0x0C40)
#define CTE_PIFXDDRAL  _SFR_MEM8(0x0C40)
#define CTE_PIFXDDRAH  _SFR_MEM8(0x0C41)
#define CTE_PIFXDDRB  _SFR_MEM16(0x0C42)
#define CTE_PIFXDDRBL  _SFR_MEM8(0x0C42)
#define CTE_PIFXDDRBH  _SFR_MEM8(0x0C43)
#define CTE_PIFYDDRA  _SFR_MEM16(0x0C44)
#define CTE_PIFYDDRAL  _SFR_MEM8(0x0C44)
#define CTE_PIFYDDRAH  _SFR_MEM8(0x0C45)
#define CTE_PIFYDDRB  _SFR_MEM16(0x0C46)
#define CTE_PIFYDDRBL  _SFR_MEM8(0x0C46)
#define CTE_PIFYDDRBH  _SFR_MEM8(0x0C47)
#define CTE_PIFXTGLA  _SFR_MEM16(0x0C48)
#define CTE_PIFXTGLAL  _SFR_MEM8(0x0C48)
#define CTE_PIFXTGLAH  _SFR_MEM8(0x0C49)
#define CTE_PIFXTGLB  _SFR_MEM16(0x0C4A)
#define CTE_PIFXTGLBL  _SFR_MEM8(0x0C4A)
#define CTE_PIFXTGLBH  _SFR_MEM8(0x0C4B)
#define CTE_PIFYTGLA  _SFR_MEM16(0x0C4C)
#define CTE_PIFYTGLAL  _SFR_MEM8(0x0C4C)
#define CTE_PIFYTGLAH  _SFR_MEM8(0x0C4D)
#define CTE_PIFYTGLB  _SFR_MEM16(0x0C4E)
#define CTE_PIFYTGLBL  _SFR_MEM8(0x0C4E)
#define CTE_PIFYTGLBH  _SFR_MEM8(0x0C4F)
#define CTE_PIFILA  _SFR_MEM16(0x0C50)
#define CTE_PIFILAL  _SFR_MEM8(0x0C50)
#define CTE_PIFILAH  _SFR_MEM8(0x0C51)
#define CTE_PIFILB  _SFR_MEM16(0x0C52)
#define CTE_PIFILBL  _SFR_MEM8(0x0C52)
#define CTE_PIFILBH  _SFR_MEM8(0x0C53)
#define CTE_PIFILE  _SFR_MEM16(0x0C54)
#define CTE_PIFILEL  _SFR_MEM8(0x0C54)
#define CTE_PIFILEH  _SFR_MEM8(0x0C55)
#define CTE_PIFILO  _SFR_MEM16(0x0C56)
#define CTE_PIFILOL  _SFR_MEM8(0x0C56)
#define CTE_PIFILOH  _SFR_MEM8(0x0C57)
#define CTE_ADCCRA  _SFR_MEM16(0x0C80)
#define CTE_ADCCRAL  _SFR_MEM8(0x0C80)
#define CTE_ADCCRAH  _SFR_MEM8(0x0C81)
#define CTE_ADCCRB  _SFR_MEM16(0x0C82)
#define CTE_ADCCRBL  _SFR_MEM8(0x0C82)
#define CTE_ADCCRBH  _SFR_MEM8(0x0C83)
#define CTE_ADCINTCAL  _SFR_MEM16(0x0C84)
#define CTE_ADCINTCALL  _SFR_MEM8(0x0C84)
#define CTE_ADCINTCALH  _SFR_MEM8(0x0C85)
#define CTE_ADCRES  _SFR_MEM16(0x0C86)
#define CTE_ADCRESL  _SFR_MEM8(0x0C86)
#define CTE_ADCRESH  _SFR_MEM8(0x0C87)
#define CTE_ADCINTTEST  _SFR_MEM16(0x0C88)
#define CTE_ADCINTTESTL  _SFR_MEM8(0x0C88)
#define CTE_ADCINTTESTH  _SFR_MEM8(0x0C89)
#define CTE_ADCSHVBCAL  _SFR_MEM16(0x0C8A)
#define CTE_ADCSHVBCALL  _SFR_MEM8(0x0C8A)
#define CTE_ADCSHVBCALH  _SFR_MEM8(0x0C8B)
#define CTE_INTCRA  _SFR_MEM16(0x0C8C)
#define CTE_INTCRAL  _SFR_MEM8(0x0C8C)
#define CTE_INTCRAH  _SFR_MEM8(0x0C8D)
#define CTE_INTCRD  _SFR_MEM16(0x0C8E)
#define CTE_INTCRDL  _SFR_MEM8(0x0C8E)
#define CTE_INTCRDH  _SFR_MEM8(0x0C8F)
#define CTE_INTENA  _SFR_MEM16(0x0C90)
#define CTE_INTENAL  _SFR_MEM8(0x0C90)
#define CTE_INTENAH  _SFR_MEM8(0x0C91)
#define CTE_INTENB  _SFR_MEM16(0x0C92)
#define CTE_INTENBL  _SFR_MEM8(0x0C92)
#define CTE_INTENBH  _SFR_MEM8(0x0C93)
#define CTE_INTMASKENA  _SFR_MEM16(0x0C94)
#define CTE_INTMASKENAL  _SFR_MEM8(0x0C94)
#define CTE_INTMASKENAH  _SFR_MEM8(0x0C95)
#define CTE_INTMASKENB  _SFR_MEM16(0x0C96)
#define CTE_INTMASKENBL  _SFR_MEM8(0x0C96)
#define CTE_INTMASKENBH  _SFR_MEM8(0x0C97)
#define CTE_SHENA  _SFR_MEM16(0x0C98)
#define CTE_SHENAL  _SFR_MEM8(0x0C98)
#define CTE_SHENAH  _SFR_MEM8(0x0C99)
#define CTE_SHENB  _SFR_MEM16(0x0C9A)
#define CTE_SHENBL  _SFR_MEM8(0x0C9A)
#define CTE_SHENBH  _SFR_MEM8(0x0C9B)
#define CTE_BIASCR  _SFR_MEM16(0x0C9C)
#define CTE_BIASCRL  _SFR_MEM8(0x0C9C)
#define CTE_BIASCRH  _SFR_MEM8(0x0C9D)
#define CTE_HVSEQT  _SFR_MEM16(0x0C9E)
#define CTE_HVSEQTL  _SFR_MEM8(0x0C9E)
#define CTE_HVSEQTH  _SFR_MEM8(0x0C9F)
#define CTE_INTXCHMAX  _SFR_MEM16(0x0CA0)
#define CTE_INTXCHMAXL  _SFR_MEM8(0x0CA0)
#define CTE_INTXCHMAXH  _SFR_MEM8(0x0CA1)
#define CTE_SCGRNGYN  _SFR_MEM16(0x0CA2)
#define CTE_SCGRNGYNL  _SFR_MEM8(0x0CA2)
#define CTE_SCGRNGYNH  _SFR_MEM8(0x0CA3)
#define CTE_SCGRNGYP  _SFR_MEM16(0x0CA4)
#define CTE_SCGRNGYPL  _SFR_MEM8(0x0CA4)
#define CTE_SCGRNGYPH  _SFR_MEM8(0x0CA5)
#define CTE_SCGRNGXN  _SFR_MEM16(0x0CA6)
#define CTE_SCGRNGXNL  _SFR_MEM8(0x0CA6)
#define CTE_SCGRNGXNH  _SFR_MEM8(0x0CA7)
#define CTE_SCGRNGXP  _SFR_MEM16(0x0CA8)
#define CTE_SCGRNGXPL  _SFR_MEM8(0x0CA8)
#define CTE_SCGRNGXPH  _SFR_MEM8(0x0CA9)
#define CTE_SCGRNGPN  _SFR_MEM16(0x0CAA)
#define CTE_SCGRNGPNL  _SFR_MEM8(0x0CAA)
#define CTE_SCGRNGPNH  _SFR_MEM8(0x0CAB)
#define CTE_SCGRNGPP  _SFR_MEM16(0x0CAC)
#define CTE_SCGRNGPPL  _SFR_MEM8(0x0CAC)
#define CTE_SCGRNGPPH  _SFR_MEM8(0x0CAD)
#define CTE_INTCAPRSTCR  _SFR_MEM16(0x0CAE)
#define CTE_INTCAPRSTCRL  _SFR_MEM8(0x0CAE)
#define CTE_INTCAPRSTCRH  _SFR_MEM8(0x0CAF)
#define CTE_INTGAIN0  _SFR_MEM16(0x0CB0)
#define CTE_INTGAIN0L  _SFR_MEM8(0x0CB0)
#define CTE_INTGAIN0H  _SFR_MEM8(0x0CB1)
#define CTE_INTGAIN1  _SFR_MEM16(0x0CB2)
#define CTE_INTGAIN1L  _SFR_MEM8(0x0CB2)
#define CTE_INTGAIN1H  _SFR_MEM8(0x0CB3)
#define CTE_INTGAIN2  _SFR_MEM16(0x0CB4)
#define CTE_INTGAIN2L  _SFR_MEM8(0x0CB4)
#define CTE_INTGAIN2H  _SFR_MEM8(0x0CB5)
#define CTE_INTGAIN3  _SFR_MEM16(0x0CB6)
#define CTE_INTGAIN3L  _SFR_MEM8(0x0CB6)
#define CTE_INTGAIN3H  _SFR_MEM8(0x0CB7)
#define CTE_INTGAIN4  _SFR_MEM16(0x0CB8)
#define CTE_INTGAIN4L  _SFR_MEM8(0x0CB8)
#define CTE_INTGAIN4H  _SFR_MEM8(0x0CB9)
#define CTE_TIMACMP  _SFR_MEM16(0x0CC0)
#define CTE_TIMACMPL  _SFR_MEM8(0x0CC0)
#define CTE_TIMACMPH  _SFR_MEM8(0x0CC1)
#define CTE_TIMBCMP  _SFR_MEM16(0x0CC2)
#define CTE_TIMBCMPL  _SFR_MEM8(0x0CC2)
#define CTE_TIMBCMPH  _SFR_MEM8(0x0CC3)
#define CTE_PADYCHCOMPA  _SFR_MEM16(0x0CC4)
#define CTE_PADYCHCOMPAL  _SFR_MEM8(0x0CC4)
#define CTE_PADYCHCOMPAH  _SFR_MEM8(0x0CC5)
#define CTE_PADYCHCOMPB  _SFR_MEM16(0x0CC6)
#define CTE_PADYCHCOMPBL  _SFR_MEM8(0x0CC6)
#define CTE_PADYCHCOMPBH  _SFR_MEM8(0x0CC7)
#define CTE_PADBNY1  _SFR_MEM16(0x0CC8)
#define CTE_PADBNY1L  _SFR_MEM8(0x0CC8)
#define CTE_PADBNY1H  _SFR_MEM8(0x0CC9)
#define CTE_PADBPY1  _SFR_MEM16(0x0CCA)
#define CTE_PADBPY1L  _SFR_MEM8(0x0CCA)
#define CTE_PADBPY1H  _SFR_MEM8(0x0CCB)
#define CTE_PADY1  _SFR_MEM16(0x0CCC)
#define CTE_PADY1L  _SFR_MEM8(0x0CCC)
#define CTE_PADY1H  _SFR_MEM8(0x0CCD)
#define CTE_XYBIAS  _SFR_MEM16(0x0CCE)
#define CTE_XYBIASL  _SFR_MEM8(0x0CCE)
#define CTE_XYBIASH  _SFR_MEM8(0x0CCF)
#define CTE_PADSCMEXA  _SFR_MEM16(0x0CD0)
#define CTE_PADSCMEXAL  _SFR_MEM8(0x0CD0)
#define CTE_PADSCMEXAH  _SFR_MEM8(0x0CD1)
#define CTE_PADSCMEXB  _SFR_MEM16(0x0CD2)
#define CTE_PADSCMEXBL  _SFR_MEM8(0x0CD2)
#define CTE_PADSCMEXBH  _SFR_MEM8(0x0CD3)
#define CTE_PADSCMEYA  _SFR_MEM16(0x0CD4)
#define CTE_PADSCMEYAL  _SFR_MEM8(0x0CD4)
#define CTE_PADSCMEYAH  _SFR_MEM8(0x0CD5)
#define CTE_PADSCMEYB  _SFR_MEM16(0x0CD6)
#define CTE_PADSCMEYBL  _SFR_MEM8(0x0CD6)
#define CTE_PADSCMEYBH  _SFR_MEM8(0x0CD7)
#define CTE_PADYONXENA  _SFR_MEM16(0x0CD8)
#define CTE_PADYONXENAL  _SFR_MEM8(0x0CD8)
#define CTE_PADYONXENAH  _SFR_MEM8(0x0CD9)
#define CTE_PADYONXENB  _SFR_MEM16(0x0CDA)
#define CTE_PADYONXENBL  _SFR_MEM8(0x0CDA)
#define CTE_PADYONXENBH  _SFR_MEM8(0x0CDB)
#define CTE_PADXONXENA  _SFR_MEM16(0x0CDC)
#define CTE_PADXONXENAL  _SFR_MEM8(0x0CDC)
#define CTE_PADXONXENAH  _SFR_MEM8(0x0CDD)
#define CTE_PADXONXENB  _SFR_MEM16(0x0CDE)
#define CTE_PADXONXENBL  _SFR_MEM8(0x0CDE)
#define CTE_PADXONXENBH  _SFR_MEM8(0x0CDF)
#define CTE_PADYONYENA  _SFR_MEM16(0x0CE0)
#define CTE_PADYONYENAL  _SFR_MEM8(0x0CE0)
#define CTE_PADYONYENAH  _SFR_MEM8(0x0CE1)
#define CTE_PADYONYENB  _SFR_MEM16(0x0CE2)
#define CTE_PADYONYENBL  _SFR_MEM8(0x0CE2)
#define CTE_PADYONYENBH  _SFR_MEM8(0x0CE3)
#define CTE_PADPROXENXA  _SFR_MEM16(0x0CE4)
#define CTE_PADPROXENXAL  _SFR_MEM8(0x0CE4)
#define CTE_PADPROXENXAH  _SFR_MEM8(0x0CE5)
#define CTE_PADPROXENXB  _SFR_MEM16(0x0CE6)
#define CTE_PADPROXENXBL  _SFR_MEM8(0x0CE6)
#define CTE_PADPROXENXBH  _SFR_MEM8(0x0CE7)
#define CTE_PADPROXENYA  _SFR_MEM16(0x0CE8)
#define CTE_PADPROXENYAL  _SFR_MEM8(0x0CE8)
#define CTE_PADPROXENYAH  _SFR_MEM8(0x0CE9)
#define CTE_PADPROXENYB  _SFR_MEM16(0x0CEA)
#define CTE_PADPROXENYBL  _SFR_MEM8(0x0CEA)
#define CTE_PADPROXENYBH  _SFR_MEM8(0x0CEB)
#define CTE_PADYRESENA  _SFR_MEM16(0x0CF4)
#define CTE_PADYRESENAL  _SFR_MEM8(0x0CF4)
#define CTE_PADYRESENAH  _SFR_MEM8(0x0CF5)
#define CTE_PADYRESENB  _SFR_MEM16(0x0CF6)
#define CTE_PADYRESENBL  _SFR_MEM8(0x0CF6)
#define CTE_PADYRESENBH  _SFR_MEM8(0x0CF7)
#define CTE_PADSCICALENA  _SFR_MEM16(0x0CF8)
#define CTE_PADSCICALENAL  _SFR_MEM8(0x0CF8)
#define CTE_PADSCICALENAH  _SFR_MEM8(0x0CF9)
#define CTE_PADSCICALENB  _SFR_MEM16(0x0CFA)
#define CTE_PADSCICALENBL  _SFR_MEM8(0x0CFA)
#define CTE_PADSCICALENBH  _SFR_MEM8(0x0CFB)
#define CTE_PADINTENA  _SFR_MEM16(0x0CFC)
#define CTE_PADINTENAL  _SFR_MEM8(0x0CFC)
#define CTE_PADINTENAH  _SFR_MEM8(0x0CFD)
#define CTE_PADINTENB  _SFR_MEM16(0x0CFE)
#define CTE_PADINTENBL  _SFR_MEM8(0x0CFE)
#define CTE_PADINTENBH  _SFR_MEM8(0x0CFF)
#define CTE_PADSCX0  _SFR_MEM16(0x0D00)
#define CTE_PADSCX0L  _SFR_MEM8(0x0D00)
#define CTE_PADSCX0H  _SFR_MEM8(0x0D01)
#define CTE_PADSCX1  _SFR_MEM16(0x0D02)
#define CTE_PADSCX1L  _SFR_MEM8(0x0D02)
#define CTE_PADSCX1H  _SFR_MEM8(0x0D03)
#define CTE_PADSCX2  _SFR_MEM16(0x0D04)
#define CTE_PADSCX2L  _SFR_MEM8(0x0D04)
#define CTE_PADSCX2H  _SFR_MEM8(0x0D05)
#define CTE_PADSCX3  _SFR_MEM16(0x0D06)
#define CTE_PADSCX3L  _SFR_MEM8(0x0D06)
#define CTE_PADSCX3H  _SFR_MEM8(0x0D07)
#define CTE_PADSCX4  _SFR_MEM16(0x0D08)
#define CTE_PADSCX4L  _SFR_MEM8(0x0D08)
#define CTE_PADSCX4H  _SFR_MEM8(0x0D09)
#define CTE_PADSCX5  _SFR_MEM16(0x0D0A)
#define CTE_PADSCX5L  _SFR_MEM8(0x0D0A)
#define CTE_PADSCX5H  _SFR_MEM8(0x0D0B)
#define CTE_PADSCX6  _SFR_MEM16(0x0D0C)
#define CTE_PADSCX6L  _SFR_MEM8(0x0D0C)
#define CTE_PADSCX6H  _SFR_MEM8(0x0D0D)
#define CTE_PADSCX7  _SFR_MEM16(0x0D0E)
#define CTE_PADSCX7L  _SFR_MEM8(0x0D0E)
#define CTE_PADSCX7H  _SFR_MEM8(0x0D0F)
#define CTE_PADSCX8  _SFR_MEM16(0x0D10)
#define CTE_PADSCX8L  _SFR_MEM8(0x0D10)
#define CTE_PADSCX8H  _SFR_MEM8(0x0D11)
#define CTE_PADSCX9  _SFR_MEM16(0x0D12)
#define CTE_PADSCX9L  _SFR_MEM8(0x0D12)
#define CTE_PADSCX9H  _SFR_MEM8(0x0D13)
#define CTE_PADSCX10  _SFR_MEM16(0x0D14)
#define CTE_PADSCX10L  _SFR_MEM8(0x0D14)
#define CTE_PADSCX10H  _SFR_MEM8(0x0D15)
#define CTE_PADSCX11  _SFR_MEM16(0x0D16)
#define CTE_PADSCX11L  _SFR_MEM8(0x0D16)
#define CTE_PADSCX11H  _SFR_MEM8(0x0D17)
#define CTE_PADSCX12  _SFR_MEM16(0x0D18)
#define CTE_PADSCX12L  _SFR_MEM8(0x0D18)
#define CTE_PADSCX12H  _SFR_MEM8(0x0D19)
#define CTE_PADSCX13  _SFR_MEM16(0x0D1A)
#define CTE_PADSCX13L  _SFR_MEM8(0x0D1A)
#define CTE_PADSCX13H  _SFR_MEM8(0x0D1B)
#define CTE_PADSCX14  _SFR_MEM16(0x0D1C)
#define CTE_PADSCX14L  _SFR_MEM8(0x0D1C)
#define CTE_PADSCX14H  _SFR_MEM8(0x0D1D)
#define CTE_PADSCX15  _SFR_MEM16(0x0D1E)
#define CTE_PADSCX15L  _SFR_MEM8(0x0D1E)
#define CTE_PADSCX15H  _SFR_MEM8(0x0D1F)
#define CTE_PADSCX16  _SFR_MEM16(0x0D20)
#define CTE_PADSCX16L  _SFR_MEM8(0x0D20)
#define CTE_PADSCX16H  _SFR_MEM8(0x0D21)
#define CTE_PADSCX17  _SFR_MEM16(0x0D22)
#define CTE_PADSCX17L  _SFR_MEM8(0x0D22)
#define CTE_PADSCX17H  _SFR_MEM8(0x0D23)
#define CTE_PADSCX18  _SFR_MEM16(0x0D24)
#define CTE_PADSCX18L  _SFR_MEM8(0x0D24)
#define CTE_PADSCX18H  _SFR_MEM8(0x0D25)
#define CTE_PADSCX19  _SFR_MEM16(0x0D26)
#define CTE_PADSCX19L  _SFR_MEM8(0x0D26)
#define CTE_PADSCX19H  _SFR_MEM8(0x0D27)
#define CTE_PADSCX20  _SFR_MEM16(0x0D28)
#define CTE_PADSCX20L  _SFR_MEM8(0x0D28)
#define CTE_PADSCX20H  _SFR_MEM8(0x0D29)
#define CTE_PADSCX21  _SFR_MEM16(0x0D2A)
#define CTE_PADSCX21L  _SFR_MEM8(0x0D2A)
#define CTE_PADSCX21H  _SFR_MEM8(0x0D2B)
#define CTE_PADSCX22  _SFR_MEM16(0x0D2C)
#define CTE_PADSCX22L  _SFR_MEM8(0x0D2C)
#define CTE_PADSCX22H  _SFR_MEM8(0x0D2D)
#define CTE_PADSCX23  _SFR_MEM16(0x0D2E)
#define CTE_PADSCX23L  _SFR_MEM8(0x0D2E)
#define CTE_PADSCX23H  _SFR_MEM8(0x0D2F)
#define CTE_PADSCX24  _SFR_MEM16(0x0D30)
#define CTE_PADSCX24L  _SFR_MEM8(0x0D30)
#define CTE_PADSCX24H  _SFR_MEM8(0x0D31)
#define CTE_PADSCX25  _SFR_MEM16(0x0D32)
#define CTE_PADSCX25L  _SFR_MEM8(0x0D32)
#define CTE_PADSCX25H  _SFR_MEM8(0x0D33)
#define CTE_PADSCX26  _SFR_MEM16(0x0D34)
#define CTE_PADSCX26L  _SFR_MEM8(0x0D34)
#define CTE_PADSCX26H  _SFR_MEM8(0x0D35)
#define CTE_PADSCX27  _SFR_MEM16(0x0D36)
#define CTE_PADSCX27L  _SFR_MEM8(0x0D36)
#define CTE_PADSCX27H  _SFR_MEM8(0x0D37)
#define CTE_PADSCX28  _SFR_MEM16(0x0D38)
#define CTE_PADSCX28L  _SFR_MEM8(0x0D38)
#define CTE_PADSCX28H  _SFR_MEM8(0x0D39)
#define CTE_PADSCX29  _SFR_MEM16(0x0D3A)
#define CTE_PADSCX29L  _SFR_MEM8(0x0D3A)
#define CTE_PADSCX29H  _SFR_MEM8(0x0D3B)
#define CTE_PADSCX30  _SFR_MEM16(0x0D3C)
#define CTE_PADSCX30L  _SFR_MEM8(0x0D3C)
#define CTE_PADSCX30H  _SFR_MEM8(0x0D3D)
#define CTE_PADSCX31  _SFR_MEM16(0x0D3E)
#define CTE_PADSCX31L  _SFR_MEM8(0x0D3E)
#define CTE_PADSCX31H  _SFR_MEM8(0x0D3F)
#define CTE_PADSCX32  _SFR_MEM16(0x0D40)
#define CTE_PADSCX32L  _SFR_MEM8(0x0D40)
#define CTE_PADSCX32H  _SFR_MEM8(0x0D41)
#define CTE_PADSCX33  _SFR_MEM16(0x0D42)
#define CTE_PADSCX33L  _SFR_MEM8(0x0D42)
#define CTE_PADSCX33H  _SFR_MEM8(0x0D43)
#define CTE_PADSCX34  _SFR_MEM16(0x0D44)
#define CTE_PADSCX34L  _SFR_MEM8(0x0D44)
#define CTE_PADSCX34H  _SFR_MEM8(0x0D45)
#define CTE_PADSCX35  _SFR_MEM16(0x0D46)
#define CTE_PADSCX35L  _SFR_MEM8(0x0D46)
#define CTE_PADSCX35H  _SFR_MEM8(0x0D47)
#define CTE_PADSCX36  _SFR_MEM16(0x0D48)
#define CTE_PADSCX36L  _SFR_MEM8(0x0D48)
#define CTE_PADSCX36H  _SFR_MEM8(0x0D49)
#define CTE_PADSCX37  _SFR_MEM16(0x0D4A)
#define CTE_PADSCX37L  _SFR_MEM8(0x0D4A)
#define CTE_PADSCX37H  _SFR_MEM8(0x0D4B)
#define CTE_PADSCX38  _SFR_MEM16(0x0D4C)
#define CTE_PADSCX38L  _SFR_MEM8(0x0D4C)
#define CTE_PADSCX38H  _SFR_MEM8(0x0D4D)
#define CTE_PADSCX39  _SFR_MEM16(0x0D4E)
#define CTE_PADSCX39L  _SFR_MEM8(0x0D4E)
#define CTE_PADSCX39H  _SFR_MEM8(0x0D4F)
#define CTE_PADSCX40  _SFR_MEM16(0x0D50)
#define CTE_PADSCX40L  _SFR_MEM8(0x0D50)
#define CTE_PADSCX40H  _SFR_MEM8(0x0D51)
#define CTE_PADSCX41  _SFR_MEM16(0x0D52)
#define CTE_PADSCX41L  _SFR_MEM8(0x0D52)
#define CTE_PADSCX41H  _SFR_MEM8(0x0D53)
#define CTE_PADSCX42  _SFR_MEM16(0x0D54)
#define CTE_PADSCX42L  _SFR_MEM8(0x0D54)
#define CTE_PADSCX42H  _SFR_MEM8(0x0D55)
#define CTE_PADSCX43  _SFR_MEM16(0x0D56)
#define CTE_PADSCX43L  _SFR_MEM8(0x0D56)
#define CTE_PADSCX43H  _SFR_MEM8(0x0D57)
#define CTE_PADSCX44  _SFR_MEM16(0x0D58)
#define CTE_PADSCX44L  _SFR_MEM8(0x0D58)
#define CTE_PADSCX44H  _SFR_MEM8(0x0D59)
#define CTE_PADSCX45  _SFR_MEM16(0x0D5A)
#define CTE_PADSCX45L  _SFR_MEM8(0x0D5A)
#define CTE_PADSCX45H  _SFR_MEM8(0x0D5B)
#define CTE_PADSCX46  _SFR_MEM16(0x0D5C)
#define CTE_PADSCX46L  _SFR_MEM8(0x0D5C)
#define CTE_PADSCX46H  _SFR_MEM8(0x0D5D)
#define CTE_PADSCX47  _SFR_MEM16(0x0D5E)
#define CTE_PADSCX47L  _SFR_MEM8(0x0D5E)
#define CTE_PADSCX47H  _SFR_MEM8(0x0D5F)
#define CTE_PADSCX48  _SFR_MEM16(0x0D60)
#define CTE_PADSCX48L  _SFR_MEM8(0x0D60)
#define CTE_PADSCX48H  _SFR_MEM8(0x0D61)
#define CTE_PADSCX49  _SFR_MEM16(0x0D62)
#define CTE_PADSCX49L  _SFR_MEM8(0x0D62)
#define CTE_PADSCX49H  _SFR_MEM8(0x0D63)
#define CTE_PADSCX50  _SFR_MEM16(0x0D64)
#define CTE_PADSCX50L  _SFR_MEM8(0x0D64)
#define CTE_PADSCX50H  _SFR_MEM8(0x0D65)
#define CTE_PADSCX51  _SFR_MEM16(0x0D66)
#define CTE_PADSCX51L  _SFR_MEM8(0x0D66)
#define CTE_PADSCX51H  _SFR_MEM8(0x0D67)
#define CTE_PADSCX52  _SFR_MEM16(0x0D68)
#define CTE_PADSCX52L  _SFR_MEM8(0x0D68)
#define CTE_PADSCX52H  _SFR_MEM8(0x0D69)
#define CTE_PADSCX53  _SFR_MEM16(0x0D6A)
#define CTE_PADSCX53L  _SFR_MEM8(0x0D6A)
#define CTE_PADSCX53H  _SFR_MEM8(0x0D6B)
#define CTE_PADSCX54  _SFR_MEM16(0x0D6C)
#define CTE_PADSCX54L  _SFR_MEM8(0x0D6C)
#define CTE_PADSCX54H  _SFR_MEM8(0x0D6D)
#define CTE_PADSCX55  _SFR_MEM16(0x0D6E)
#define CTE_PADSCX55L  _SFR_MEM8(0x0D6E)
#define CTE_PADSCX55H  _SFR_MEM8(0x0D6F)
#define CTE_PADSCX56  _SFR_MEM16(0x0D70)
#define CTE_PADSCX56L  _SFR_MEM8(0x0D70)
#define CTE_PADSCX56H  _SFR_MEM8(0x0D71)
#define CTE_PADSCX57  _SFR_MEM16(0x0D72)
#define CTE_PADSCX57L  _SFR_MEM8(0x0D72)
#define CTE_PADSCX57H  _SFR_MEM8(0x0D73)
#define CTE_PADSCX58  _SFR_MEM16(0x0D74)
#define CTE_PADSCX58L  _SFR_MEM8(0x0D74)
#define CTE_PADSCX58H  _SFR_MEM8(0x0D75)
#define CTE_PADSCX59  _SFR_MEM16(0x0D76)
#define CTE_PADSCX59L  _SFR_MEM8(0x0D76)
#define CTE_PADSCX59H  _SFR_MEM8(0x0D77)
#define CTE_PADSCY0  _SFR_MEM16(0x0D80)
#define CTE_PADSCY0L  _SFR_MEM8(0x0D80)
#define CTE_PADSCY0H  _SFR_MEM8(0x0D81)
#define CTE_PADSCY1  _SFR_MEM16(0x0D82)
#define CTE_PADSCY1L  _SFR_MEM8(0x0D82)
#define CTE_PADSCY1H  _SFR_MEM8(0x0D83)
#define CTE_PADSCY2  _SFR_MEM16(0x0D84)
#define CTE_PADSCY2L  _SFR_MEM8(0x0D84)
#define CTE_PADSCY2H  _SFR_MEM8(0x0D85)
#define CTE_PADSCY3  _SFR_MEM16(0x0D86)
#define CTE_PADSCY3L  _SFR_MEM8(0x0D86)
#define CTE_PADSCY3H  _SFR_MEM8(0x0D87)
#define CTE_PADSCY4  _SFR_MEM16(0x0D88)
#define CTE_PADSCY4L  _SFR_MEM8(0x0D88)
#define CTE_PADSCY4H  _SFR_MEM8(0x0D89)
