gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTEMS.MSMINB  bit masks and bit positions */
/* CTEMS_MSMIN  is already defined. */

/* CTEMS.MSSHIFTRA  bit masks and bit positions */
#define CTEMS_MSSHIFTR_gm  0xFFFF  /* MS Shift Register group mask. */
#define CTEMS_MSSHIFTR_gp  0  /* MS Shift Register group position. */
#define CTEMS_MSSHIFTR0_bm  (1<<0)  /* MS Shift Register bit 0 mask. */
#define CTEMS_MSSHIFTR0_bp  0  /* MS Shift Register bit 0 position. */
#define CTEMS_MSSHIFTR1_bm  (1<<1)  /* MS Shift Register bit 1 mask. */
#define CTEMS_MSSHIFTR1_bp  1  /* MS Shift Register bit 1 position. */
#define CTEMS_MSSHIFTR2_bm  (1<<2)  /* MS Shift Register bit 2 mask. */
#define CTEMS_MSSHIFTR2_bp  2  /* MS Shift Register bit 2 position. */
#define CTEMS_MSSHIFTR3_bm  (1<<3)  /* MS Shift Register bit 3 mask. */
#define CTEMS_MSSHIFTR3_bp  3  /* MS Shift Register bit 3 position. */
#define CTEMS_MSSHIFTR4_bm  (1<<4)  /* MS Shift Register bit 4 mask. */
#define CTEMS_MSSHIFTR4_bp  4  /* MS Shift Register bit 4 position. */
#define CTEMS_MSSHIFTR5_bm  (1<<5)  /* MS Shift Register bit 5 mask. */
#define CTEMS_MSSHIFTR5_bp  5  /* MS Shift Register bit 5 position. */
#define CTEMS_MSSHIFTR6_bm  (1<<6)  /* MS Shift Register bit 6 mask. */
#define CTEMS_MSSHIFTR6_bp  6  /* MS Shift Register bit 6 position. */
#define CTEMS_MSSHIFTR7_bm  (1<<7)  /* MS Shift Register bit 7 mask. */
#define CTEMS_MSSHIFTR7_bp  7  /* MS Shift Register bit 7 position. */
#define CTEMS_MSSHIFTR8_bm  (1<<8)  /* MS Shift Register bit 8 mask. */
#define CTEMS_MSSHIFTR8_bp  8  /* MS Shift Register bit 8 position. */
#define CTEMS_MSSHIFTR9_bm  (1<<9)  /* MS Shift Register bit 9 mask. */
#define CTEMS_MSSHIFTR9_bp  9  /* MS Shift Register bit 9 position. */
#define CTEMS_MSSHIFTR10_bm  (1<<10)  /* MS Shift Register bit 10 mask. */
#define CTEMS_MSSHIFTR10_bp  10  /* MS Shift Register bit 10 position. */
#define CTEMS_MSSHIFTR11_bm  (1<<11)  /* MS Shift Register bit 11 mask. */
#define CTEMS_MSSHIFTR11_bp  11  /* MS Shift Register bit 11 position. */
#define CTEMS_MSSHIFTR12_bm  (1<<12)  /* MS Shift Register bit 12 mask. */
#define CTEMS_MSSHIFTR12_bp  12  /* MS Shift Register bit 12 position. */
#define CTEMS_MSSHIFTR13_bm  (1<<13)  /* MS Shift Register bit 13 mask. */
#define CTEMS_MSSHIFTR13_bp  13  /* MS Shift Register bit 13 position. */
#define CTEMS_MSSHIFTR14_bm  (1<<14)  /* MS Shift Register bit 14 mask. */
#define CTEMS_MSSHIFTR14_bp  14  /* MS Shift Register bit 14 position. */
#define CTEMS_MSSHIFTR15_bm  (1<<15)  /* MS Shift Register bit 15 mask. */
#define CTEMS_MSSHIFTR15_bp  15  /* MS Shift Register bit 15 position. */

/* CTEMS.MSSHIFTRB  bit masks and bit positions */
/* CTEMS_MSSHIFTR  is already defined. */

/* CTEMS.MSACCSR  bit masks and bit positions */
#define CTEMS_MSCNTOVFLA_bm  0x01  /* MS Counter Overflow A bit mask. */
#define CTEMS_MSCNTOVFLA_bp  0  /* MS Counter Overflow A bit position. */
#define CTEMS_MSCNTOVFLB_bm  0x02  /* MS Counter Overflow B bit mask. */
#define CTEMS_MSCNTOVFLB_bp  1  /* MS Counter Overflow B bit position. */
#define CTEMS_MSACCOVFLA_bm  0x04  /* MS Accumulator Overflow A bit mask. */
#define CTEMS_MSACCOVFLA_bp  2  /* MS Accumulator Overflow A bit position. */
#define CTEMS_MSACCOVFLB_bm  0x08  /* MS Accumulator Overflow B bit mask. */
#define CTEMS_MSACCOVFLB_bp  3  /* MS Accumulator Overflow B bit position. */

/* CTEMS.MSCRCCLR  bit masks and bit positions */
#define CTEMS_MSACCMULA_bm  0x01  /* MS Accumulate Multiplier Result A bit mask. */
#define CTEMS_MSACCMULA_bp  0  /* MS Accumulate Multiplier Result A bit position. */
#define CTEMS_MSACCMULB_bm  0x02  /* MS Accumulate Multiplier Result B bit mask. */
#define CTEMS_MSACCMULB_bp  1  /* MS Accumulate Multiplier Result B bit position. */
#define CTEMS_MSSUBMULA_bm  0x04  /* MS Subtract Multiplier Result A bit mask. */
#define CTEMS_MSSUBMULA_bp  2  /* MS Subtract Multiplier Result A bit position. */
#define CTEMS_MSSUBMULB_bm  0x08  /* MS Subtract Multiplier Result B bit mask. */
#define CTEMS_MSSUBMULB_bp  3  /* MS Subtract Multiplier Result B bit position. */
#define CTEMS_MSSMODEA_bm  0x10  /* MS Signed Mode A bit mask. */
#define CTEMS_MSSMODEA_bp  4  /* MS Signed Mode A bit position. */
#define CTEMS_MSSMODEB_bm  0x20  /* MS Signed Mode B bit mask. */
#define CTEMS_MSSMODEB_bp  5  /* MS Signed Mode B bit position. */
#define CTEMS_MSDMAPSA_bm  0x40  /* Double map select for which memory to connect bit mask. */
#define CTEMS_MSDMAPSA_bp  6  /* Double map select for which memory to connect bit position. */
#define CTEMS_MSDMAPSB_bm  0x80  /* Double map select for which memory to connect bit mask. */
#define CTEMS_MSDMAPSB_bp  7  /* Double map select for which memory to connect bit position. */
#define CTEMS_MSACCMMA_bm  0x100  /* MS Accumulate and Max/Min A bit mask. */
#define CTEMS_MSACCMMA_bp  8  /* MS Accumulate and Max/Min A bit position. */
#define CTEMS_MSACCMMB_bm  0x200  /* MS Accumulate and Max/Min B bit mask. */
#define CTEMS_MSACCMMB_bp  9  /* MS Accumulate and Max/Min B bit position. */

/* CTEMS.MSCRCSET  bit masks and bit positions */
/* CTEMS_MSACCMULA  is already defined. */
/* CTEMS_MSACCMULB  is already defined. */
/* CTEMS_MSSUBMULA  is already defined. */
/* CTEMS_MSSUBMULB  is already defined. */
/* CTEMS_MSSMODEA  is already defined. */
/* CTEMS_MSSMODEB  is already defined. */
/* CTEMS_MSDMAPSA  is already defined. */
/* CTEMS_MSDMAPSB  is already defined. */
/* CTEMS_MSACCMMA  is already defined. */
/* CTEMS_MSACCMMB  is already defined. */

/* CTEMS.MSCRA  bit masks and bit positions */
#define CTEMS_MSBE_bm  0x01  /* MS Break Enable bit mask. */
#define CTEMS_MSBE_bp  0  /* MS Break Enable bit position. */
#define CTEMS_MSIL_gm  0x06  /* MS Interrupt Level group mask. */
#define CTEMS_MSIL_gp  1  /* MS Interrupt Level group position. */
#define CTEMS_MSIL0_bm  (1<<1)  /* MS Interrupt Level bit 0 mask. */
#define CTEMS_MSIL0_bp  1  /* MS Interrupt Level bit 0 position. */
#define CTEMS_MSIL1_bm  (1<<2)  /* MS Interrupt Level bit 1 mask. */
#define CTEMS_MSIL1_bp  2  /* MS Interrupt Level bit 1 position. */
#define CTEMS_MSSEXT_bm  0x10  /* MS Sign Extend LD[M].B bit mask. */
#define CTEMS_MSSEXT_bp  4  /* MS Sign Extend LD[M].B bit position. */
#define CTEMS_MSDDZC_bm  0x20  /* MS Disable Division by Zero Check bit mask. */
#define CTEMS_MSDDZC_bp  5  /* MS Disable Division by Zero Check bit position. */
#define CTEMS_MSSAT6S_bm  0x40  /* MS Signed SAT6 bit mask. */
#define CTEMS_MSSAT6S_bp  6  /* MS Signed SAT6 bit position. */

/* CTEMS.MSCRB  bit masks and bit positions */
#define CTEMS_MSTCCS_gm  0x0F  /* MS Timer/Counter Clock Select group mask. */
#define CTEMS_MSTCCS_gp  0  /* MS Timer/Counter Clock Select group position. */
#define CTEMS_MSTCCS0_bm  (1<<0)  /* MS Timer/Counter Clock Select bit 0 mask. */
#define CTEMS_MSTCCS0_bp  0  /* MS Timer/Counter Clock Select bit 0 position. */
#define CTEMS_MSTCCS1_bm  (1<<1)  /* MS Timer/Counter Clock Select bit 1 mask. */
#define CTEMS_MSTCCS1_bp  1  /* MS Timer/Counter Clock Select bit 1 position. */
#define CTEMS_MSTCCS2_bm  (1<<2)  /* MS Timer/Counter Clock Select bit 2 mask. */
#define CTEMS_MSTCCS2_bp  2  /* MS Timer/Counter Clock Select bit 2 position. */
#define CTEMS_MSTCCS3_bm  (1<<3)  /* MS Timer/Counter Clock Select bit 3 mask. */
#define CTEMS_MSTCCS3_bp  3  /* MS Timer/Counter Clock Select bit 3 position. */
#define CTEMS_MSTCRE_bm  0x10  /* MS Timer/Counter Reload Enable bit mask. */
#define CTEMS_MSTCRE_bp  4  /* MS Timer/Counter Reload Enable bit position. */

/* CTEMS.MSSRACLR  bit masks and bit positions */
#define CTEMS_MSTCUNF_bm  0x01  /* MS Timer/Counter Underflow Flag bit mask. */
#define CTEMS_MSTCUNF_bp  0  /* MS Timer/Counter Underflow Flag bit position. */
#define CTEMS_MSHSF_gm  0x1E  /* MS Handshake Flags group mask. */
#define CTEMS_MSHSF_gp  1  /* MS Handshake Flags group position. */
#define CTEMS_MSHSF0_bm  (1<<1)  /* MS Handshake Flags bit 0 mask. */
#define CTEMS_MSHSF0_bp  1  /* MS Handshake Flags bit 0 position. */
#define CTEMS_MSHSF1_bm  (1<<2)  /* MS Handshake Flags bit 1 mask. */
#define CTEMS_MSHSF1_bp  2  /* MS Handshake Flags bit 1 position. */
#define CTEMS_MSHSF2_bm  (1<<3)  /* MS Handshake Flags bit 2 mask. */
#define CTEMS_MSHSF2_bp  3  /* MS Handshake Flags bit 2 position. */
#define CTEMS_MSHSF3_bm  (1<<4)  /* MS Handshake Flags bit 3 mask. */
#define CTEMS_MSHSF3_bp  4  /* MS Handshake Flags bit 3 position. */
#define CTEMS_GCAFCCCNZ_bm  0x20  /* GCAF Computation Complete Counter Not Zero flag bit mask. */
#define CTEMS_GCAFCCCNZ_bp  5  /* GCAF Computation Complete Counter Not Zero flag bit position. */
#define CTEMS_GCAFCCCZ_bm  0x40  /* GCAF Computation Complete Counter Zero flag bit mask. */
#define CTEMS_GCAFCCCZ_bp  6  /* GCAF Computation Complete Counter Zero flag bit position. */
#define CTEMS_MSADCSYNC_bm  0x80  /* MS ADC Synchronization bit bit mask. */
#define CTEMS_MSADCSYNC_bp  7  /* MS ADC Synchronization bit bit position. */

/* CTEMS.MSSRASET  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
/* CTEMS_MSHSF  is already defined. */
/* CTEMS_GCAFCCCNZ  is already defined. */
/* CTEMS_GCAFCCCZ  is already defined. */
/* CTEMS_MSADCSYNC  is already defined. */

/* CTEMS.MSSRB  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
#define CTEMS_PIFXPIN1_bm  0x02  /* Mapped PIFXPIN bit 1 from PIFXPIN bit mask. */
#define CTEMS_PIFXPIN1_bp  1  /* Mapped PIFXPIN bit 1 from PIFXPIN bit position. */
#define CTEMS_PIFXPIN2_bm  0x04  /* Mapped PIFXPIN bit 2 from PIFXPIN bit mask. */
#define CTEMS_PIFXPIN2_bp  2  /* Mapped PIFXPIN bit 2 from PIFXPIN bit position. */
#define CTEMS_PIFXPIN3_bm  0x08  /* Mapped PIFXPIN bit 3 from PIFXPIN bit mask. */
#define CTEMS_PIFXPIN3_bp  3  /* Mapped PIFXPIN bit 3 from PIFXPIN bit position. */
#define CTEMS_PIFXPIN4_bm  0x10  /* Mapped PIFXPIN bit 4 from PIFXPIN bit mask. */
#define CTEMS_PIFXPIN4_bp  4  /* Mapped PIFXPIN bit 4 from PIFXPIN bit position. */
#define CTEMS_PIFXPIN5_bm  0x20  /* Mapped PIFXPIN bit 5 from PIFXPIN bit mask. */
#define CTEMS_PIFXPIN5_bp  5  /* Mapped PIFXPIN bit 5 from PIFXPIN bit position. */
#define CTEMS_PIFPC2_bm  0x40  /* Mapped PC2 from PORTC bit mask. */
#define CTEMS_PIFPC2_bp  6  /* Mapped PC2 from PORTC bit position. */
#define CTEMS_PIFPC6_bm  0x80  /* Mapped PC6 from PORTC bit mask. */
#define CTEMS_PIFPC6_bp  7  /* Mapped PC6 from PORTC bit position. */

/* CTEMS.MSSRC  bit masks and bit positions */
/* CTEMS_MSTCUNF  is already defined. */
#define CTEMS_TIMADONE_bm  0x02  /* Timer A Done bit mask. */
#define CTEMS_TIMADONE_bp  1  /* Timer A Done bit position. */
#define CTEMS_TIMBDONE_bm  0x04  /* Timer B Done bit mask. */
#define CTEMS_TIMBDONE_bp  2  /* Timer B Done bit position. */
#define CTEMS_TIMCDONE_bm  0x08  /* Timer C Done bit mask. */
#define CTEMS_TIMCDONE_bp  3  /* Timer C Done bit position. */
#define CTEMS_INTMOEDONE_bm  0x10  /* Integrator Master Output Enable Done bit mask. */
#define CTEMS_INTMOEDONE_bp  4  /* Integrator Master Output Enable Done bit position. */
#define CTEMS_INTRSTDONE_bm  0x20  /* Integrator Reset Done bit mask. */
#define CTEMS_INTRSTDONE_bp  5  /* Integrator Reset Done bit position. */
#define CTEMS_SHADCDONE_bm  0x40  /* S/H and ADC Trigger Done. Writing a '1' to SHADCDONE bit will trigger SHADCTRIG. bit mask. */
#define CTEMS_SHADCDONE_bp  6  /* S/H and ADC Trigger Done. Writing a '1' to SHADCDONE bit will trigger SHADCTRIG. bit position. */
#define CTEMS_ALLDONE_bm  0x80  /* All Timers Done. Writing a '1' to ALLDONE   bit will trigger INTXRDY bit mask. */
#define CTEMS_ALLDONE_bp  7  /* All Timers Done. Writing a '1' to ALLDONE   bit will trigger INTXRDY bit position. */

