gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.INTCRBSET  bit masks and bit positions */
/* CTE_INTSIGN  is already defined. */
/* CTE_TIMA  is already defined. */
/* CTE_TIMB  is already defined. */
/* CTE_TIMC  is already defined. */
/* CTE_INTMOE  is already defined. */
/* CTE_INTDBULKPWR  is already defined. */
/* CTE_INTID  is already defined. */
/* CTE_INTAUTOCAL  is already defined. */
/* CTE_INTIBUFD  is already defined. */
/* CTE_INTIAMPOD  is already defined. */
/* CTE_INTIBULKPWR  is already defined. */
/* CTE_INTDIBUFD  is already defined. */

/* CTE.INTCRECLR  bit masks and bit positions */
#define CTE_SCMOE_bm  0x01  /* Selfcap Master Output Enable bit mask. */
#define CTE_SCMOE_bp  0  /* Selfcap Master Output Enable bit position. */
#define CTE_SCCFGSEL_bm  0x02  /* Selfcap Configuration Select bit mask. */
#define CTE_SCCFGSEL_bp  1  /* Selfcap Configuration Select bit position. */
#define CTE_INTBYPASSX_bm  0x04  /* Integrator Bypass X bit mask. */
#define CTE_INTBYPASSX_bp  2  /* Integrator Bypass X bit position. */
#define CTE_INTBYPASSY_bm  0x08  /* Integrator Bypass Y bit mask. */
#define CTE_INTBYPASSY_bp  3  /* Integrator Bypass Y bit position. */
#define CTE_INTYONXEN_bm  0x10  /* Integrator Y-on-X Enable bit mask. */
#define CTE_INTYONXEN_bp  4  /* Integrator Y-on-X Enable bit position. */
#define CTE_INTSCCSNEN_bm  0x20  /* Integrator selfcap current source nmos enable bit mask. */
#define CTE_INTSCCSNEN_bp  5  /* Integrator selfcap current source nmos enable bit position. */
#define CTE_INTSCCSPEN_bm  0x40  /* Integrator selfcap current source pmos enable bit mask. */
#define CTE_INTSCCSPEN_bp  6  /* Integrator selfcap current source pmos enable bit position. */
#define CTE_SCCFGC_bm  0x80  /* Selfcap Configuration C Select bit mask. */
#define CTE_SCCFGC_bp  7  /* Selfcap Configuration C Select bit position. */
#define CTE_INTCINTPU_bm  0x100  /* Integrator Cint pullup bit mask. */
#define CTE_INTCINTPU_bp  8  /* Integrator Cint pullup bit position. */
#define CTE_INTCINTPD_bm  0x200  /* Integrator Cint pulldown bit mask. */
#define CTE_INTCINTPD_bp  9  /* Integrator Cint pulldown bit position. */
#define CTE_INTPROXPDEN_bm  0x400  /* Integrator XY pad prox pulldown enable bit mask. */
#define CTE_INTPROXPDEN_bp  10  /* Integrator XY pad prox pulldown enable bit position. */
#define CTE_INTXYRESEN_bm  0x1000  /* Enables dummy input conn to high resistive input bit mask. */
#define CTE_INTXYRESEN_bp  12  /* Enables dummy input conn to high resistive input bit position. */
#define CTE_INTYONXPDEN_bm  0x2000  /* Enables pulldown for int YonX bit mask. */
#define CTE_INTYONXPDEN_bp  13  /* Enables pulldown for int YonX bit position. */
#define CTE_INTPROXREFCON_bm  0x4000  /* Integrator Proximity Reference Connect bit mask. */
#define CTE_INTPROXREFCON_bp  14  /* Integrator Proximity Reference Connect bit position. */
#define CTE_INTPROXREFEN_bm  0x8000  /* Integrator Proximity Reference Enable bit mask. */
#define CTE_INTPROXREFEN_bp  15  /* Integrator Proximity Reference Enable bit position. */

/* CTE.INTCRESET  bit masks and bit positions */
/* CTE_SCMOE  is already defined. */
/* CTE_SCCFGSEL  is already defined. */
/* CTE_INTBYPASSX  is already defined. */
/* CTE_INTBYPASSY  is already defined. */
/* CTE_INTYONXEN  is already defined. */
/* CTE_INTSCCSNEN  is already defined. */
/* CTE_INTSCCSPEN  is already defined. */
/* CTE_SCCFGC  is already defined. */
/* CTE_INTCINTPU  is already defined. */
/* CTE_INTCINTPD  is already defined. */
/* CTE_INTPROXPDEN  is already defined. */
/* CTE_INTXYRESEN  is already defined. */
/* CTE_INTYONXPDEN  is already defined. */
/* CTE_INTPROXREFCON  is already defined. */
/* CTE_INTPROXREFEN  is already defined. */

/* CTE.INTXCHR  bit masks and bit positions */
#define CTE_INTXCH_gm  0x3F  /* Integrator X-channel group mask. */
#define CTE_INTXCH_gp  0  /* Integrator X-channel group position. */
#define CTE_INTXCH0_bm  (1<<0)  /* Integrator X-channel bit 0 mask. */
#define CTE_INTXCH0_bp  0  /* Integrator X-channel bit 0 position. */
#define CTE_INTXCH1_bm  (1<<1)  /* Integrator X-channel bit 1 mask. */
#define CTE_INTXCH1_bp  1  /* Integrator X-channel bit 1 position. */
#define CTE_INTXCH2_bm  (1<<2)  /* Integrator X-channel bit 2 mask. */
#define CTE_INTXCH2_bp  2  /* Integrator X-channel bit 2 position. */
#define CTE_INTXCH3_bm  (1<<3)  /* Integrator X-channel bit 3 mask. */
#define CTE_INTXCH3_bp  3  /* Integrator X-channel bit 3 position. */
#define CTE_INTXCH4_bm  (1<<4)  /* Integrator X-channel bit 4 mask. */
#define CTE_INTXCH4_bp  4  /* Integrator X-channel bit 4 position. */
#define CTE_INTXCH5_bm  (1<<5)  /* Integrator X-channel bit 5 mask. */
#define CTE_INTXCH5_bp  5  /* Integrator X-channel bit 5 position. */

/* CTE.INTOENA  bit masks and bit positions */
#define CTE_INTOEN_gm  0xFFFF  /* Integrator Output Enable group mask. */
#define CTE_INTOEN_gp  0  /* Integrator Output Enable group position. */
#define CTE_INTOEN0_bm  (1<<0)  /* Integrator Output Enable bit 0 mask. */
#define CTE_INTOEN0_bp  0  /* Integrator Output Enable bit 0 position. */
#define CTE_INTOEN1_bm  (1<<1)  /* Integrator Output Enable bit 1 mask. */
#define CTE_INTOEN1_bp  1  /* Integrator Output Enable bit 1 position. */
#define CTE_INTOEN2_bm  (1<<2)  /* Integrator Output Enable bit 2 mask. */
#define CTE_INTOEN2_bp  2  /* Integrator Output Enable bit 2 position. */
#define CTE_INTOEN3_bm  (1<<3)  /* Integrator Output Enable bit 3 mask. */
#define CTE_INTOEN3_bp  3  /* Integrator Output Enable bit 3 position. */
#define CTE_INTOEN4_bm  (1<<4)  /* Integrator Output Enable bit 4 mask. */
#define CTE_INTOEN4_bp  4  /* Integrator Output Enable bit 4 position. */
#define CTE_INTOEN5_bm  (1<<5)  /* Integrator Output Enable bit 5 mask. */
#define CTE_INTOEN5_bp  5  /* Integrator Output Enable bit 5 position. */
#define CTE_INTOEN6_bm  (1<<6)  /* Integrator Output Enable bit 6 mask. */
#define CTE_INTOEN6_bp  6  /* Integrator Output Enable bit 6 position. */
#define CTE_INTOEN7_bm  (1<<7)  /* Integrator Output Enable bit 7 mask. */
#define CTE_INTOEN7_bp  7  /* Integrator Output Enable bit 7 position. */
#define CTE_INTOEN8_bm  (1<<8)  /* Integrator Output Enable bit 8 mask. */
#define CTE_INTOEN8_bp  8  /* Integrator Output Enable bit 8 position. */
#define CTE_INTOEN9_bm  (1<<9)  /* Integrator Output Enable bit 9 mask. */
#define CTE_INTOEN9_bp  9  /* Integrator Output Enable bit 9 position. */
#define CTE_INTOEN10_bm  (1<<10)  /* Integrator Output Enable bit 10 mask. */
#define CTE_INTOEN10_bp  10  /* Integrator Output Enable bit 10 position. */
#define CTE_INTOEN11_bm  (1<<11)  /* Integrator Output Enable bit 11 mask. */
#define CTE_INTOEN11_bp  11  /* Integrator Output Enable bit 11 position. */
#define CTE_INTOEN12_bm  (1<<12)  /* Integrator Output Enable bit 12 mask. */
#define CTE_INTOEN12_bp  12  /* Integrator Output Enable bit 12 position. */
#define CTE_INTOEN13_bm  (1<<13)  /* Integrator Output Enable bit 13 mask. */
#define CTE_INTOEN13_bp  13  /* Integrator Output Enable bit 13 position. */
#define CTE_INTOEN14_bm  (1<<14)  /* Integrator Output Enable bit 14 mask. */
#define CTE_INTOEN14_bp  14  /* Integrator Output Enable bit 14 position. */
#define CTE_INTOEN15_bm  (1<<15)  /* Integrator Output Enable bit 15 mask. */
#define CTE_INTOEN15_bp  15  /* Integrator Output Enable bit 15 position. */

/* CTE.INTOENB  bit masks and bit positions */
/* CTE_INTOEN  is already defined. */

