gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.INTDONE  bit masks and bit positions */
#define CTE_TIMADONE_bm  0x02  /* Timer A Done bit mask. */
#define CTE_TIMADONE_bp  1  /* Timer A Done bit position. */
#define CTE_TIMBDONE_bm  0x04  /* Timer B Done bit mask. */
#define CTE_TIMBDONE_bp  2  /* Timer B Done bit position. */
#define CTE_TIMCDONE_bm  0x08  /* Timer C Done bit mask. */
#define CTE_TIMCDONE_bp  3  /* Timer C Done bit position. */
#define CTE_INTMOEDONE_bm  0x10  /* Integrator Master Output Enable Done bit mask. */
#define CTE_INTMOEDONE_bp  4  /* Integrator Master Output Enable Done bit position. */
#define CTE_INTRSTDONE_bm  0x20  /* Integrator Reset Done bit mask. */
#define CTE_INTRSTDONE_bp  5  /* Integrator Reset Done bit position. */
#define CTE_SHADCDONE_bm  0x40  /* S/H and ADC Done bit mask. */
#define CTE_SHADCDONE_bp  6  /* S/H and ADC Done bit position. */
#define CTE_ALLDONE_bm  0x80  /* All Timers Done bit mask. */
#define CTE_ALLDONE_bp  7  /* All Timers Done bit position. */

/* CTE.INTTRIGA  bit masks and bit positions */
#define CTE_INTPORTTGL_bm  0x01  /* Port Toggle bit mask. */
#define CTE_INTPORTTGL_bp  0  /* Port Toggle bit position. */
#define CTE_TIMATRIG_bm  0x02  /* Timer A Trigger bit mask. */
#define CTE_TIMATRIG_bp  1  /* Timer A Trigger bit position. */
#define CTE_TIMBTRIG_bm  0x04  /* Timer B Trigger bit mask. */
#define CTE_TIMBTRIG_bp  2  /* Timer B Trigger bit position. */
#define CTE_TIMCTRIG_bm  0x08  /* Timer C Trigger bit mask. */
#define CTE_TIMCTRIG_bp  3  /* Timer C Trigger bit position. */
#define CTE_INTMOETRIG_bm  0x10  /* Integrator Master Output Enable Trigger bit mask. */
#define CTE_INTMOETRIG_bp  4  /* Integrator Master Output Enable Trigger bit position. */
#define CTE_INTRSTTRIG_bm  0x20  /* Integrator Reset Trigger bit mask. */
#define CTE_INTRSTTRIG_bp  5  /* Integrator Reset Trigger bit position. */
#define CTE_SHADCTRIG_A_bm  0x40  /* S/H and ADC Trigger A bit mask. */
#define CTE_SHADCTRIG_A_bp  6  /* S/H and ADC Trigger A bit position. */
#define CTE_INTXRDY_A_bm  0x80  /* X-line Ready A bit mask. */
#define CTE_INTXRDY_A_bp  7  /* X-line Ready A bit position. */
#define CTE_HVSEQXLTRIG_A_bm  0x100  /* HV xline hold off tigger A bit mask. */
#define CTE_HVSEQXLTRIG_A_bp  8  /* HV xline hold off tigger A bit position. */

/* CTE.INTTRIGB  bit masks and bit positions */
/* CTE_INTPORTTGL  is already defined. */
/* CTE_TIMATRIG  is already defined. */
/* CTE_TIMBTRIG  is already defined. */
/* CTE_TIMCTRIG  is already defined. */
/* CTE_INTMOETRIG  is already defined. */
/* CTE_INTRSTTRIG  is already defined. */
#define CTE_HVSEQXLTRIG_B_bm  0x40  /* HV xline hold off Trigger bit mask. */
#define CTE_HVSEQXLTRIG_B_bp  6  /* HV xline hold off Trigger bit position. */
#define CTE_SHADCTRIG_B_bm  0x100  /* S/H and ADC Trigger B bit mask. */
#define CTE_SHADCTRIG_B_bp  8  /* S/H and ADC Trigger B bit position. */
#define CTE_INTXRDY_B_bm  0x200  /* X-line Ready B bit mask. */
#define CTE_INTXRDY_B_bp  9  /* X-line Ready B bit position. */

/* CTE.INTCRFCLR  bit masks and bit positions */
#define CTE_SCHSREFNCON_bm  0x01  /* Selfcap High Strength Ref N Connect bit mask. */
#define CTE_SCHSREFNCON_bp  0  /* Selfcap High Strength Ref N Connect bit position. */
#define CTE_SCHSREFPCON_bm  0x02  /* Selfcap High Strength Ref P Connect bit mask. */
#define CTE_SCHSREFPCON_bp  1  /* Selfcap High Strength Ref P Connect bit position. */
#define CTE_SCDNEN_bm  0x04  /* Selfcap Diode N Connect bit mask. */
#define CTE_SCDNEN_bp  2  /* Selfcap Diode N Connect bit position. */
#define CTE_SCDPEN_bm  0x08  /* Selfcap Diode P Connect bit mask. */
#define CTE_SCDPEN_bp  3  /* Selfcap Diode P Connect bit position. */
#define CTE_SCDROEN_bm  0x10  /* Selfcap Diode Reference Output Enable bit mask. */
#define CTE_SCDROEN_bp  4  /* Selfcap Diode Reference Output Enable bit position. */
#define CTE_SCISO_bm  0x20  /* Selfcap Isolation bit mask. */
#define CTE_SCISO_bp  5  /* Selfcap Isolation bit position. */
#define CTE_INTVMSEL_bm  0x40  /* Integrator Voltage Modulation Select bit mask. */
#define CTE_INTVMSEL_bp  6  /* Integrator Voltage Modulation Select bit position. */
#define CTE_ADCRESDIS_bm  0x80  /* ADC Result Discard bit mask. */
#define CTE_ADCRESDIS_bp  7  /* ADC Result Discard bit position. */
#define CTE_INTCAPRST_bm  0x200  /* Integrator Cap Reset bit mask. */
#define CTE_INTCAPRST_bp  9  /* Integrator Cap Reset bit position. */
#define CTE_INTCAPREL_bm  0x400  /* Integrator Cap Release bit mask. */
#define CTE_INTCAPREL_bp  10  /* Integrator Cap Release bit position. */
#define CTE_XBIASMEN_bm  0x800  /* X-line Bias Master Enable bit mask. */
#define CTE_XBIASMEN_bp  11  /* X-line Bias Master Enable bit position. */
#define CTE_INTCCIA_bm  0x1000  /* Enable Charge Compensation after current amplifier bit mask. */
#define CTE_INTCCIA_bp  12  /* Enable Charge Compensation after current amplifier bit position. */
#define CTE_INTCCINT_bm  0x2000  /* Enable Charge Compensation after integrator bit mask. */
#define CTE_INTCCINT_bp  13  /* Enable Charge Compensation after integrator bit position. */

/* CTE.INTCRFSET  bit masks and bit positions */
/* CTE_SCHSREFNCON  is already defined. */
/* CTE_SCHSREFPCON  is already defined. */
/* CTE_SCDNEN  is already defined. */
/* CTE_SCDPEN  is already defined. */
/* CTE_SCDROEN  is already defined. */
/* CTE_SCISO  is already defined. */
/* CTE_INTVMSEL  is already defined. */
/* CTE_ADCRESDIS  is already defined. */
/* CTE_INTCAPRST  is already defined. */
/* CTE_INTCAPREL  is already defined. */
/* CTE_XBIASMEN  is already defined. */
/* CTE_INTCCIA  is already defined. */
/* CTE_INTCCINT  is already defined. */

/* CTE.GCAFSRA  bit masks and bit positions */
#define CTE_GCAFCCC_gm  0x7F  /* GCAF Computation Complete Counter group mask. */
#define CTE_GCAFCCC_gp  0  /* GCAF Computation Complete Counter group position. */
#define CTE_GCAFCCC0_bm  (1<<0)  /* GCAF Computation Complete Counter bit 0 mask. */
#define CTE_GCAFCCC0_bp  0  /* GCAF Computation Complete Counter bit 0 position. */
#define CTE_GCAFCCC1_bm  (1<<1)  /* GCAF Computation Complete Counter bit 1 mask. */
#define CTE_GCAFCCC1_bp  1  /* GCAF Computation Complete Counter bit 1 position. */
#define CTE_GCAFCCC2_bm  (1<<2)  /* GCAF Computation Complete Counter bit 2 mask. */
#define CTE_GCAFCCC2_bp  2  /* GCAF Computation Complete Counter bit 2 position. */
#define CTE_GCAFCCC3_bm  (1<<3)  /* GCAF Computation Complete Counter bit 3 mask. */
#define CTE_GCAFCCC3_bp  3  /* GCAF Computation Complete Counter bit 3 position. */
#define CTE_GCAFCCC4_bm  (1<<4)  /* GCAF Computation Complete Counter bit 4 mask. */
#define CTE_GCAFCCC4_bp  4  /* GCAF Computation Complete Counter bit 4 position. */
#define CTE_GCAFCCC5_bm  (1<<5)  /* GCAF Computation Complete Counter bit 5 mask. */
#define CTE_GCAFCCC5_bp  5  /* GCAF Computation Complete Counter bit 5 position. */
#define CTE_GCAFCCC6_bm  (1<<6)  /* GCAF Computation Complete Counter bit 6 mask. */
#define CTE_GCAFCCC6_bp  6  /* GCAF Computation Complete Counter bit 6 position. */
#define CTE_GCAFCCCM_bm  0x80  /* GCAF Computation Complete Counter Mode bit mask. */
#define CTE_GCAFCCCM_bp  7  /* GCAF Computation Complete Counter Mode bit position. */

