gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.GCAFHDLCNT  bit masks and bit positions */
#define CTE_GCAFHDLCNT_gm  0xFFFF  /* GCAF Headroom Detect Low Counter group mask. */
#define CTE_GCAFHDLCNT_gp  0  /* GCAF Headroom Detect Low Counter group position. */
#define CTE_GCAFHDLCNT0_bm  (1<<0)  /* GCAF Headroom Detect Low Counter bit 0 mask. */
#define CTE_GCAFHDLCNT0_bp  0  /* GCAF Headroom Detect Low Counter bit 0 position. */
#define CTE_GCAFHDLCNT1_bm  (1<<1)  /* GCAF Headroom Detect Low Counter bit 1 mask. */
#define CTE_GCAFHDLCNT1_bp  1  /* GCAF Headroom Detect Low Counter bit 1 position. */
#define CTE_GCAFHDLCNT2_bm  (1<<2)  /* GCAF Headroom Detect Low Counter bit 2 mask. */
#define CTE_GCAFHDLCNT2_bp  2  /* GCAF Headroom Detect Low Counter bit 2 position. */
#define CTE_GCAFHDLCNT3_bm  (1<<3)  /* GCAF Headroom Detect Low Counter bit 3 mask. */
#define CTE_GCAFHDLCNT3_bp  3  /* GCAF Headroom Detect Low Counter bit 3 position. */
#define CTE_GCAFHDLCNT4_bm  (1<<4)  /* GCAF Headroom Detect Low Counter bit 4 mask. */
#define CTE_GCAFHDLCNT4_bp  4  /* GCAF Headroom Detect Low Counter bit 4 position. */
#define CTE_GCAFHDLCNT5_bm  (1<<5)  /* GCAF Headroom Detect Low Counter bit 5 mask. */
#define CTE_GCAFHDLCNT5_bp  5  /* GCAF Headroom Detect Low Counter bit 5 position. */
#define CTE_GCAFHDLCNT6_bm  (1<<6)  /* GCAF Headroom Detect Low Counter bit 6 mask. */
#define CTE_GCAFHDLCNT6_bp  6  /* GCAF Headroom Detect Low Counter bit 6 position. */
#define CTE_GCAFHDLCNT7_bm  (1<<7)  /* GCAF Headroom Detect Low Counter bit 7 mask. */
#define CTE_GCAFHDLCNT7_bp  7  /* GCAF Headroom Detect Low Counter bit 7 position. */
#define CTE_GCAFHDLCNT8_bm  (1<<8)  /* GCAF Headroom Detect Low Counter bit 8 mask. */
#define CTE_GCAFHDLCNT8_bp  8  /* GCAF Headroom Detect Low Counter bit 8 position. */
#define CTE_GCAFHDLCNT9_bm  (1<<9)  /* GCAF Headroom Detect Low Counter bit 9 mask. */
#define CTE_GCAFHDLCNT9_bp  9  /* GCAF Headroom Detect Low Counter bit 9 position. */
#define CTE_GCAFHDLCNT10_bm  (1<<10)  /* GCAF Headroom Detect Low Counter bit 10 mask. */
#define CTE_GCAFHDLCNT10_bp  10  /* GCAF Headroom Detect Low Counter bit 10 position. */
#define CTE_GCAFHDLCNT11_bm  (1<<11)  /* GCAF Headroom Detect Low Counter bit 11 mask. */
#define CTE_GCAFHDLCNT11_bp  11  /* GCAF Headroom Detect Low Counter bit 11 position. */
#define CTE_GCAFHDLCNT12_bm  (1<<12)  /* GCAF Headroom Detect Low Counter bit 12 mask. */
#define CTE_GCAFHDLCNT12_bp  12  /* GCAF Headroom Detect Low Counter bit 12 position. */
#define CTE_GCAFHDLCNT13_bm  (1<<13)  /* GCAF Headroom Detect Low Counter bit 13 mask. */
#define CTE_GCAFHDLCNT13_bp  13  /* GCAF Headroom Detect Low Counter bit 13 position. */
#define CTE_GCAFHDLCNT14_bm  (1<<14)  /* GCAF Headroom Detect Low Counter bit 14 mask. */
#define CTE_GCAFHDLCNT14_bp  14  /* GCAF Headroom Detect Low Counter bit 14 position. */
#define CTE_GCAFHDLCNT15_bm  (1<<15)  /* GCAF Headroom Detect Low Counter bit 15 mask. */
#define CTE_GCAFHDLCNT15_bp  15  /* GCAF Headroom Detect Low Counter bit 15 position. */

/* CTE.GCAFHDHCNT  bit masks and bit positions */
#define CTE_GCAFHDHCNT_gm  0xFFFF  /* GCAF Headroom Detect High Counter group mask. */
#define CTE_GCAFHDHCNT_gp  0  /* GCAF Headroom Detect High Counter group position. */
#define CTE_GCAFHDHCNT0_bm  (1<<0)  /* GCAF Headroom Detect High Counter bit 0 mask. */
#define CTE_GCAFHDHCNT0_bp  0  /* GCAF Headroom Detect High Counter bit 0 position. */
#define CTE_GCAFHDHCNT1_bm  (1<<1)  /* GCAF Headroom Detect High Counter bit 1 mask. */
#define CTE_GCAFHDHCNT1_bp  1  /* GCAF Headroom Detect High Counter bit 1 position. */
#define CTE_GCAFHDHCNT2_bm  (1<<2)  /* GCAF Headroom Detect High Counter bit 2 mask. */
#define CTE_GCAFHDHCNT2_bp  2  /* GCAF Headroom Detect High Counter bit 2 position. */
#define CTE_GCAFHDHCNT3_bm  (1<<3)  /* GCAF Headroom Detect High Counter bit 3 mask. */
#define CTE_GCAFHDHCNT3_bp  3  /* GCAF Headroom Detect High Counter bit 3 position. */
#define CTE_GCAFHDHCNT4_bm  (1<<4)  /* GCAF Headroom Detect High Counter bit 4 mask. */
#define CTE_GCAFHDHCNT4_bp  4  /* GCAF Headroom Detect High Counter bit 4 position. */
#define CTE_GCAFHDHCNT5_bm  (1<<5)  /* GCAF Headroom Detect High Counter bit 5 mask. */
#define CTE_GCAFHDHCNT5_bp  5  /* GCAF Headroom Detect High Counter bit 5 position. */
#define CTE_GCAFHDHCNT6_bm  (1<<6)  /* GCAF Headroom Detect High Counter bit 6 mask. */
#define CTE_GCAFHDHCNT6_bp  6  /* GCAF Headroom Detect High Counter bit 6 position. */
#define CTE_GCAFHDHCNT7_bm  (1<<7)  /* GCAF Headroom Detect High Counter bit 7 mask. */
#define CTE_GCAFHDHCNT7_bp  7  /* GCAF Headroom Detect High Counter bit 7 position. */
#define CTE_GCAFHDHCNT8_bm  (1<<8)  /* GCAF Headroom Detect High Counter bit 8 mask. */
#define CTE_GCAFHDHCNT8_bp  8  /* GCAF Headroom Detect High Counter bit 8 position. */
#define CTE_GCAFHDHCNT9_bm  (1<<9)  /* GCAF Headroom Detect High Counter bit 9 mask. */
#define CTE_GCAFHDHCNT9_bp  9  /* GCAF Headroom Detect High Counter bit 9 position. */
#define CTE_GCAFHDHCNT10_bm  (1<<10)  /* GCAF Headroom Detect High Counter bit 10 mask. */
#define CTE_GCAFHDHCNT10_bp  10  /* GCAF Headroom Detect High Counter bit 10 position. */
#define CTE_GCAFHDHCNT11_bm  (1<<11)  /* GCAF Headroom Detect High Counter bit 11 mask. */
#define CTE_GCAFHDHCNT11_bp  11  /* GCAF Headroom Detect High Counter bit 11 position. */
#define CTE_GCAFHDHCNT12_bm  (1<<12)  /* GCAF Headroom Detect High Counter bit 12 mask. */
#define CTE_GCAFHDHCNT12_bp  12  /* GCAF Headroom Detect High Counter bit 12 position. */
#define CTE_GCAFHDHCNT13_bm  (1<<13)  /* GCAF Headroom Detect High Counter bit 13 mask. */
#define CTE_GCAFHDHCNT13_bp  13  /* GCAF Headroom Detect High Counter bit 13 position. */
#define CTE_GCAFHDHCNT14_bm  (1<<14)  /* GCAF Headroom Detect High Counter bit 14 mask. */
#define CTE_GCAFHDHCNT14_bp  14  /* GCAF Headroom Detect High Counter bit 14 position. */
#define CTE_GCAFHDHCNT15_bm  (1<<15)  /* GCAF Headroom Detect High Counter bit 15 mask. */
#define CTE_GCAFHDHCNT15_bp  15  /* GCAF Headroom Detect High Counter bit 15 position. */

/* CTE.GCAFCCCLIM  bit masks and bit positions */
#define CTE_GCAFCCCLIM_gm  0xFFFF  /* GCAF Computation Complete Counter limit group mask. */
#define CTE_GCAFCCCLIM_gp  0  /* GCAF Computation Complete Counter limit group position. */
#define CTE_GCAFCCCLIM0_bm  (1<<0)  /* GCAF Computation Complete Counter limit bit 0 mask. */
#define CTE_GCAFCCCLIM0_bp  0  /* GCAF Computation Complete Counter limit bit 0 position. */
#define CTE_GCAFCCCLIM1_bm  (1<<1)  /* GCAF Computation Complete Counter limit bit 1 mask. */
#define CTE_GCAFCCCLIM1_bp  1  /* GCAF Computation Complete Counter limit bit 1 position. */
#define CTE_GCAFCCCLIM2_bm  (1<<2)  /* GCAF Computation Complete Counter limit bit 2 mask. */
#define CTE_GCAFCCCLIM2_bp  2  /* GCAF Computation Complete Counter limit bit 2 position. */
#define CTE_GCAFCCCLIM3_bm  (1<<3)  /* GCAF Computation Complete Counter limit bit 3 mask. */
#define CTE_GCAFCCCLIM3_bp  3  /* GCAF Computation Complete Counter limit bit 3 position. */
#define CTE_GCAFCCCLIM4_bm  (1<<4)  /* GCAF Computation Complete Counter limit bit 4 mask. */
#define CTE_GCAFCCCLIM4_bp  4  /* GCAF Computation Complete Counter limit bit 4 position. */
#define CTE_GCAFCCCLIM5_bm  (1<<5)  /* GCAF Computation Complete Counter limit bit 5 mask. */
#define CTE_GCAFCCCLIM5_bp  5  /* GCAF Computation Complete Counter limit bit 5 position. */
#define CTE_GCAFCCCLIM6_bm  (1<<6)  /* GCAF Computation Complete Counter limit bit 6 mask. */
#define CTE_GCAFCCCLIM6_bp  6  /* GCAF Computation Complete Counter limit bit 6 position. */
#define CTE_GCAFCCCLIM7_bm  (1<<7)  /* GCAF Computation Complete Counter limit bit 7 mask. */
#define CTE_GCAFCCCLIM7_bp  7  /* GCAF Computation Complete Counter limit bit 7 position. */
#define CTE_GCAFCCCLIM8_bm  (1<<8)  /* GCAF Computation Complete Counter limit bit 8 mask. */
#define CTE_GCAFCCCLIM8_bp  8  /* GCAF Computation Complete Counter limit bit 8 position. */
#define CTE_GCAFCCCLIM9_bm  (1<<9)  /* GCAF Computation Complete Counter limit bit 9 mask. */
#define CTE_GCAFCCCLIM9_bp  9  /* GCAF Computation Complete Counter limit bit 9 position. */
#define CTE_GCAFCCCLIM10_bm  (1<<10)  /* GCAF Computation Complete Counter limit bit 10 mask. */
#define CTE_GCAFCCCLIM10_bp  10  /* GCAF Computation Complete Counter limit bit 10 position. */
#define CTE_GCAFCCCLIM11_bm  (1<<11)  /* GCAF Computation Complete Counter limit bit 11 mask. */
#define CTE_GCAFCCCLIM11_bp  11  /* GCAF Computation Complete Counter limit bit 11 position. */
#define CTE_GCAFCCCLIM12_bm  (1<<12)  /* GCAF Computation Complete Counter limit bit 12 mask. */
#define CTE_GCAFCCCLIM12_bp  12  /* GCAF Computation Complete Counter limit bit 12 position. */
#define CTE_GCAFCCCLIM13_bm  (1<<13)  /* GCAF Computation Complete Counter limit bit 13 mask. */
#define CTE_GCAFCCCLIM13_bp  13  /* GCAF Computation Complete Counter limit bit 13 position. */
#define CTE_GCAFCCCLIM14_bm  (1<<14)  /* GCAF Computation Complete Counter limit bit 14 mask. */
#define CTE_GCAFCCCLIM14_bp  14  /* GCAF Computation Complete Counter limit bit 14 position. */
#define CTE_GCAFCCCLIM15_bm  (1<<15)  /* GCAF Computation Complete Counter limit bit 15 mask. */
#define CTE_GCAFCCCLIM15_bp  15  /* GCAF Computation Complete Counter limit bit 15 position. */

/* CTE.PIFXPORTA  bit masks and bit positions */
#define CTE_PIFXPORT_gm  0xFFFF  /* Port Interface X-lines PORT group mask. */
#define CTE_PIFXPORT_gp  0  /* Port Interface X-lines PORT group position. */
#define CTE_PIFXPORT0_bm  (1<<0)  /* Port Interface X-lines PORT bit 0 mask. */
#define CTE_PIFXPORT0_bp  0  /* Port Interface X-lines PORT bit 0 position. */
#define CTE_PIFXPORT1_bm  (1<<1)  /* Port Interface X-lines PORT bit 1 mask. */
#define CTE_PIFXPORT1_bp  1  /* Port Interface X-lines PORT bit 1 position. */
#define CTE_PIFXPORT2_bm  (1<<2)  /* Port Interface X-lines PORT bit 2 mask. */
#define CTE_PIFXPORT2_bp  2  /* Port Interface X-lines PORT bit 2 position. */
#define CTE_PIFXPORT3_bm  (1<<3)  /* Port Interface X-lines PORT bit 3 mask. */
#define CTE_PIFXPORT3_bp  3  /* Port Interface X-lines PORT bit 3 position. */
#define CTE_PIFXPORT4_bm  (1<<4)  /* Port Interface X-lines PORT bit 4 mask. */
#define CTE_PIFXPORT4_bp  4  /* Port Interface X-lines PORT bit 4 position. */
#define CTE_PIFXPORT5_bm  (1<<5)  /* Port Interface X-lines PORT bit 5 mask. */
#define CTE_PIFXPORT5_bp  5  /* Port Interface X-lines PORT bit 5 position. */
#define CTE_PIFXPORT6_bm  (1<<6)  /* Port Interface X-lines PORT bit 6 mask. */
#define CTE_PIFXPORT6_bp  6  /* Port Interface X-lines PORT bit 6 position. */
#define CTE_PIFXPORT7_bm  (1<<7)  /* Port Interface X-lines PORT bit 7 mask. */
#define CTE_PIFXPORT7_bp  7  /* Port Interface X-lines PORT bit 7 position. */
#define CTE_PIFXPORT8_bm  (1<<8)  /* Port Interface X-lines PORT bit 8 mask. */
#define CTE_PIFXPORT8_bp  8  /* Port Interface X-lines PORT bit 8 position. */
#define CTE_PIFXPORT9_bm  (1<<9)  /* Port Interface X-lines PORT bit 9 mask. */
#define CTE_PIFXPORT9_bp  9  /* Port Interface X-lines PORT bit 9 position. */
#define CTE_PIFXPORT10_bm  (1<<10)  /* Port Interface X-lines PORT bit 10 mask. */
#define CTE_PIFXPORT10_bp  10  /* Port Interface X-lines PORT bit 10 position. */
#define CTE_PIFXPORT11_bm  (1<<11)  /* Port Interface X-lines PORT bit 11 mask. */
#define CTE_PIFXPORT11_bp  11  /* Port Interface X-lines PORT bit 11 position. */
#define CTE_PIFXPORT12_bm  (1<<12)  /* Port Interface X-lines PORT bit 12 mask. */
#define CTE_PIFXPORT12_bp  12  /* Port Interface X-lines PORT bit 12 position. */
#define CTE_PIFXPORT13_bm  (1<<13)  /* Port Interface X-lines PORT bit 13 mask. */
#define CTE_PIFXPORT13_bp  13  /* Port Interface X-lines PORT bit 13 position. */
#define CTE_PIFXPORT14_bm  (1<<14)  /* Port Interface X-lines PORT bit 14 mask. */
#define CTE_PIFXPORT14_bp  14  /* Port Interface X-lines PORT bit 14 position. */
#define CTE_PIFXPORT15_bm  (1<<15)  /* Port Interface X-lines PORT bit 15 mask. */
#define CTE_PIFXPORT15_bp  15  /* Port Interface X-lines PORT bit 15 position. */

