gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PIFXPORTB  bit masks and bit positions */
/* CTE_PIFXPORT  is already defined. */

/* CTE.PIFYPORTA  bit masks and bit positions */
#define CTE_PIFYPORT_gm  0xFFFF  /* Port Interface Y-lines PORT group mask. */
#define CTE_PIFYPORT_gp  0  /* Port Interface Y-lines PORT group position. */
#define CTE_PIFYPORT0_bm  (1<<0)  /* Port Interface Y-lines PORT bit 0 mask. */
#define CTE_PIFYPORT0_bp  0  /* Port Interface Y-lines PORT bit 0 position. */
#define CTE_PIFYPORT1_bm  (1<<1)  /* Port Interface Y-lines PORT bit 1 mask. */
#define CTE_PIFYPORT1_bp  1  /* Port Interface Y-lines PORT bit 1 position. */
#define CTE_PIFYPORT2_bm  (1<<2)  /* Port Interface Y-lines PORT bit 2 mask. */
#define CTE_PIFYPORT2_bp  2  /* Port Interface Y-lines PORT bit 2 position. */
#define CTE_PIFYPORT3_bm  (1<<3)  /* Port Interface Y-lines PORT bit 3 mask. */
#define CTE_PIFYPORT3_bp  3  /* Port Interface Y-lines PORT bit 3 position. */
#define CTE_PIFYPORT4_bm  (1<<4)  /* Port Interface Y-lines PORT bit 4 mask. */
#define CTE_PIFYPORT4_bp  4  /* Port Interface Y-lines PORT bit 4 position. */
#define CTE_PIFYPORT5_bm  (1<<5)  /* Port Interface Y-lines PORT bit 5 mask. */
#define CTE_PIFYPORT5_bp  5  /* Port Interface Y-lines PORT bit 5 position. */
#define CTE_PIFYPORT6_bm  (1<<6)  /* Port Interface Y-lines PORT bit 6 mask. */
#define CTE_PIFYPORT6_bp  6  /* Port Interface Y-lines PORT bit 6 position. */
#define CTE_PIFYPORT7_bm  (1<<7)  /* Port Interface Y-lines PORT bit 7 mask. */
#define CTE_PIFYPORT7_bp  7  /* Port Interface Y-lines PORT bit 7 position. */
#define CTE_PIFYPORT8_bm  (1<<8)  /* Port Interface Y-lines PORT bit 8 mask. */
#define CTE_PIFYPORT8_bp  8  /* Port Interface Y-lines PORT bit 8 position. */
#define CTE_PIFYPORT9_bm  (1<<9)  /* Port Interface Y-lines PORT bit 9 mask. */
#define CTE_PIFYPORT9_bp  9  /* Port Interface Y-lines PORT bit 9 position. */
#define CTE_PIFYPORT10_bm  (1<<10)  /* Port Interface Y-lines PORT bit 10 mask. */
#define CTE_PIFYPORT10_bp  10  /* Port Interface Y-lines PORT bit 10 position. */
#define CTE_PIFYPORT11_bm  (1<<11)  /* Port Interface Y-lines PORT bit 11 mask. */
#define CTE_PIFYPORT11_bp  11  /* Port Interface Y-lines PORT bit 11 position. */
#define CTE_PIFYPORT12_bm  (1<<12)  /* Port Interface Y-lines PORT bit 12 mask. */
#define CTE_PIFYPORT12_bp  12  /* Port Interface Y-lines PORT bit 12 position. */
#define CTE_PIFYPORT13_bm  (1<<13)  /* Port Interface Y-lines PORT bit 13 mask. */
#define CTE_PIFYPORT13_bp  13  /* Port Interface Y-lines PORT bit 13 position. */
#define CTE_PIFYPORT14_bm  (1<<14)  /* Port Interface Y-lines PORT bit 14 mask. */
#define CTE_PIFYPORT14_bp  14  /* Port Interface Y-lines PORT bit 14 position. */
#define CTE_PIFYPORT15_bm  (1<<15)  /* Port Interface Y-lines PORT bit 15 mask. */
#define CTE_PIFYPORT15_bp  15  /* Port Interface Y-lines PORT bit 15 position. */

/* CTE.PIFYPORTB  bit masks and bit positions */
/* CTE_PIFYPORT  is already defined. */

/* CTE.PIFXDDRA  bit masks and bit positions */
#define CTE_PIFXDDR_gm  0xFFFF  /* Port Interface X-lines DDR group mask. */
#define CTE_PIFXDDR_gp  0  /* Port Interface X-lines DDR group position. */
#define CTE_PIFXDDR0_bm  (1<<0)  /* Port Interface X-lines DDR bit 0 mask. */
#define CTE_PIFXDDR0_bp  0  /* Port Interface X-lines DDR bit 0 position. */
#define CTE_PIFXDDR1_bm  (1<<1)  /* Port Interface X-lines DDR bit 1 mask. */
#define CTE_PIFXDDR1_bp  1  /* Port Interface X-lines DDR bit 1 position. */
#define CTE_PIFXDDR2_bm  (1<<2)  /* Port Interface X-lines DDR bit 2 mask. */
#define CTE_PIFXDDR2_bp  2  /* Port Interface X-lines DDR bit 2 position. */
#define CTE_PIFXDDR3_bm  (1<<3)  /* Port Interface X-lines DDR bit 3 mask. */
#define CTE_PIFXDDR3_bp  3  /* Port Interface X-lines DDR bit 3 position. */
#define CTE_PIFXDDR4_bm  (1<<4)  /* Port Interface X-lines DDR bit 4 mask. */
#define CTE_PIFXDDR4_bp  4  /* Port Interface X-lines DDR bit 4 position. */
#define CTE_PIFXDDR5_bm  (1<<5)  /* Port Interface X-lines DDR bit 5 mask. */
#define CTE_PIFXDDR5_bp  5  /* Port Interface X-lines DDR bit 5 position. */
#define CTE_PIFXDDR6_bm  (1<<6)  /* Port Interface X-lines DDR bit 6 mask. */
#define CTE_PIFXDDR6_bp  6  /* Port Interface X-lines DDR bit 6 position. */
#define CTE_PIFXDDR7_bm  (1<<7)  /* Port Interface X-lines DDR bit 7 mask. */
#define CTE_PIFXDDR7_bp  7  /* Port Interface X-lines DDR bit 7 position. */
#define CTE_PIFXDDR8_bm  (1<<8)  /* Port Interface X-lines DDR bit 8 mask. */
#define CTE_PIFXDDR8_bp  8  /* Port Interface X-lines DDR bit 8 position. */
#define CTE_PIFXDDR9_bm  (1<<9)  /* Port Interface X-lines DDR bit 9 mask. */
#define CTE_PIFXDDR9_bp  9  /* Port Interface X-lines DDR bit 9 position. */
#define CTE_PIFXDDR10_bm  (1<<10)  /* Port Interface X-lines DDR bit 10 mask. */
#define CTE_PIFXDDR10_bp  10  /* Port Interface X-lines DDR bit 10 position. */
#define CTE_PIFXDDR11_bm  (1<<11)  /* Port Interface X-lines DDR bit 11 mask. */
#define CTE_PIFXDDR11_bp  11  /* Port Interface X-lines DDR bit 11 position. */
#define CTE_PIFXDDR12_bm  (1<<12)  /* Port Interface X-lines DDR bit 12 mask. */
#define CTE_PIFXDDR12_bp  12  /* Port Interface X-lines DDR bit 12 position. */
#define CTE_PIFXDDR13_bm  (1<<13)  /* Port Interface X-lines DDR bit 13 mask. */
#define CTE_PIFXDDR13_bp  13  /* Port Interface X-lines DDR bit 13 position. */
#define CTE_PIFXDDR14_bm  (1<<14)  /* Port Interface X-lines DDR bit 14 mask. */
#define CTE_PIFXDDR14_bp  14  /* Port Interface X-lines DDR bit 14 position. */
#define CTE_PIFXDDR15_bm  (1<<15)  /* Port Interface X-lines DDR bit 15 mask. */
#define CTE_PIFXDDR15_bp  15  /* Port Interface X-lines DDR bit 15 position. */

/* CTE.PIFXDDRB  bit masks and bit positions */
/* CTE_PIFXDDR  is already defined. */

/* CTE.PIFYDDRA  bit masks and bit positions */
#define CTE_PIFYDDR_gm  0xFFFF  /* Port Interface Y-lines DDR group mask. */
#define CTE_PIFYDDR_gp  0  /* Port Interface Y-lines DDR group position. */
#define CTE_PIFYDDR0_bm  (1<<0)  /* Port Interface Y-lines DDR bit 0 mask. */
#define CTE_PIFYDDR0_bp  0  /* Port Interface Y-lines DDR bit 0 position. */
#define CTE_PIFYDDR1_bm  (1<<1)  /* Port Interface Y-lines DDR bit 1 mask. */
#define CTE_PIFYDDR1_bp  1  /* Port Interface Y-lines DDR bit 1 position. */
#define CTE_PIFYDDR2_bm  (1<<2)  /* Port Interface Y-lines DDR bit 2 mask. */
#define CTE_PIFYDDR2_bp  2  /* Port Interface Y-lines DDR bit 2 position. */
#define CTE_PIFYDDR3_bm  (1<<3)  /* Port Interface Y-lines DDR bit 3 mask. */
#define CTE_PIFYDDR3_bp  3  /* Port Interface Y-lines DDR bit 3 position. */
#define CTE_PIFYDDR4_bm  (1<<4)  /* Port Interface Y-lines DDR bit 4 mask. */
#define CTE_PIFYDDR4_bp  4  /* Port Interface Y-lines DDR bit 4 position. */
#define CTE_PIFYDDR5_bm  (1<<5)  /* Port Interface Y-lines DDR bit 5 mask. */
#define CTE_PIFYDDR5_bp  5  /* Port Interface Y-lines DDR bit 5 position. */
#define CTE_PIFYDDR6_bm  (1<<6)  /* Port Interface Y-lines DDR bit 6 mask. */
#define CTE_PIFYDDR6_bp  6  /* Port Interface Y-lines DDR bit 6 position. */
#define CTE_PIFYDDR7_bm  (1<<7)  /* Port Interface Y-lines DDR bit 7 mask. */
#define CTE_PIFYDDR7_bp  7  /* Port Interface Y-lines DDR bit 7 position. */
#define CTE_PIFYDDR8_bm  (1<<8)  /* Port Interface Y-lines DDR bit 8 mask. */
#define CTE_PIFYDDR8_bp  8  /* Port Interface Y-lines DDR bit 8 position. */
#define CTE_PIFYDDR9_bm  (1<<9)  /* Port Interface Y-lines DDR bit 9 mask. */
#define CTE_PIFYDDR9_bp  9  /* Port Interface Y-lines DDR bit 9 position. */
#define CTE_PIFYDDR10_bm  (1<<10)  /* Port Interface Y-lines DDR bit 10 mask. */
#define CTE_PIFYDDR10_bp  10  /* Port Interface Y-lines DDR bit 10 position. */
#define CTE_PIFYDDR11_bm  (1<<11)  /* Port Interface Y-lines DDR bit 11 mask. */
#define CTE_PIFYDDR11_bp  11  /* Port Interface Y-lines DDR bit 11 position. */
#define CTE_PIFYDDR12_bm  (1<<12)  /* Port Interface Y-lines DDR bit 12 mask. */
#define CTE_PIFYDDR12_bp  12  /* Port Interface Y-lines DDR bit 12 position. */
#define CTE_PIFYDDR13_bm  (1<<13)  /* Port Interface Y-lines DDR bit 13 mask. */
#define CTE_PIFYDDR13_bp  13  /* Port Interface Y-lines DDR bit 13 position. */
#define CTE_PIFYDDR14_bm  (1<<14)  /* Port Interface Y-lines DDR bit 14 mask. */
#define CTE_PIFYDDR14_bp  14  /* Port Interface Y-lines DDR bit 14 position. */
#define CTE_PIFYDDR15_bm  (1<<15)  /* Port Interface Y-lines DDR bit 15 mask. */
#define CTE_PIFYDDR15_bp  15  /* Port Interface Y-lines DDR bit 15 position. */

/* CTE.PIFYDDRB  bit masks and bit positions */
/* CTE_PIFYDDR  is already defined. */

/* CTE.PIFXTGLA  bit masks and bit positions */
#define CTE_PIFXTGL_gm  0xFFFF  /* Port Interface X-lines Toggle group mask. */
#define CTE_PIFXTGL_gp  0  /* Port Interface X-lines Toggle group position. */
#define CTE_PIFXTGL0_bm  (1<<0)  /* Port Interface X-lines Toggle bit 0 mask. */
#define CTE_PIFXTGL0_bp  0  /* Port Interface X-lines Toggle bit 0 position. */
#define CTE_PIFXTGL1_bm  (1<<1)  /* Port Interface X-lines Toggle bit 1 mask. */
#define CTE_PIFXTGL1_bp  1  /* Port Interface X-lines Toggle bit 1 position. */
#define CTE_PIFXTGL2_bm  (1<<2)  /* Port Interface X-lines Toggle bit 2 mask. */
#define CTE_PIFXTGL2_bp  2  /* Port Interface X-lines Toggle bit 2 position. */
#define CTE_PIFXTGL3_bm  (1<<3)  /* Port Interface X-lines Toggle bit 3 mask. */
#define CTE_PIFXTGL3_bp  3  /* Port Interface X-lines Toggle bit 3 position. */
#define CTE_PIFXTGL4_bm  (1<<4)  /* Port Interface X-lines Toggle bit 4 mask. */
#define CTE_PIFXTGL4_bp  4  /* Port Interface X-lines Toggle bit 4 position. */
#define CTE_PIFXTGL5_bm  (1<<5)  /* Port Interface X-lines Toggle bit 5 mask. */
#define CTE_PIFXTGL5_bp  5  /* Port Interface X-lines Toggle bit 5 position. */
#define CTE_PIFXTGL6_bm  (1<<6)  /* Port Interface X-lines Toggle bit 6 mask. */
#define CTE_PIFXTGL6_bp  6  /* Port Interface X-lines Toggle bit 6 position. */
#define CTE_PIFXTGL7_bm  (1<<7)  /* Port Interface X-lines Toggle bit 7 mask. */
#define CTE_PIFXTGL7_bp  7  /* Port Interface X-lines Toggle bit 7 position. */
#define CTE_PIFXTGL8_bm  (1<<8)  /* Port Interface X-lines Toggle bit 8 mask. */
#define CTE_PIFXTGL8_bp  8  /* Port Interface X-lines Toggle bit 8 position. */
#define CTE_PIFXTGL9_bm  (1<<9)  /* Port Interface X-lines Toggle bit 9 mask. */
#define CTE_PIFXTGL9_bp  9  /* Port Interface X-lines Toggle bit 9 position. */
#define CTE_PIFXTGL10_bm  (1<<10)  /* Port Interface X-lines Toggle bit 10 mask. */
#define CTE_PIFXTGL10_bp  10  /* Port Interface X-lines Toggle bit 10 position. */
#define CTE_PIFXTGL11_bm  (1<<11)  /* Port Interface X-lines Toggle bit 11 mask. */
#define CTE_PIFXTGL11_bp  11  /* Port Interface X-lines Toggle bit 11 position. */
#define CTE_PIFXTGL12_bm  (1<<12)  /* Port Interface X-lines Toggle bit 12 mask. */
#define CTE_PIFXTGL12_bp  12  /* Port Interface X-lines Toggle bit 12 position. */
#define CTE_PIFXTGL13_bm  (1<<13)  /* Port Interface X-lines Toggle bit 13 mask. */
#define CTE_PIFXTGL13_bp  13  /* Port Interface X-lines Toggle bit 13 position. */
#define CTE_PIFXTGL14_bm  (1<<14)  /* Port Interface X-lines Toggle bit 14 mask. */
#define CTE_PIFXTGL14_bp  14  /* Port Interface X-lines Toggle bit 14 position. */
#define CTE_PIFXTGL15_bm  (1<<15)  /* Port Interface X-lines Toggle bit 15 mask. */
#define CTE_PIFXTGL15_bp  15  /* Port Interface X-lines Toggle bit 15 position. */

/* CTE.PIFXTGLB  bit masks and bit positions */
/* CTE_PIFXTGL  is already defined. */

/* CTE.PIFYTGLA  bit masks and bit positions */
#define CTE_PIFYTGL_gm  0xFFFF  /* Port Interface Y-lines Toggle group mask. */
#define CTE_PIFYTGL_gp  0  /* Port Interface Y-lines Toggle group position. */
#define CTE_PIFYTGL0_bm  (1<<0)  /* Port Interface Y-lines Toggle bit 0 mask. */
#define CTE_PIFYTGL0_bp  0  /* Port Interface Y-lines Toggle bit 0 position. */
#define CTE_PIFYTGL1_bm  (1<<1)  /* Port Interface Y-lines Toggle bit 1 mask. */
#define CTE_PIFYTGL1_bp  1  /* Port Interface Y-lines Toggle bit 1 position. */
#define CTE_PIFYTGL2_bm  (1<<2)  /* Port Interface Y-lines Toggle bit 2 mask. */
#define CTE_PIFYTGL2_bp  2  /* Port Interface Y-lines Toggle bit 2 position. */
#define CTE_PIFYTGL3_bm  (1<<3)  /* Port Interface Y-lines Toggle bit 3 mask. */
#define CTE_PIFYTGL3_bp  3  /* Port Interface Y-lines Toggle bit 3 position. */
#define CTE_PIFYTGL4_bm  (1<<4)  /* Port Interface Y-lines Toggle bit 4 mask. */
#define CTE_PIFYTGL4_bp  4  /* Port Interface Y-lines Toggle bit 4 position. */
#define CTE_PIFYTGL5_bm  (1<<5)  /* Port Interface Y-lines Toggle bit 5 mask. */
#define CTE_PIFYTGL5_bp  5  /* Port Interface Y-lines Toggle bit 5 position. */
#define CTE_PIFYTGL6_bm  (1<<6)  /* Port Interface Y-lines Toggle bit 6 mask. */
#define CTE_PIFYTGL6_bp  6  /* Port Interface Y-lines Toggle bit 6 position. */
#define CTE_PIFYTGL7_bm  (1<<7)  /* Port Interface Y-lines Toggle bit 7 mask. */
#define CTE_PIFYTGL7_bp  7  /* Port Interface Y-lines Toggle bit 7 position. */
#define CTE_PIFYTGL8_bm  (1<<8)  /* Port Interface Y-lines Toggle bit 8 mask. */
#define CTE_PIFYTGL8_bp  8  /* Port Interface Y-lines Toggle bit 8 position. */
#define CTE_PIFYTGL9_bm  (1<<9)  /* Port Interface Y-lines Toggle bit 9 mask. */
#define CTE_PIFYTGL9_bp  9  /* Port Interface Y-lines Toggle bit 9 position. */
#define CTE_PIFYTGL10_bm  (1<<10)  /* Port Interface Y-lines Toggle bit 10 mask. */
#define CTE_PIFYTGL10_bp  10  /* Port Interface Y-lines Toggle bit 10 position. */
#define CTE_PIFYTGL11_bm  (1<<11)  /* Port Interface Y-lines Toggle bit 11 mask. */
#define CTE_PIFYTGL11_bp  11  /* Port Interface Y-lines Toggle bit 11 position. */
#define CTE_PIFYTGL12_bm  (1<<12)  /* Port Interface Y-lines Toggle bit 12 mask. */
#define CTE_PIFYTGL12_bp  12  /* Port Interface Y-lines Toggle bit 12 position. */
#define CTE_PIFYTGL13_bm  (1<<13)  /* Port Interface Y-lines Toggle bit 13 mask. */
#define CTE_PIFYTGL13_bp  13  /* Port Interface Y-lines Toggle bit 13 position. */
#define CTE_PIFYTGL14_bm  (1<<14)  /* Port Interface Y-lines Toggle bit 14 mask. */
#define CTE_PIFYTGL14_bp  14  /* Port Interface Y-lines Toggle bit 14 position. */
#define CTE_PIFYTGL15_bm  (1<<15)  /* Port Interface Y-lines Toggle bit 15 mask. */
#define CTE_PIFYTGL15_bp  15  /* Port Interface Y-lines Toggle bit 15 position. */

