gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.SCGRNGYN  bit masks and bit positions */
#define CTE_SCGRNGYNA_gm  0x07  /* Selfcap Global Range Y N A group mask. */
#define CTE_SCGRNGYNA_gp  0  /* Selfcap Global Range Y N A group position. */
#define CTE_SCGRNGYNA0_bm  (1<<0)  /* Selfcap Global Range Y N A bit 0 mask. */
#define CTE_SCGRNGYNA0_bp  0  /* Selfcap Global Range Y N A bit 0 position. */
#define CTE_SCGRNGYNA1_bm  (1<<1)  /* Selfcap Global Range Y N A bit 1 mask. */
#define CTE_SCGRNGYNA1_bp  1  /* Selfcap Global Range Y N A bit 1 position. */
#define CTE_SCGRNGYNA2_bm  (1<<2)  /* Selfcap Global Range Y N A bit 2 mask. */
#define CTE_SCGRNGYNA2_bp  2  /* Selfcap Global Range Y N A bit 2 position. */
#define CTE_SCGRNGYNB_gm  0x70  /* Selfcap Global Range Y N B group mask. */
#define CTE_SCGRNGYNB_gp  4  /* Selfcap Global Range Y N B group position. */
#define CTE_SCGRNGYNB0_bm  (1<<4)  /* Selfcap Global Range Y N B bit 0 mask. */
#define CTE_SCGRNGYNB0_bp  4  /* Selfcap Global Range Y N B bit 0 position. */
#define CTE_SCGRNGYNB1_bm  (1<<5)  /* Selfcap Global Range Y N B bit 1 mask. */
#define CTE_SCGRNGYNB1_bp  5  /* Selfcap Global Range Y N B bit 1 position. */
#define CTE_SCGRNGYNB2_bm  (1<<6)  /* Selfcap Global Range Y N B bit 2 mask. */
#define CTE_SCGRNGYNB2_bp  6  /* Selfcap Global Range Y N B bit 2 position. */
#define CTE_SCGRNGYNC_gm  0x700  /* Selfcap Global Range Y N C group mask. */
#define CTE_SCGRNGYNC_gp  8  /* Selfcap Global Range Y N C group position. */
#define CTE_SCGRNGYNC0_bm  (1<<8)  /* Selfcap Global Range Y N C bit 0 mask. */
#define CTE_SCGRNGYNC0_bp  8  /* Selfcap Global Range Y N C bit 0 position. */
#define CTE_SCGRNGYNC1_bm  (1<<9)  /* Selfcap Global Range Y N C bit 1 mask. */
#define CTE_SCGRNGYNC1_bp  9  /* Selfcap Global Range Y N C bit 1 position. */
#define CTE_SCGRNGYNC2_bm  (1<<10)  /* Selfcap Global Range Y N C bit 2 mask. */
#define CTE_SCGRNGYNC2_bp  10  /* Selfcap Global Range Y N C bit 2 position. */

/* CTE.SCGRNGYP  bit masks and bit positions */
#define CTE_SCGRNGYPA_gm  0x07  /* Selfcap Global Range Y P A group mask. */
#define CTE_SCGRNGYPA_gp  0  /* Selfcap Global Range Y P A group position. */
#define CTE_SCGRNGYPA0_bm  (1<<0)  /* Selfcap Global Range Y P A bit 0 mask. */
#define CTE_SCGRNGYPA0_bp  0  /* Selfcap Global Range Y P A bit 0 position. */
#define CTE_SCGRNGYPA1_bm  (1<<1)  /* Selfcap Global Range Y P A bit 1 mask. */
#define CTE_SCGRNGYPA1_bp  1  /* Selfcap Global Range Y P A bit 1 position. */
#define CTE_SCGRNGYPA2_bm  (1<<2)  /* Selfcap Global Range Y P A bit 2 mask. */
#define CTE_SCGRNGYPA2_bp  2  /* Selfcap Global Range Y P A bit 2 position. */
#define CTE_SCGRNGYPB_gm  0x70  /* Selfcap Global Range Y P B group mask. */
#define CTE_SCGRNGYPB_gp  4  /* Selfcap Global Range Y P B group position. */
#define CTE_SCGRNGYPB0_bm  (1<<4)  /* Selfcap Global Range Y P B bit 0 mask. */
#define CTE_SCGRNGYPB0_bp  4  /* Selfcap Global Range Y P B bit 0 position. */
#define CTE_SCGRNGYPB1_bm  (1<<5)  /* Selfcap Global Range Y P B bit 1 mask. */
#define CTE_SCGRNGYPB1_bp  5  /* Selfcap Global Range Y P B bit 1 position. */
#define CTE_SCGRNGYPB2_bm  (1<<6)  /* Selfcap Global Range Y P B bit 2 mask. */
#define CTE_SCGRNGYPB2_bp  6  /* Selfcap Global Range Y P B bit 2 position. */
#define CTE_SCGRNGYPC_gm  0x700  /* Selfcap Global Range Y P C group mask. */
#define CTE_SCGRNGYPC_gp  8  /* Selfcap Global Range Y P C group position. */
#define CTE_SCGRNGYPC0_bm  (1<<8)  /* Selfcap Global Range Y P C bit 0 mask. */
#define CTE_SCGRNGYPC0_bp  8  /* Selfcap Global Range Y P C bit 0 position. */
#define CTE_SCGRNGYPC1_bm  (1<<9)  /* Selfcap Global Range Y P C bit 1 mask. */
#define CTE_SCGRNGYPC1_bp  9  /* Selfcap Global Range Y P C bit 1 position. */
#define CTE_SCGRNGYPC2_bm  (1<<10)  /* Selfcap Global Range Y P C bit 2 mask. */
#define CTE_SCGRNGYPC2_bp  10  /* Selfcap Global Range Y P C bit 2 position. */

/* CTE.SCGRNGXN  bit masks and bit positions */
#define CTE_SCGRNGXNA_gm  0x07  /* Selfcap Global Range X N A group mask. */
#define CTE_SCGRNGXNA_gp  0  /* Selfcap Global Range X N A group position. */
#define CTE_SCGRNGXNA0_bm  (1<<0)  /* Selfcap Global Range X N A bit 0 mask. */
#define CTE_SCGRNGXNA0_bp  0  /* Selfcap Global Range X N A bit 0 position. */
#define CTE_SCGRNGXNA1_bm  (1<<1)  /* Selfcap Global Range X N A bit 1 mask. */
#define CTE_SCGRNGXNA1_bp  1  /* Selfcap Global Range X N A bit 1 position. */
#define CTE_SCGRNGXNA2_bm  (1<<2)  /* Selfcap Global Range X N A bit 2 mask. */
#define CTE_SCGRNGXNA2_bp  2  /* Selfcap Global Range X N A bit 2 position. */
#define CTE_SCGRNGXNB_gm  0x70  /* Selfcap Global Range X N B group mask. */
#define CTE_SCGRNGXNB_gp  4  /* Selfcap Global Range X N B group position. */
#define CTE_SCGRNGXNB0_bm  (1<<4)  /* Selfcap Global Range X N B bit 0 mask. */
#define CTE_SCGRNGXNB0_bp  4  /* Selfcap Global Range X N B bit 0 position. */
#define CTE_SCGRNGXNB1_bm  (1<<5)  /* Selfcap Global Range X N B bit 1 mask. */
#define CTE_SCGRNGXNB1_bp  5  /* Selfcap Global Range X N B bit 1 position. */
#define CTE_SCGRNGXNB2_bm  (1<<6)  /* Selfcap Global Range X N B bit 2 mask. */
#define CTE_SCGRNGXNB2_bp  6  /* Selfcap Global Range X N B bit 2 position. */
#define CTE_SCGRNGXNC_gm  0x700  /* Selfcap Global Range X N C group mask. */
#define CTE_SCGRNGXNC_gp  8  /* Selfcap Global Range X N C group position. */
#define CTE_SCGRNGXNC0_bm  (1<<8)  /* Selfcap Global Range X N C bit 0 mask. */
#define CTE_SCGRNGXNC0_bp  8  /* Selfcap Global Range X N C bit 0 position. */
#define CTE_SCGRNGXNC1_bm  (1<<9)  /* Selfcap Global Range X N C bit 1 mask. */
#define CTE_SCGRNGXNC1_bp  9  /* Selfcap Global Range X N C bit 1 position. */
#define CTE_SCGRNGXNC2_bm  (1<<10)  /* Selfcap Global Range X N C bit 2 mask. */
#define CTE_SCGRNGXNC2_bp  10  /* Selfcap Global Range X N C bit 2 position. */

/* CTE.SCGRNGXP  bit masks and bit positions */
#define CTE_SCGRNGXPA_gm  0x07  /* Selfcap Global Range X P A group mask. */
#define CTE_SCGRNGXPA_gp  0  /* Selfcap Global Range X P A group position. */
#define CTE_SCGRNGXPA0_bm  (1<<0)  /* Selfcap Global Range X P A bit 0 mask. */
#define CTE_SCGRNGXPA0_bp  0  /* Selfcap Global Range X P A bit 0 position. */
#define CTE_SCGRNGXPA1_bm  (1<<1)  /* Selfcap Global Range X P A bit 1 mask. */
#define CTE_SCGRNGXPA1_bp  1  /* Selfcap Global Range X P A bit 1 position. */
#define CTE_SCGRNGXPA2_bm  (1<<2)  /* Selfcap Global Range X P A bit 2 mask. */
#define CTE_SCGRNGXPA2_bp  2  /* Selfcap Global Range X P A bit 2 position. */
#define CTE_SCGRNGXPB_gm  0x70  /* Selfcap Global Range X P B group mask. */
#define CTE_SCGRNGXPB_gp  4  /* Selfcap Global Range X P B group position. */
#define CTE_SCGRNGXPB0_bm  (1<<4)  /* Selfcap Global Range X P B bit 0 mask. */
#define CTE_SCGRNGXPB0_bp  4  /* Selfcap Global Range X P B bit 0 position. */
#define CTE_SCGRNGXPB1_bm  (1<<5)  /* Selfcap Global Range X P B bit 1 mask. */
#define CTE_SCGRNGXPB1_bp  5  /* Selfcap Global Range X P B bit 1 position. */
#define CTE_SCGRNGXPB2_bm  (1<<6)  /* Selfcap Global Range X P B bit 2 mask. */
#define CTE_SCGRNGXPB2_bp  6  /* Selfcap Global Range X P B bit 2 position. */
#define CTE_SCGRNGXPC_gm  0x700  /* Selfcap Global Range X P C group mask. */
#define CTE_SCGRNGXPC_gp  8  /* Selfcap Global Range X P C group position. */
#define CTE_SCGRNGXPC0_bm  (1<<8)  /* Selfcap Global Range X P C bit 0 mask. */
#define CTE_SCGRNGXPC0_bp  8  /* Selfcap Global Range X P C bit 0 position. */
#define CTE_SCGRNGXPC1_bm  (1<<9)  /* Selfcap Global Range X P C bit 1 mask. */
#define CTE_SCGRNGXPC1_bp  9  /* Selfcap Global Range X P C bit 1 position. */
#define CTE_SCGRNGXPC2_bm  (1<<10)  /* Selfcap Global Range X P C bit 2 mask. */
#define CTE_SCGRNGXPC2_bp  10  /* Selfcap Global Range X P C bit 2 position. */

/* CTE.SCGRNGPN  bit masks and bit positions */
#define CTE_SCGRNGPNA_gm  0x07  /* Selfcap Global Range P N A group mask. */
#define CTE_SCGRNGPNA_gp  0  /* Selfcap Global Range P N A group position. */
#define CTE_SCGRNGPNA0_bm  (1<<0)  /* Selfcap Global Range P N A bit 0 mask. */
#define CTE_SCGRNGPNA0_bp  0  /* Selfcap Global Range P N A bit 0 position. */
#define CTE_SCGRNGPNA1_bm  (1<<1)  /* Selfcap Global Range P N A bit 1 mask. */
#define CTE_SCGRNGPNA1_bp  1  /* Selfcap Global Range P N A bit 1 position. */
#define CTE_SCGRNGPNA2_bm  (1<<2)  /* Selfcap Global Range P N A bit 2 mask. */
#define CTE_SCGRNGPNA2_bp  2  /* Selfcap Global Range P N A bit 2 position. */
#define CTE_SCGRNGPNB_gm  0x70  /* Selfcap Global Range P N B group mask. */
#define CTE_SCGRNGPNB_gp  4  /* Selfcap Global Range P N B group position. */
#define CTE_SCGRNGPNB0_bm  (1<<4)  /* Selfcap Global Range P N B bit 0 mask. */
#define CTE_SCGRNGPNB0_bp  4  /* Selfcap Global Range P N B bit 0 position. */
#define CTE_SCGRNGPNB1_bm  (1<<5)  /* Selfcap Global Range P N B bit 1 mask. */
#define CTE_SCGRNGPNB1_bp  5  /* Selfcap Global Range P N B bit 1 position. */
#define CTE_SCGRNGPNB2_bm  (1<<6)  /* Selfcap Global Range P N B bit 2 mask. */
#define CTE_SCGRNGPNB2_bp  6  /* Selfcap Global Range P N B bit 2 position. */
#define CTE_SCGRNGPNC_gm  0x700  /* Selfcap Global Range P N C group mask. */
#define CTE_SCGRNGPNC_gp  8  /* Selfcap Global Range P N C group position. */
#define CTE_SCGRNGPNC0_bm  (1<<8)  /* Selfcap Global Range P N C bit 0 mask. */
#define CTE_SCGRNGPNC0_bp  8  /* Selfcap Global Range P N C bit 0 position. */
#define CTE_SCGRNGPNC1_bm  (1<<9)  /* Selfcap Global Range P N C bit 1 mask. */
#define CTE_SCGRNGPNC1_bp  9  /* Selfcap Global Range P N C bit 1 position. */
#define CTE_SCGRNGPNC2_bm  (1<<10)  /* Selfcap Global Range P N C bit 2 mask. */
#define CTE_SCGRNGPNC2_bp  10  /* Selfcap Global Range P N C bit 2 position. */

/* CTE.SCGRNGPP  bit masks and bit positions */
#define CTE_SCGRNGPPA_gm  0x07  /* Selfcap Global Range P P A group mask. */
#define CTE_SCGRNGPPA_gp  0  /* Selfcap Global Range P P A group position. */
#define CTE_SCGRNGPPA0_bm  (1<<0)  /* Selfcap Global Range P P A bit 0 mask. */
#define CTE_SCGRNGPPA0_bp  0  /* Selfcap Global Range P P A bit 0 position. */
#define CTE_SCGRNGPPA1_bm  (1<<1)  /* Selfcap Global Range P P A bit 1 mask. */
#define CTE_SCGRNGPPA1_bp  1  /* Selfcap Global Range P P A bit 1 position. */
#define CTE_SCGRNGPPA2_bm  (1<<2)  /* Selfcap Global Range P P A bit 2 mask. */
#define CTE_SCGRNGPPA2_bp  2  /* Selfcap Global Range P P A bit 2 position. */
#define CTE_SCGRNGPPB_gm  0x70  /* Selfcap Global Range P P B group mask. */
#define CTE_SCGRNGPPB_gp  4  /* Selfcap Global Range P P B group position. */
#define CTE_SCGRNGPPB0_bm  (1<<4)  /* Selfcap Global Range P P B bit 0 mask. */
#define CTE_SCGRNGPPB0_bp  4  /* Selfcap Global Range P P B bit 0 position. */
#define CTE_SCGRNGPPB1_bm  (1<<5)  /* Selfcap Global Range P P B bit 1 mask. */
#define CTE_SCGRNGPPB1_bp  5  /* Selfcap Global Range P P B bit 1 position. */
#define CTE_SCGRNGPPB2_bm  (1<<6)  /* Selfcap Global Range P P B bit 2 mask. */
#define CTE_SCGRNGPPB2_bp  6  /* Selfcap Global Range P P B bit 2 position. */
#define CTE_SCGRNGPPC_gm  0x700  /* Selfcap Global Range P P C group mask. */
#define CTE_SCGRNGPPC_gp  8  /* Selfcap Global Range P P C group position. */
#define CTE_SCGRNGPPC0_bm  (1<<8)  /* Selfcap Global Range P P C bit 0 mask. */
#define CTE_SCGRNGPPC0_bp  8  /* Selfcap Global Range P P C bit 0 position. */
#define CTE_SCGRNGPPC1_bm  (1<<9)  /* Selfcap Global Range P P C bit 1 mask. */
#define CTE_SCGRNGPPC1_bp  9  /* Selfcap Global Range P P C bit 1 position. */
#define CTE_SCGRNGPPC2_bm  (1<<10)  /* Selfcap Global Range P P C bit 2 mask. */
#define CTE_SCGRNGPPC2_bp  10  /* Selfcap Global Range P P C bit 2 position. */

