gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.INTGAIN4  bit masks and bit positions */
#define CTE_INT16GAIN_gm  0x0F  /* Integrator Gain 16 group mask. */
#define CTE_INT16GAIN_gp  0  /* Integrator Gain 16 group position. */
#define CTE_INT16GAIN0_bm  (1<<0)  /* Integrator Gain 16 bit 0 mask. */
#define CTE_INT16GAIN0_bp  0  /* Integrator Gain 16 bit 0 position. */
#define CTE_INT16GAIN1_bm  (1<<1)  /* Integrator Gain 16 bit 1 mask. */
#define CTE_INT16GAIN1_bp  1  /* Integrator Gain 16 bit 1 position. */
#define CTE_INT16GAIN2_bm  (1<<2)  /* Integrator Gain 16 bit 2 mask. */
#define CTE_INT16GAIN2_bp  2  /* Integrator Gain 16 bit 2 position. */
#define CTE_INT16GAIN3_bm  (1<<3)  /* Integrator Gain 16 bit 3 mask. */
#define CTE_INT16GAIN3_bp  3  /* Integrator Gain 16 bit 3 position. */
#define CTE_INT17GAIN_gm  0xF0  /* Integrator Gain 17 group mask. */
#define CTE_INT17GAIN_gp  4  /* Integrator Gain 17 group position. */
#define CTE_INT17GAIN0_bm  (1<<4)  /* Integrator Gain 17 bit 0 mask. */
#define CTE_INT17GAIN0_bp  4  /* Integrator Gain 17 bit 0 position. */
#define CTE_INT17GAIN1_bm  (1<<5)  /* Integrator Gain 17 bit 1 mask. */
#define CTE_INT17GAIN1_bp  5  /* Integrator Gain 17 bit 1 position. */
#define CTE_INT17GAIN2_bm  (1<<6)  /* Integrator Gain 17 bit 2 mask. */
#define CTE_INT17GAIN2_bp  6  /* Integrator Gain 17 bit 2 position. */
#define CTE_INT17GAIN3_bm  (1<<7)  /* Integrator Gain 17 bit 3 mask. */
#define CTE_INT17GAIN3_bp  7  /* Integrator Gain 17 bit 3 position. */

/* CTE.TIMACMP  bit masks and bit positions */
#define CTE_TIMACMP_gm  0x3FF  /* Timer A Compare group mask. */
#define CTE_TIMACMP_gp  0  /* Timer A Compare group position. */
#define CTE_TIMACMP0_bm  (1<<0)  /* Timer A Compare bit 0 mask. */
#define CTE_TIMACMP0_bp  0  /* Timer A Compare bit 0 position. */
#define CTE_TIMACMP1_bm  (1<<1)  /* Timer A Compare bit 1 mask. */
#define CTE_TIMACMP1_bp  1  /* Timer A Compare bit 1 position. */
#define CTE_TIMACMP2_bm  (1<<2)  /* Timer A Compare bit 2 mask. */
#define CTE_TIMACMP2_bp  2  /* Timer A Compare bit 2 position. */
#define CTE_TIMACMP3_bm  (1<<3)  /* Timer A Compare bit 3 mask. */
#define CTE_TIMACMP3_bp  3  /* Timer A Compare bit 3 position. */
#define CTE_TIMACMP4_bm  (1<<4)  /* Timer A Compare bit 4 mask. */
#define CTE_TIMACMP4_bp  4  /* Timer A Compare bit 4 position. */
#define CTE_TIMACMP5_bm  (1<<5)  /* Timer A Compare bit 5 mask. */
#define CTE_TIMACMP5_bp  5  /* Timer A Compare bit 5 position. */
#define CTE_TIMACMP6_bm  (1<<6)  /* Timer A Compare bit 6 mask. */
#define CTE_TIMACMP6_bp  6  /* Timer A Compare bit 6 position. */
#define CTE_TIMACMP7_bm  (1<<7)  /* Timer A Compare bit 7 mask. */
#define CTE_TIMACMP7_bp  7  /* Timer A Compare bit 7 position. */
#define CTE_TIMACMP8_bm  (1<<8)  /* Timer A Compare bit 8 mask. */
#define CTE_TIMACMP8_bp  8  /* Timer A Compare bit 8 position. */
#define CTE_TIMACMP9_bm  (1<<9)  /* Timer A Compare bit 9 mask. */
#define CTE_TIMACMP9_bp  9  /* Timer A Compare bit 9 position. */

/* CTE.TIMBCMP  bit masks and bit positions */
#define CTE_TIMBCMP_gm  0x3FF  /* Timer B Compare group mask. */
#define CTE_TIMBCMP_gp  0  /* Timer B Compare group position. */
#define CTE_TIMBCMP0_bm  (1<<0)  /* Timer B Compare bit 0 mask. */
#define CTE_TIMBCMP0_bp  0  /* Timer B Compare bit 0 position. */
#define CTE_TIMBCMP1_bm  (1<<1)  /* Timer B Compare bit 1 mask. */
#define CTE_TIMBCMP1_bp  1  /* Timer B Compare bit 1 position. */
#define CTE_TIMBCMP2_bm  (1<<2)  /* Timer B Compare bit 2 mask. */
#define CTE_TIMBCMP2_bp  2  /* Timer B Compare bit 2 position. */
#define CTE_TIMBCMP3_bm  (1<<3)  /* Timer B Compare bit 3 mask. */
#define CTE_TIMBCMP3_bp  3  /* Timer B Compare bit 3 position. */
#define CTE_TIMBCMP4_bm  (1<<4)  /* Timer B Compare bit 4 mask. */
#define CTE_TIMBCMP4_bp  4  /* Timer B Compare bit 4 position. */
#define CTE_TIMBCMP5_bm  (1<<5)  /* Timer B Compare bit 5 mask. */
#define CTE_TIMBCMP5_bp  5  /* Timer B Compare bit 5 position. */
#define CTE_TIMBCMP6_bm  (1<<6)  /* Timer B Compare bit 6 mask. */
#define CTE_TIMBCMP6_bp  6  /* Timer B Compare bit 6 position. */
#define CTE_TIMBCMP7_bm  (1<<7)  /* Timer B Compare bit 7 mask. */
#define CTE_TIMBCMP7_bp  7  /* Timer B Compare bit 7 position. */
#define CTE_TIMBCMP8_bm  (1<<8)  /* Timer B Compare bit 8 mask. */
#define CTE_TIMBCMP8_bp  8  /* Timer B Compare bit 8 position. */
#define CTE_TIMBCMP9_bm  (1<<9)  /* Timer B Compare bit 9 mask. */
#define CTE_TIMBCMP9_bp  9  /* Timer B Compare bit 9 position. */

/* CTE.PADYCHCOMPA  bit masks and bit positions */
#define CTE_PADYCHCOMP_gm  0xFFFF  /* Enable the selfcap current source at pad_ichargecomp group mask. */
#define CTE_PADYCHCOMP_gp  0  /* Enable the selfcap current source at pad_ichargecomp group position. */
#define CTE_PADYCHCOMP0_bm  (1<<0)  /* Enable the selfcap current source at pad_ichargecomp bit 0 mask. */
#define CTE_PADYCHCOMP0_bp  0  /* Enable the selfcap current source at pad_ichargecomp bit 0 position. */
#define CTE_PADYCHCOMP1_bm  (1<<1)  /* Enable the selfcap current source at pad_ichargecomp bit 1 mask. */
#define CTE_PADYCHCOMP1_bp  1  /* Enable the selfcap current source at pad_ichargecomp bit 1 position. */
#define CTE_PADYCHCOMP2_bm  (1<<2)  /* Enable the selfcap current source at pad_ichargecomp bit 2 mask. */
#define CTE_PADYCHCOMP2_bp  2  /* Enable the selfcap current source at pad_ichargecomp bit 2 position. */
#define CTE_PADYCHCOMP3_bm  (1<<3)  /* Enable the selfcap current source at pad_ichargecomp bit 3 mask. */
#define CTE_PADYCHCOMP3_bp  3  /* Enable the selfcap current source at pad_ichargecomp bit 3 position. */
#define CTE_PADYCHCOMP4_bm  (1<<4)  /* Enable the selfcap current source at pad_ichargecomp bit 4 mask. */
#define CTE_PADYCHCOMP4_bp  4  /* Enable the selfcap current source at pad_ichargecomp bit 4 position. */
#define CTE_PADYCHCOMP5_bm  (1<<5)  /* Enable the selfcap current source at pad_ichargecomp bit 5 mask. */
#define CTE_PADYCHCOMP5_bp  5  /* Enable the selfcap current source at pad_ichargecomp bit 5 position. */
#define CTE_PADYCHCOMP6_bm  (1<<6)  /* Enable the selfcap current source at pad_ichargecomp bit 6 mask. */
#define CTE_PADYCHCOMP6_bp  6  /* Enable the selfcap current source at pad_ichargecomp bit 6 position. */
#define CTE_PADYCHCOMP7_bm  (1<<7)  /* Enable the selfcap current source at pad_ichargecomp bit 7 mask. */
#define CTE_PADYCHCOMP7_bp  7  /* Enable the selfcap current source at pad_ichargecomp bit 7 position. */
#define CTE_PADYCHCOMP8_bm  (1<<8)  /* Enable the selfcap current source at pad_ichargecomp bit 8 mask. */
#define CTE_PADYCHCOMP8_bp  8  /* Enable the selfcap current source at pad_ichargecomp bit 8 position. */
#define CTE_PADYCHCOMP9_bm  (1<<9)  /* Enable the selfcap current source at pad_ichargecomp bit 9 mask. */
#define CTE_PADYCHCOMP9_bp  9  /* Enable the selfcap current source at pad_ichargecomp bit 9 position. */
#define CTE_PADYCHCOMP10_bm  (1<<10)  /* Enable the selfcap current source at pad_ichargecomp bit 10 mask. */
#define CTE_PADYCHCOMP10_bp  10  /* Enable the selfcap current source at pad_ichargecomp bit 10 position. */
#define CTE_PADYCHCOMP11_bm  (1<<11)  /* Enable the selfcap current source at pad_ichargecomp bit 11 mask. */
#define CTE_PADYCHCOMP11_bp  11  /* Enable the selfcap current source at pad_ichargecomp bit 11 position. */
#define CTE_PADYCHCOMP12_bm  (1<<12)  /* Enable the selfcap current source at pad_ichargecomp bit 12 mask. */
#define CTE_PADYCHCOMP12_bp  12  /* Enable the selfcap current source at pad_ichargecomp bit 12 position. */
#define CTE_PADYCHCOMP13_bm  (1<<13)  /* Enable the selfcap current source at pad_ichargecomp bit 13 mask. */
#define CTE_PADYCHCOMP13_bp  13  /* Enable the selfcap current source at pad_ichargecomp bit 13 position. */
#define CTE_PADYCHCOMP14_bm  (1<<14)  /* Enable the selfcap current source at pad_ichargecomp bit 14 mask. */
#define CTE_PADYCHCOMP14_bp  14  /* Enable the selfcap current source at pad_ichargecomp bit 14 position. */
#define CTE_PADYCHCOMP15_bm  (1<<15)  /* Enable the selfcap current source at pad_ichargecomp bit 15 mask. */
#define CTE_PADYCHCOMP15_bp  15  /* Enable the selfcap current source at pad_ichargecomp bit 15 position. */

