gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADSCMEYA  bit masks and bit positions */
#define CTE_PADSCMEY_gm  0xFFFF  /* Pad Self Cap Master Enable Y group mask. */
#define CTE_PADSCMEY_gp  0  /* Pad Self Cap Master Enable Y group position. */
#define CTE_PADSCMEY0_bm  (1<<0)  /* Pad Self Cap Master Enable Y bit 0 mask. */
#define CTE_PADSCMEY0_bp  0  /* Pad Self Cap Master Enable Y bit 0 position. */
#define CTE_PADSCMEY1_bm  (1<<1)  /* Pad Self Cap Master Enable Y bit 1 mask. */
#define CTE_PADSCMEY1_bp  1  /* Pad Self Cap Master Enable Y bit 1 position. */
#define CTE_PADSCMEY2_bm  (1<<2)  /* Pad Self Cap Master Enable Y bit 2 mask. */
#define CTE_PADSCMEY2_bp  2  /* Pad Self Cap Master Enable Y bit 2 position. */
#define CTE_PADSCMEY3_bm  (1<<3)  /* Pad Self Cap Master Enable Y bit 3 mask. */
#define CTE_PADSCMEY3_bp  3  /* Pad Self Cap Master Enable Y bit 3 position. */
#define CTE_PADSCMEY4_bm  (1<<4)  /* Pad Self Cap Master Enable Y bit 4 mask. */
#define CTE_PADSCMEY4_bp  4  /* Pad Self Cap Master Enable Y bit 4 position. */
#define CTE_PADSCMEY5_bm  (1<<5)  /* Pad Self Cap Master Enable Y bit 5 mask. */
#define CTE_PADSCMEY5_bp  5  /* Pad Self Cap Master Enable Y bit 5 position. */
#define CTE_PADSCMEY6_bm  (1<<6)  /* Pad Self Cap Master Enable Y bit 6 mask. */
#define CTE_PADSCMEY6_bp  6  /* Pad Self Cap Master Enable Y bit 6 position. */
#define CTE_PADSCMEY7_bm  (1<<7)  /* Pad Self Cap Master Enable Y bit 7 mask. */
#define CTE_PADSCMEY7_bp  7  /* Pad Self Cap Master Enable Y bit 7 position. */
#define CTE_PADSCMEY8_bm  (1<<8)  /* Pad Self Cap Master Enable Y bit 8 mask. */
#define CTE_PADSCMEY8_bp  8  /* Pad Self Cap Master Enable Y bit 8 position. */
#define CTE_PADSCMEY9_bm  (1<<9)  /* Pad Self Cap Master Enable Y bit 9 mask. */
#define CTE_PADSCMEY9_bp  9  /* Pad Self Cap Master Enable Y bit 9 position. */
#define CTE_PADSCMEY10_bm  (1<<10)  /* Pad Self Cap Master Enable Y bit 10 mask. */
#define CTE_PADSCMEY10_bp  10  /* Pad Self Cap Master Enable Y bit 10 position. */
#define CTE_PADSCMEY11_bm  (1<<11)  /* Pad Self Cap Master Enable Y bit 11 mask. */
#define CTE_PADSCMEY11_bp  11  /* Pad Self Cap Master Enable Y bit 11 position. */
#define CTE_PADSCMEY12_bm  (1<<12)  /* Pad Self Cap Master Enable Y bit 12 mask. */
#define CTE_PADSCMEY12_bp  12  /* Pad Self Cap Master Enable Y bit 12 position. */
#define CTE_PADSCMEY13_bm  (1<<13)  /* Pad Self Cap Master Enable Y bit 13 mask. */
#define CTE_PADSCMEY13_bp  13  /* Pad Self Cap Master Enable Y bit 13 position. */
#define CTE_PADSCMEY14_bm  (1<<14)  /* Pad Self Cap Master Enable Y bit 14 mask. */
#define CTE_PADSCMEY14_bp  14  /* Pad Self Cap Master Enable Y bit 14 position. */
#define CTE_PADSCMEY15_bm  (1<<15)  /* Pad Self Cap Master Enable Y bit 15 mask. */
#define CTE_PADSCMEY15_bp  15  /* Pad Self Cap Master Enable Y bit 15 position. */

/* CTE.PADSCMEYB  bit masks and bit positions */
/* CTE_PADSCMEY  is already defined. */

/* CTE.PADYONXENA  bit masks and bit positions */
#define CTE_PADYONXEN_gm  0xFFFF  /* Pad YonX Enable group mask. */
#define CTE_PADYONXEN_gp  0  /* Pad YonX Enable group position. */
#define CTE_PADYONXEN0_bm  (1<<0)  /* Pad YonX Enable bit 0 mask. */
#define CTE_PADYONXEN0_bp  0  /* Pad YonX Enable bit 0 position. */
#define CTE_PADYONXEN1_bm  (1<<1)  /* Pad YonX Enable bit 1 mask. */
#define CTE_PADYONXEN1_bp  1  /* Pad YonX Enable bit 1 position. */
#define CTE_PADYONXEN2_bm  (1<<2)  /* Pad YonX Enable bit 2 mask. */
#define CTE_PADYONXEN2_bp  2  /* Pad YonX Enable bit 2 position. */
#define CTE_PADYONXEN3_bm  (1<<3)  /* Pad YonX Enable bit 3 mask. */
#define CTE_PADYONXEN3_bp  3  /* Pad YonX Enable bit 3 position. */
#define CTE_PADYONXEN4_bm  (1<<4)  /* Pad YonX Enable bit 4 mask. */
#define CTE_PADYONXEN4_bp  4  /* Pad YonX Enable bit 4 position. */
#define CTE_PADYONXEN5_bm  (1<<5)  /* Pad YonX Enable bit 5 mask. */
#define CTE_PADYONXEN5_bp  5  /* Pad YonX Enable bit 5 position. */
#define CTE_PADYONXEN6_bm  (1<<6)  /* Pad YonX Enable bit 6 mask. */
#define CTE_PADYONXEN6_bp  6  /* Pad YonX Enable bit 6 position. */
#define CTE_PADYONXEN7_bm  (1<<7)  /* Pad YonX Enable bit 7 mask. */
#define CTE_PADYONXEN7_bp  7  /* Pad YonX Enable bit 7 position. */
#define CTE_PADYONXEN8_bm  (1<<8)  /* Pad YonX Enable bit 8 mask. */
#define CTE_PADYONXEN8_bp  8  /* Pad YonX Enable bit 8 position. */
#define CTE_PADYONXEN9_bm  (1<<9)  /* Pad YonX Enable bit 9 mask. */
#define CTE_PADYONXEN9_bp  9  /* Pad YonX Enable bit 9 position. */
#define CTE_PADYONXEN10_bm  (1<<10)  /* Pad YonX Enable bit 10 mask. */
#define CTE_PADYONXEN10_bp  10  /* Pad YonX Enable bit 10 position. */
#define CTE_PADYONXEN11_bm  (1<<11)  /* Pad YonX Enable bit 11 mask. */
#define CTE_PADYONXEN11_bp  11  /* Pad YonX Enable bit 11 position. */
#define CTE_PADYONXEN12_bm  (1<<12)  /* Pad YonX Enable bit 12 mask. */
#define CTE_PADYONXEN12_bp  12  /* Pad YonX Enable bit 12 position. */
#define CTE_PADYONXEN13_bm  (1<<13)  /* Pad YonX Enable bit 13 mask. */
#define CTE_PADYONXEN13_bp  13  /* Pad YonX Enable bit 13 position. */
#define CTE_PADYONXEN14_bm  (1<<14)  /* Pad YonX Enable bit 14 mask. */
#define CTE_PADYONXEN14_bp  14  /* Pad YonX Enable bit 14 position. */
#define CTE_PADYONXEN15_bm  (1<<15)  /* Pad YonX Enable bit 15 mask. */
#define CTE_PADYONXEN15_bp  15  /* Pad YonX Enable bit 15 position. */

/* CTE.PADYONXENB  bit masks and bit positions */
/* CTE_PADYONXEN  is already defined. */

/* CTE.PADXONXENA  bit masks and bit positions */
#define CTE_PADXONXEN_gm  0xFFFF  /* Pad XonX Enable group mask. */
#define CTE_PADXONXEN_gp  0  /* Pad XonX Enable group position. */
#define CTE_PADXONXEN0_bm  (1<<0)  /* Pad XonX Enable bit 0 mask. */
#define CTE_PADXONXEN0_bp  0  /* Pad XonX Enable bit 0 position. */
#define CTE_PADXONXEN1_bm  (1<<1)  /* Pad XonX Enable bit 1 mask. */
#define CTE_PADXONXEN1_bp  1  /* Pad XonX Enable bit 1 position. */
#define CTE_PADXONXEN2_bm  (1<<2)  /* Pad XonX Enable bit 2 mask. */
#define CTE_PADXONXEN2_bp  2  /* Pad XonX Enable bit 2 position. */
#define CTE_PADXONXEN3_bm  (1<<3)  /* Pad XonX Enable bit 3 mask. */
#define CTE_PADXONXEN3_bp  3  /* Pad XonX Enable bit 3 position. */
#define CTE_PADXONXEN4_bm  (1<<4)  /* Pad XonX Enable bit 4 mask. */
#define CTE_PADXONXEN4_bp  4  /* Pad XonX Enable bit 4 position. */
#define CTE_PADXONXEN5_bm  (1<<5)  /* Pad XonX Enable bit 5 mask. */
#define CTE_PADXONXEN5_bp  5  /* Pad XonX Enable bit 5 position. */
#define CTE_PADXONXEN6_bm  (1<<6)  /* Pad XonX Enable bit 6 mask. */
#define CTE_PADXONXEN6_bp  6  /* Pad XonX Enable bit 6 position. */
#define CTE_PADXONXEN7_bm  (1<<7)  /* Pad XonX Enable bit 7 mask. */
#define CTE_PADXONXEN7_bp  7  /* Pad XonX Enable bit 7 position. */
#define CTE_PADXONXEN8_bm  (1<<8)  /* Pad XonX Enable bit 8 mask. */
#define CTE_PADXONXEN8_bp  8  /* Pad XonX Enable bit 8 position. */
#define CTE_PADXONXEN9_bm  (1<<9)  /* Pad XonX Enable bit 9 mask. */
#define CTE_PADXONXEN9_bp  9  /* Pad XonX Enable bit 9 position. */
#define CTE_PADXONXEN10_bm  (1<<10)  /* Pad XonX Enable bit 10 mask. */
#define CTE_PADXONXEN10_bp  10  /* Pad XonX Enable bit 10 position. */
#define CTE_PADXONXEN11_bm  (1<<11)  /* Pad XonX Enable bit 11 mask. */
#define CTE_PADXONXEN11_bp  11  /* Pad XonX Enable bit 11 position. */
#define CTE_PADXONXEN12_bm  (1<<12)  /* Pad XonX Enable bit 12 mask. */
#define CTE_PADXONXEN12_bp  12  /* Pad XonX Enable bit 12 position. */
#define CTE_PADXONXEN13_bm  (1<<13)  /* Pad XonX Enable bit 13 mask. */
#define CTE_PADXONXEN13_bp  13  /* Pad XonX Enable bit 13 position. */
#define CTE_PADXONXEN14_bm  (1<<14)  /* Pad XonX Enable bit 14 mask. */
#define CTE_PADXONXEN14_bp  14  /* Pad XonX Enable bit 14 position. */
#define CTE_PADXONXEN15_bm  (1<<15)  /* Pad XonX Enable bit 15 mask. */
#define CTE_PADXONXEN15_bp  15  /* Pad XonX Enable bit 15 position. */

/* CTE.PADXONXENB  bit masks and bit positions */
/* CTE_PADXONXEN  is already defined. */

/* CTE.PADYONYENA  bit masks and bit positions */
#define CTE_PADYONYEN_gm  0xFFFF  /* Pad YonY Enable group mask. */
#define CTE_PADYONYEN_gp  0  /* Pad YonY Enable group position. */
#define CTE_PADYONYEN0_bm  (1<<0)  /* Pad YonY Enable bit 0 mask. */
#define CTE_PADYONYEN0_bp  0  /* Pad YonY Enable bit 0 position. */
#define CTE_PADYONYEN1_bm  (1<<1)  /* Pad YonY Enable bit 1 mask. */
#define CTE_PADYONYEN1_bp  1  /* Pad YonY Enable bit 1 position. */
#define CTE_PADYONYEN2_bm  (1<<2)  /* Pad YonY Enable bit 2 mask. */
#define CTE_PADYONYEN2_bp  2  /* Pad YonY Enable bit 2 position. */
#define CTE_PADYONYEN3_bm  (1<<3)  /* Pad YonY Enable bit 3 mask. */
#define CTE_PADYONYEN3_bp  3  /* Pad YonY Enable bit 3 position. */
#define CTE_PADYONYEN4_bm  (1<<4)  /* Pad YonY Enable bit 4 mask. */
#define CTE_PADYONYEN4_bp  4  /* Pad YonY Enable bit 4 position. */
#define CTE_PADYONYEN5_bm  (1<<5)  /* Pad YonY Enable bit 5 mask. */
#define CTE_PADYONYEN5_bp  5  /* Pad YonY Enable bit 5 position. */
#define CTE_PADYONYEN6_bm  (1<<6)  /* Pad YonY Enable bit 6 mask. */
#define CTE_PADYONYEN6_bp  6  /* Pad YonY Enable bit 6 position. */
#define CTE_PADYONYEN7_bm  (1<<7)  /* Pad YonY Enable bit 7 mask. */
#define CTE_PADYONYEN7_bp  7  /* Pad YonY Enable bit 7 position. */
#define CTE_PADYONYEN8_bm  (1<<8)  /* Pad YonY Enable bit 8 mask. */
#define CTE_PADYONYEN8_bp  8  /* Pad YonY Enable bit 8 position. */
#define CTE_PADYONYEN9_bm  (1<<9)  /* Pad YonY Enable bit 9 mask. */
#define CTE_PADYONYEN9_bp  9  /* Pad YonY Enable bit 9 position. */
#define CTE_PADYONYEN10_bm  (1<<10)  /* Pad YonY Enable bit 10 mask. */
#define CTE_PADYONYEN10_bp  10  /* Pad YonY Enable bit 10 position. */
#define CTE_PADYONYEN11_bm  (1<<11)  /* Pad YonY Enable bit 11 mask. */
#define CTE_PADYONYEN11_bp  11  /* Pad YonY Enable bit 11 position. */
#define CTE_PADYONYEN12_bm  (1<<12)  /* Pad YonY Enable bit 12 mask. */
#define CTE_PADYONYEN12_bp  12  /* Pad YonY Enable bit 12 position. */
#define CTE_PADYONYEN13_bm  (1<<13)  /* Pad YonY Enable bit 13 mask. */
#define CTE_PADYONYEN13_bp  13  /* Pad YonY Enable bit 13 position. */
#define CTE_PADYONYEN14_bm  (1<<14)  /* Pad YonY Enable bit 14 mask. */
#define CTE_PADYONYEN14_bp  14  /* Pad YonY Enable bit 14 position. */
#define CTE_PADYONYEN15_bm  (1<<15)  /* Pad YonY Enable bit 15 mask. */
#define CTE_PADYONYEN15_bp  15  /* Pad YonY Enable bit 15 position. */

/* CTE.PADYONYENB  bit masks and bit positions */
/* CTE_PADYONYEN  is already defined. */

