gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADPROXENXA  bit masks and bit positions */
#define CTE_PADPROXENX_gm  0xFFFF  /* Pad Proximity Enable X group mask. */
#define CTE_PADPROXENX_gp  0  /* Pad Proximity Enable X group position. */
#define CTE_PADPROXENX0_bm  (1<<0)  /* Pad Proximity Enable X bit 0 mask. */
#define CTE_PADPROXENX0_bp  0  /* Pad Proximity Enable X bit 0 position. */
#define CTE_PADPROXENX1_bm  (1<<1)  /* Pad Proximity Enable X bit 1 mask. */
#define CTE_PADPROXENX1_bp  1  /* Pad Proximity Enable X bit 1 position. */
#define CTE_PADPROXENX2_bm  (1<<2)  /* Pad Proximity Enable X bit 2 mask. */
#define CTE_PADPROXENX2_bp  2  /* Pad Proximity Enable X bit 2 position. */
#define CTE_PADPROXENX3_bm  (1<<3)  /* Pad Proximity Enable X bit 3 mask. */
#define CTE_PADPROXENX3_bp  3  /* Pad Proximity Enable X bit 3 position. */
#define CTE_PADPROXENX4_bm  (1<<4)  /* Pad Proximity Enable X bit 4 mask. */
#define CTE_PADPROXENX4_bp  4  /* Pad Proximity Enable X bit 4 position. */
#define CTE_PADPROXENX5_bm  (1<<5)  /* Pad Proximity Enable X bit 5 mask. */
#define CTE_PADPROXENX5_bp  5  /* Pad Proximity Enable X bit 5 position. */
#define CTE_PADPROXENX6_bm  (1<<6)  /* Pad Proximity Enable X bit 6 mask. */
#define CTE_PADPROXENX6_bp  6  /* Pad Proximity Enable X bit 6 position. */
#define CTE_PADPROXENX7_bm  (1<<7)  /* Pad Proximity Enable X bit 7 mask. */
#define CTE_PADPROXENX7_bp  7  /* Pad Proximity Enable X bit 7 position. */
#define CTE_PADPROXENX8_bm  (1<<8)  /* Pad Proximity Enable X bit 8 mask. */
#define CTE_PADPROXENX8_bp  8  /* Pad Proximity Enable X bit 8 position. */
#define CTE_PADPROXENX9_bm  (1<<9)  /* Pad Proximity Enable X bit 9 mask. */
#define CTE_PADPROXENX9_bp  9  /* Pad Proximity Enable X bit 9 position. */
#define CTE_PADPROXENX10_bm  (1<<10)  /* Pad Proximity Enable X bit 10 mask. */
#define CTE_PADPROXENX10_bp  10  /* Pad Proximity Enable X bit 10 position. */
#define CTE_PADPROXENX11_bm  (1<<11)  /* Pad Proximity Enable X bit 11 mask. */
#define CTE_PADPROXENX11_bp  11  /* Pad Proximity Enable X bit 11 position. */
#define CTE_PADPROXENX12_bm  (1<<12)  /* Pad Proximity Enable X bit 12 mask. */
#define CTE_PADPROXENX12_bp  12  /* Pad Proximity Enable X bit 12 position. */
#define CTE_PADPROXENX13_bm  (1<<13)  /* Pad Proximity Enable X bit 13 mask. */
#define CTE_PADPROXENX13_bp  13  /* Pad Proximity Enable X bit 13 position. */
#define CTE_PADPROXENX14_bm  (1<<14)  /* Pad Proximity Enable X bit 14 mask. */
#define CTE_PADPROXENX14_bp  14  /* Pad Proximity Enable X bit 14 position. */
#define CTE_PADPROXENX15_bm  (1<<15)  /* Pad Proximity Enable X bit 15 mask. */
#define CTE_PADPROXENX15_bp  15  /* Pad Proximity Enable X bit 15 position. */

/* CTE.PADPROXENXB  bit masks and bit positions */
/* CTE_PADPROXENX  is already defined. */

/* CTE.PADPROXENYA  bit masks and bit positions */
#define CTE_PADPROXENY_gm  0xFFFF  /* Pad Proximity Enable Y group mask. */
#define CTE_PADPROXENY_gp  0  /* Pad Proximity Enable Y group position. */
#define CTE_PADPROXENY0_bm  (1<<0)  /* Pad Proximity Enable Y bit 0 mask. */
#define CTE_PADPROXENY0_bp  0  /* Pad Proximity Enable Y bit 0 position. */
#define CTE_PADPROXENY1_bm  (1<<1)  /* Pad Proximity Enable Y bit 1 mask. */
#define CTE_PADPROXENY1_bp  1  /* Pad Proximity Enable Y bit 1 position. */
#define CTE_PADPROXENY2_bm  (1<<2)  /* Pad Proximity Enable Y bit 2 mask. */
#define CTE_PADPROXENY2_bp  2  /* Pad Proximity Enable Y bit 2 position. */
#define CTE_PADPROXENY3_bm  (1<<3)  /* Pad Proximity Enable Y bit 3 mask. */
#define CTE_PADPROXENY3_bp  3  /* Pad Proximity Enable Y bit 3 position. */
#define CTE_PADPROXENY4_bm  (1<<4)  /* Pad Proximity Enable Y bit 4 mask. */
#define CTE_PADPROXENY4_bp  4  /* Pad Proximity Enable Y bit 4 position. */
#define CTE_PADPROXENY5_bm  (1<<5)  /* Pad Proximity Enable Y bit 5 mask. */
#define CTE_PADPROXENY5_bp  5  /* Pad Proximity Enable Y bit 5 position. */
#define CTE_PADPROXENY6_bm  (1<<6)  /* Pad Proximity Enable Y bit 6 mask. */
#define CTE_PADPROXENY6_bp  6  /* Pad Proximity Enable Y bit 6 position. */
#define CTE_PADPROXENY7_bm  (1<<7)  /* Pad Proximity Enable Y bit 7 mask. */
#define CTE_PADPROXENY7_bp  7  /* Pad Proximity Enable Y bit 7 position. */
#define CTE_PADPROXENY8_bm  (1<<8)  /* Pad Proximity Enable Y bit 8 mask. */
#define CTE_PADPROXENY8_bp  8  /* Pad Proximity Enable Y bit 8 position. */
#define CTE_PADPROXENY9_bm  (1<<9)  /* Pad Proximity Enable Y bit 9 mask. */
#define CTE_PADPROXENY9_bp  9  /* Pad Proximity Enable Y bit 9 position. */
#define CTE_PADPROXENY10_bm  (1<<10)  /* Pad Proximity Enable Y bit 10 mask. */
#define CTE_PADPROXENY10_bp  10  /* Pad Proximity Enable Y bit 10 position. */
#define CTE_PADPROXENY11_bm  (1<<11)  /* Pad Proximity Enable Y bit 11 mask. */
#define CTE_PADPROXENY11_bp  11  /* Pad Proximity Enable Y bit 11 position. */
#define CTE_PADPROXENY12_bm  (1<<12)  /* Pad Proximity Enable Y bit 12 mask. */
#define CTE_PADPROXENY12_bp  12  /* Pad Proximity Enable Y bit 12 position. */
#define CTE_PADPROXENY13_bm  (1<<13)  /* Pad Proximity Enable Y bit 13 mask. */
#define CTE_PADPROXENY13_bp  13  /* Pad Proximity Enable Y bit 13 position. */
#define CTE_PADPROXENY14_bm  (1<<14)  /* Pad Proximity Enable Y bit 14 mask. */
#define CTE_PADPROXENY14_bp  14  /* Pad Proximity Enable Y bit 14 position. */
#define CTE_PADPROXENY15_bm  (1<<15)  /* Pad Proximity Enable Y bit 15 mask. */
#define CTE_PADPROXENY15_bp  15  /* Pad Proximity Enable Y bit 15 position. */

/* CTE.PADPROXENYB  bit masks and bit positions */
/* CTE_PADPROXENY  is already defined. */

/* CTE.PADYRESENA  bit masks and bit positions */
#define CTE_PADYRESEN_gm  0xFFFF  /* Pad yres Enable group mask. */
#define CTE_PADYRESEN_gp  0  /* Pad yres Enable group position. */
#define CTE_PADYRESEN0_bm  (1<<0)  /* Pad yres Enable bit 0 mask. */
#define CTE_PADYRESEN0_bp  0  /* Pad yres Enable bit 0 position. */
#define CTE_PADYRESEN1_bm  (1<<1)  /* Pad yres Enable bit 1 mask. */
#define CTE_PADYRESEN1_bp  1  /* Pad yres Enable bit 1 position. */
#define CTE_PADYRESEN2_bm  (1<<2)  /* Pad yres Enable bit 2 mask. */
#define CTE_PADYRESEN2_bp  2  /* Pad yres Enable bit 2 position. */
#define CTE_PADYRESEN3_bm  (1<<3)  /* Pad yres Enable bit 3 mask. */
#define CTE_PADYRESEN3_bp  3  /* Pad yres Enable bit 3 position. */
#define CTE_PADYRESEN4_bm  (1<<4)  /* Pad yres Enable bit 4 mask. */
#define CTE_PADYRESEN4_bp  4  /* Pad yres Enable bit 4 position. */
#define CTE_PADYRESEN5_bm  (1<<5)  /* Pad yres Enable bit 5 mask. */
#define CTE_PADYRESEN5_bp  5  /* Pad yres Enable bit 5 position. */
#define CTE_PADYRESEN6_bm  (1<<6)  /* Pad yres Enable bit 6 mask. */
#define CTE_PADYRESEN6_bp  6  /* Pad yres Enable bit 6 position. */
#define CTE_PADYRESEN7_bm  (1<<7)  /* Pad yres Enable bit 7 mask. */
#define CTE_PADYRESEN7_bp  7  /* Pad yres Enable bit 7 position. */
#define CTE_PADYRESEN8_bm  (1<<8)  /* Pad yres Enable bit 8 mask. */
#define CTE_PADYRESEN8_bp  8  /* Pad yres Enable bit 8 position. */
#define CTE_PADYRESEN9_bm  (1<<9)  /* Pad yres Enable bit 9 mask. */
#define CTE_PADYRESEN9_bp  9  /* Pad yres Enable bit 9 position. */
#define CTE_PADYRESEN10_bm  (1<<10)  /* Pad yres Enable bit 10 mask. */
#define CTE_PADYRESEN10_bp  10  /* Pad yres Enable bit 10 position. */
#define CTE_PADYRESEN11_bm  (1<<11)  /* Pad yres Enable bit 11 mask. */
#define CTE_PADYRESEN11_bp  11  /* Pad yres Enable bit 11 position. */
#define CTE_PADYRESEN12_bm  (1<<12)  /* Pad yres Enable bit 12 mask. */
#define CTE_PADYRESEN12_bp  12  /* Pad yres Enable bit 12 position. */
#define CTE_PADYRESEN13_bm  (1<<13)  /* Pad yres Enable bit 13 mask. */
#define CTE_PADYRESEN13_bp  13  /* Pad yres Enable bit 13 position. */
#define CTE_PADYRESEN14_bm  (1<<14)  /* Pad yres Enable bit 14 mask. */
#define CTE_PADYRESEN14_bp  14  /* Pad yres Enable bit 14 position. */
#define CTE_PADYRESEN15_bm  (1<<15)  /* Pad yres Enable bit 15 mask. */
#define CTE_PADYRESEN15_bp  15  /* Pad yres Enable bit 15 position. */

/* CTE.PADYRESENB  bit masks and bit positions */
/* CTE_PADYRESEN  is already defined. */

/* CTE.PADSCICALENA  bit masks and bit positions */
#define CTE_PADSCICALEN_gm  0xFFFF  /* Pad sc ical Enable group mask. */
#define CTE_PADSCICALEN_gp  0  /* Pad sc ical Enable group position. */
#define CTE_PADSCICALEN0_bm  (1<<0)  /* Pad sc ical Enable bit 0 mask. */
#define CTE_PADSCICALEN0_bp  0  /* Pad sc ical Enable bit 0 position. */
#define CTE_PADSCICALEN1_bm  (1<<1)  /* Pad sc ical Enable bit 1 mask. */
#define CTE_PADSCICALEN1_bp  1  /* Pad sc ical Enable bit 1 position. */
#define CTE_PADSCICALEN2_bm  (1<<2)  /* Pad sc ical Enable bit 2 mask. */
#define CTE_PADSCICALEN2_bp  2  /* Pad sc ical Enable bit 2 position. */
#define CTE_PADSCICALEN3_bm  (1<<3)  /* Pad sc ical Enable bit 3 mask. */
#define CTE_PADSCICALEN3_bp  3  /* Pad sc ical Enable bit 3 position. */
#define CTE_PADSCICALEN4_bm  (1<<4)  /* Pad sc ical Enable bit 4 mask. */
#define CTE_PADSCICALEN4_bp  4  /* Pad sc ical Enable bit 4 position. */
#define CTE_PADSCICALEN5_bm  (1<<5)  /* Pad sc ical Enable bit 5 mask. */
#define CTE_PADSCICALEN5_bp  5  /* Pad sc ical Enable bit 5 position. */
#define CTE_PADSCICALEN6_bm  (1<<6)  /* Pad sc ical Enable bit 6 mask. */
#define CTE_PADSCICALEN6_bp  6  /* Pad sc ical Enable bit 6 position. */
#define CTE_PADSCICALEN7_bm  (1<<7)  /* Pad sc ical Enable bit 7 mask. */
#define CTE_PADSCICALEN7_bp  7  /* Pad sc ical Enable bit 7 position. */
#define CTE_PADSCICALEN8_bm  (1<<8)  /* Pad sc ical Enable bit 8 mask. */
#define CTE_PADSCICALEN8_bp  8  /* Pad sc ical Enable bit 8 position. */
#define CTE_PADSCICALEN9_bm  (1<<9)  /* Pad sc ical Enable bit 9 mask. */
#define CTE_PADSCICALEN9_bp  9  /* Pad sc ical Enable bit 9 position. */
#define CTE_PADSCICALEN10_bm  (1<<10)  /* Pad sc ical Enable bit 10 mask. */
#define CTE_PADSCICALEN10_bp  10  /* Pad sc ical Enable bit 10 position. */
#define CTE_PADSCICALEN11_bm  (1<<11)  /* Pad sc ical Enable bit 11 mask. */
#define CTE_PADSCICALEN11_bp  11  /* Pad sc ical Enable bit 11 position. */
#define CTE_PADSCICALEN12_bm  (1<<12)  /* Pad sc ical Enable bit 12 mask. */
#define CTE_PADSCICALEN12_bp  12  /* Pad sc ical Enable bit 12 position. */
#define CTE_PADSCICALEN13_bm  (1<<13)  /* Pad sc ical Enable bit 13 mask. */
#define CTE_PADSCICALEN13_bp  13  /* Pad sc ical Enable bit 13 position. */
#define CTE_PADSCICALEN14_bm  (1<<14)  /* Pad sc ical Enable bit 14 mask. */
#define CTE_PADSCICALEN14_bp  14  /* Pad sc ical Enable bit 14 position. */
#define CTE_PADSCICALEN15_bm  (1<<15)  /* Pad sc ical Enable bit 15 mask. */
#define CTE_PADSCICALEN15_bp  15  /* Pad sc ical Enable bit 15 position. */

/* CTE.PADSCICALENB  bit masks and bit positions */
/* CTE_PADSCICALEN  is already defined. */

/* CTE.PADINTENA  bit masks and bit positions */
#define CTE_PADINTEN_gm  0xFFFF  /* Pad int Enable group mask. */
#define CTE_PADINTEN_gp  0  /* Pad int Enable group position. */
#define CTE_PADINTEN0_bm  (1<<0)  /* Pad int Enable bit 0 mask. */
#define CTE_PADINTEN0_bp  0  /* Pad int Enable bit 0 position. */
#define CTE_PADINTEN1_bm  (1<<1)  /* Pad int Enable bit 1 mask. */
#define CTE_PADINTEN1_bp  1  /* Pad int Enable bit 1 position. */
#define CTE_PADINTEN2_bm  (1<<2)  /* Pad int Enable bit 2 mask. */
#define CTE_PADINTEN2_bp  2  /* Pad int Enable bit 2 position. */
#define CTE_PADINTEN3_bm  (1<<3)  /* Pad int Enable bit 3 mask. */
#define CTE_PADINTEN3_bp  3  /* Pad int Enable bit 3 position. */
#define CTE_PADINTEN4_bm  (1<<4)  /* Pad int Enable bit 4 mask. */
#define CTE_PADINTEN4_bp  4  /* Pad int Enable bit 4 position. */
#define CTE_PADINTEN5_bm  (1<<5)  /* Pad int Enable bit 5 mask. */
#define CTE_PADINTEN5_bp  5  /* Pad int Enable bit 5 position. */
#define CTE_PADINTEN6_bm  (1<<6)  /* Pad int Enable bit 6 mask. */
#define CTE_PADINTEN6_bp  6  /* Pad int Enable bit 6 position. */
#define CTE_PADINTEN7_bm  (1<<7)  /* Pad int Enable bit 7 mask. */
#define CTE_PADINTEN7_bp  7  /* Pad int Enable bit 7 position. */
#define CTE_PADINTEN8_bm  (1<<8)  /* Pad int Enable bit 8 mask. */
#define CTE_PADINTEN8_bp  8  /* Pad int Enable bit 8 position. */
#define CTE_PADINTEN9_bm  (1<<9)  /* Pad int Enable bit 9 mask. */
#define CTE_PADINTEN9_bp  9  /* Pad int Enable bit 9 position. */
#define CTE_PADINTEN10_bm  (1<<10)  /* Pad int Enable bit 10 mask. */
#define CTE_PADINTEN10_bp  10  /* Pad int Enable bit 10 position. */
#define CTE_PADINTEN11_bm  (1<<11)  /* Pad int Enable bit 11 mask. */
#define CTE_PADINTEN11_bp  11  /* Pad int Enable bit 11 position. */
#define CTE_PADINTEN12_bm  (1<<12)  /* Pad int Enable bit 12 mask. */
#define CTE_PADINTEN12_bp  12  /* Pad int Enable bit 12 position. */
#define CTE_PADINTEN13_bm  (1<<13)  /* Pad int Enable bit 13 mask. */
#define CTE_PADINTEN13_bp  13  /* Pad int Enable bit 13 position. */
#define CTE_PADINTEN14_bm  (1<<14)  /* Pad int Enable bit 14 mask. */
#define CTE_PADINTEN14_bp  14  /* Pad int Enable bit 14 position. */
#define CTE_PADINTEN15_bm  (1<<15)  /* Pad int Enable bit 15 mask. */
#define CTE_PADINTEN15_bp  15  /* Pad int Enable bit 15 position. */

/* CTE.PADINTENB  bit masks and bit positions */
/* CTE_PADINTEN  is already defined. */

