gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADSCX0  bit masks and bit positions */
#define CTE_PADSCXA_gm  0x1F  /* Pad Self Cap Control Registers X A group mask. */
#define CTE_PADSCXA_gp  0  /* Pad Self Cap Control Registers X A group position. */
#define CTE_PADSCXA0_bm  (1<<0)  /* Pad Self Cap Control Registers X A bit 0 mask. */
#define CTE_PADSCXA0_bp  0  /* Pad Self Cap Control Registers X A bit 0 position. */
#define CTE_PADSCXA1_bm  (1<<1)  /* Pad Self Cap Control Registers X A bit 1 mask. */
#define CTE_PADSCXA1_bp  1  /* Pad Self Cap Control Registers X A bit 1 position. */
#define CTE_PADSCXA2_bm  (1<<2)  /* Pad Self Cap Control Registers X A bit 2 mask. */
#define CTE_PADSCXA2_bp  2  /* Pad Self Cap Control Registers X A bit 2 position. */
#define CTE_PADSCXA3_bm  (1<<3)  /* Pad Self Cap Control Registers X A bit 3 mask. */
#define CTE_PADSCXA3_bp  3  /* Pad Self Cap Control Registers X A bit 3 position. */
#define CTE_PADSCXA4_bm  (1<<4)  /* Pad Self Cap Control Registers X A bit 4 mask. */
#define CTE_PADSCXA4_bp  4  /* Pad Self Cap Control Registers X A bit 4 position. */
#define CTE_PADSCXRANGEA_bm  0x20  /* Pad Selfcap Range X A bit mask. */
#define CTE_PADSCXRANGEA_bp  5  /* Pad Selfcap Range X A bit position. */
#define CTE_PADSCXB_gm  0x1F00  /* Pad Self Cap Control Registers X B group mask. */
#define CTE_PADSCXB_gp  8  /* Pad Self Cap Control Registers X B group position. */
#define CTE_PADSCXB0_bm  (1<<8)  /* Pad Self Cap Control Registers X B bit 0 mask. */
#define CTE_PADSCXB0_bp  8  /* Pad Self Cap Control Registers X B bit 0 position. */
#define CTE_PADSCXB1_bm  (1<<9)  /* Pad Self Cap Control Registers X B bit 1 mask. */
#define CTE_PADSCXB1_bp  9  /* Pad Self Cap Control Registers X B bit 1 position. */
#define CTE_PADSCXB2_bm  (1<<10)  /* Pad Self Cap Control Registers X B bit 2 mask. */
#define CTE_PADSCXB2_bp  10  /* Pad Self Cap Control Registers X B bit 2 position. */
#define CTE_PADSCXB3_bm  (1<<11)  /* Pad Self Cap Control Registers X B bit 3 mask. */
#define CTE_PADSCXB3_bp  11  /* Pad Self Cap Control Registers X B bit 3 position. */
#define CTE_PADSCXB4_bm  (1<<12)  /* Pad Self Cap Control Registers X B bit 4 mask. */
#define CTE_PADSCXB4_bp  12  /* Pad Self Cap Control Registers X B bit 4 position. */
#define CTE_PADSCXRANGEB_bm  0x2000  /* Pad Selfcap Range X B bit mask. */
#define CTE_PADSCXRANGEB_bp  13  /* Pad Selfcap Range X B bit position. */

/* CTE.PADSCX1  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX2  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX3  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX4  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX5  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX6  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX7  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX8  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX9  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX10  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX11  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX12  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX13  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX14  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX15  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX16  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX17  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX18  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

