gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADSCX19  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX20  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX21  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX22  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX23  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX24  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX25  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX26  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX27  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX28  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX29  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX30  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX31  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX32  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX33  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX34  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX35  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX36  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX37  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX38  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX39  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX40  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX41  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX42  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX43  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX44  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX45  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX46  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX47  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX48  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX49  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX50  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

/* CTE.PADSCX51  bit masks and bit positions */
/* CTE_PADSCXA  is already defined. */
/* CTE_PADSCXRANGEA  is already defined. */
/* CTE_PADSCXB  is already defined. */
/* CTE_PADSCXRANGEB  is already defined. */

