gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADSCY12  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY13  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY14  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY15  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY16  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY17  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY18  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY19  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY20  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY21  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY22  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY23  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY24  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY25  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY26  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY27  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY28  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY29  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY30  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY31  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY32  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY33  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY34  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCY35  bit masks and bit positions */
/* CTE_PADSCYA  is already defined. */
/* CTE_PADSCYRANGEA  is already defined. */
/* CTE_PADSCYB  is already defined. */
/* CTE_PADSCYRANGEB  is already defined. */

/* CTE.PADSCP0  bit masks and bit positions */
#define CTE_PADSCPA_gm  0x1F  /* Pad Self Cap Control Registers P A group mask. */
#define CTE_PADSCPA_gp  0  /* Pad Self Cap Control Registers P A group position. */
#define CTE_PADSCPA0_bm  (1<<0)  /* Pad Self Cap Control Registers P A bit 0 mask. */
#define CTE_PADSCPA0_bp  0  /* Pad Self Cap Control Registers P A bit 0 position. */
#define CTE_PADSCPA1_bm  (1<<1)  /* Pad Self Cap Control Registers P A bit 1 mask. */
#define CTE_PADSCPA1_bp  1  /* Pad Self Cap Control Registers P A bit 1 position. */
#define CTE_PADSCPA2_bm  (1<<2)  /* Pad Self Cap Control Registers P A bit 2 mask. */
#define CTE_PADSCPA2_bp  2  /* Pad Self Cap Control Registers P A bit 2 position. */
#define CTE_PADSCPA3_bm  (1<<3)  /* Pad Self Cap Control Registers P A bit 3 mask. */
#define CTE_PADSCPA3_bp  3  /* Pad Self Cap Control Registers P A bit 3 position. */
#define CTE_PADSCPA4_bm  (1<<4)  /* Pad Self Cap Control Registers P A bit 4 mask. */
#define CTE_PADSCPA4_bp  4  /* Pad Self Cap Control Registers P A bit 4 position. */
#define CTE_PADSCPRANGEA_bm  0x20  /* Pad Selfcap Range P A bit mask. */
#define CTE_PADSCPRANGEA_bp  5  /* Pad Selfcap Range P A bit position. */
#define CTE_PADSCPB_gm  0x1F00  /* Pad Self Cap Control Registers P B group mask. */
#define CTE_PADSCPB_gp  8  /* Pad Self Cap Control Registers P B group position. */
#define CTE_PADSCPB0_bm  (1<<8)  /* Pad Self Cap Control Registers P B bit 0 mask. */
#define CTE_PADSCPB0_bp  8  /* Pad Self Cap Control Registers P B bit 0 position. */
#define CTE_PADSCPB1_bm  (1<<9)  /* Pad Self Cap Control Registers P B bit 1 mask. */
#define CTE_PADSCPB1_bp  9  /* Pad Self Cap Control Registers P B bit 1 position. */
#define CTE_PADSCPB2_bm  (1<<10)  /* Pad Self Cap Control Registers P B bit 2 mask. */
#define CTE_PADSCPB2_bp  10  /* Pad Self Cap Control Registers P B bit 2 position. */
#define CTE_PADSCPB3_bm  (1<<11)  /* Pad Self Cap Control Registers P B bit 3 mask. */
#define CTE_PADSCPB3_bp  11  /* Pad Self Cap Control Registers P B bit 3 position. */
#define CTE_PADSCPB4_bm  (1<<12)  /* Pad Self Cap Control Registers P B bit 4 mask. */
#define CTE_PADSCPB4_bp  12  /* Pad Self Cap Control Registers P B bit 4 position. */
#define CTE_PADSCPRANGEB_bm  0x2000  /* Pad Selfcap Range P B bit mask. */
#define CTE_PADSCPRANGEB_bp  13  /* Pad Selfcap Range P B bit position. */

/* CTE.PADSCP1  bit masks and bit positions */
/* CTE_PADSCPA  is already defined. */
/* CTE_PADSCPRANGEA  is already defined. */
/* CTE_PADSCPB  is already defined. */
/* CTE_PADSCPRANGEB  is already defined. */

/* CTE.INTCRG  bit masks and bit positions */
#define CTE_INTVMEN_bm  0x01  /* Voltage Modulation Enable bit mask. */
#define CTE_INTVMEN_bp  0  /* Voltage Modulation Enable bit position. */
#define CTE_INTCCMOECTRL_bm  0x02  /* Enable INTMOE Control Over Charge Compansation bit mask. */
#define CTE_INTCCMOECTRL_bp  1  /* Enable INTMOE Control Over Charge Compansation bit position. */
#define CTE_INTXYRESPD_bm  0x08  /* Enable XYRes Pulldown bit mask. */
#define CTE_INTXYRESPD_bp  3  /* Enable XYRes Pulldown bit position. */
#define CTE_SCDREFEN_bm  0x10  /* Selfcap Diode Reference Enable bit mask. */
#define CTE_SCDREFEN_bp  4  /* Selfcap Diode Reference Enable bit position. */
#define CTE_SCPMEN_bm  0x20  /* Selfcap Prox Master Enable bit mask. */
#define CTE_SCPMEN_bp  5  /* Selfcap Prox Master Enable bit position. */
#define CTE_SCYNOE_bm  0x40  /* Selfcap Y-line NMos Output Enable bit mask. */
#define CTE_SCYNOE_bp  6  /* Selfcap Y-line NMos Output Enable bit position. */
#define CTE_SCYPOE_bm  0x80  /* Selfcap Y-line PMos Output Enable bit mask. */
#define CTE_SCYPOE_bp  7  /* Selfcap Y-line PMos Output Enable bit position. */
#define CTE_SCXNOE_bm  0x100  /* Selfcap X-line NMos Output Enable bit mask. */
#define CTE_SCXNOE_bp  8  /* Selfcap X-line NMos Output Enable bit position. */
#define CTE_SCXPOE_bm  0x200  /* Selfcap X-line PMos Output Enable bit mask. */
#define CTE_SCXPOE_bp  9  /* Selfcap X-line PMos Output Enable bit position. */
#define CTE_SCPNOE_bm  0x400  /* Selfcap Prox NMos Output Enable bit mask. */
#define CTE_SCPNOE_bp  10  /* Selfcap Prox NMos Output Enable bit position. */
#define CTE_SCPPOE_bm  0x800  /* Selfcap Prox PMos Output Enable bit mask. */
#define CTE_SCPPOE_bp  11  /* Selfcap Prox PMos Output Enable bit position. */
#define CTE_SCHSREFEN_gm  0x3000  /* Selfcap High Strength Ref Enable group mask. */
#define CTE_SCHSREFEN_gp  12  /* Selfcap High Strength Ref Enable group position. */
#define CTE_SCHSREFEN0_bm  (1<<12)  /* Selfcap High Strength Ref Enable bit 0 mask. */
#define CTE_SCHSREFEN0_bp  12  /* Selfcap High Strength Ref Enable bit 0 position. */
#define CTE_SCHSREFEN1_bm  (1<<13)  /* Selfcap High Strength Ref Enable bit 1 mask. */
#define CTE_SCHSREFEN1_bp  13  /* Selfcap High Strength Ref Enable bit 1 position. */

/* CTE.VMCTRL  bit masks and bit positions */
#define CTE_VMCTRLA_gm  0x07  /* Voltage Modulation Control A group mask. */
#define CTE_VMCTRLA_gp  0  /* Voltage Modulation Control A group position. */
#define CTE_VMCTRLA0_bm  (1<<0)  /* Voltage Modulation Control A bit 0 mask. */
#define CTE_VMCTRLA0_bp  0  /* Voltage Modulation Control A bit 0 position. */
#define CTE_VMCTRLA1_bm  (1<<1)  /* Voltage Modulation Control A bit 1 mask. */
#define CTE_VMCTRLA1_bp  1  /* Voltage Modulation Control A bit 1 position. */
#define CTE_VMCTRLA2_bm  (1<<2)  /* Voltage Modulation Control A bit 2 mask. */
#define CTE_VMCTRLA2_bp  2  /* Voltage Modulation Control A bit 2 position. */
#define CTE_VMCTRLB_gm  0x70  /* Voltage Modulation Control B group mask. */
#define CTE_VMCTRLB_gp  4  /* Voltage Modulation Control B group position. */
#define CTE_VMCTRLB0_bm  (1<<4)  /* Voltage Modulation Control B bit 0 mask. */
#define CTE_VMCTRLB0_bp  4  /* Voltage Modulation Control B bit 0 position. */
#define CTE_VMCTRLB1_bm  (1<<5)  /* Voltage Modulation Control B bit 1 mask. */
#define CTE_VMCTRLB1_bp  5  /* Voltage Modulation Control B bit 1 position. */
#define CTE_VMCTRLB2_bm  (1<<6)  /* Voltage Modulation Control B bit 2 mask. */
#define CTE_VMCTRLB2_bp  6  /* Voltage Modulation Control B bit 2 position. */

