gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADHVSWENA  bit masks and bit positions */
#define CTE_PADHVSWEN_gm  0xFFFF  /* Pad hvsw Enable group mask. */
#define CTE_PADHVSWEN_gp  0  /* Pad hvsw Enable group position. */
#define CTE_PADHVSWEN0_bm  (1<<0)  /* Pad hvsw Enable bit 0 mask. */
#define CTE_PADHVSWEN0_bp  0  /* Pad hvsw Enable bit 0 position. */
#define CTE_PADHVSWEN1_bm  (1<<1)  /* Pad hvsw Enable bit 1 mask. */
#define CTE_PADHVSWEN1_bp  1  /* Pad hvsw Enable bit 1 position. */
#define CTE_PADHVSWEN2_bm  (1<<2)  /* Pad hvsw Enable bit 2 mask. */
#define CTE_PADHVSWEN2_bp  2  /* Pad hvsw Enable bit 2 position. */
#define CTE_PADHVSWEN3_bm  (1<<3)  /* Pad hvsw Enable bit 3 mask. */
#define CTE_PADHVSWEN3_bp  3  /* Pad hvsw Enable bit 3 position. */
#define CTE_PADHVSWEN4_bm  (1<<4)  /* Pad hvsw Enable bit 4 mask. */
#define CTE_PADHVSWEN4_bp  4  /* Pad hvsw Enable bit 4 position. */
#define CTE_PADHVSWEN5_bm  (1<<5)  /* Pad hvsw Enable bit 5 mask. */
#define CTE_PADHVSWEN5_bp  5  /* Pad hvsw Enable bit 5 position. */
#define CTE_PADHVSWEN6_bm  (1<<6)  /* Pad hvsw Enable bit 6 mask. */
#define CTE_PADHVSWEN6_bp  6  /* Pad hvsw Enable bit 6 position. */
#define CTE_PADHVSWEN7_bm  (1<<7)  /* Pad hvsw Enable bit 7 mask. */
#define CTE_PADHVSWEN7_bp  7  /* Pad hvsw Enable bit 7 position. */
#define CTE_PADHVSWEN8_bm  (1<<8)  /* Pad hvsw Enable bit 8 mask. */
#define CTE_PADHVSWEN8_bp  8  /* Pad hvsw Enable bit 8 position. */
#define CTE_PADHVSWEN9_bm  (1<<9)  /* Pad hvsw Enable bit 9 mask. */
#define CTE_PADHVSWEN9_bp  9  /* Pad hvsw Enable bit 9 position. */
#define CTE_PADHVSWEN10_bm  (1<<10)  /* Pad hvsw Enable bit 10 mask. */
#define CTE_PADHVSWEN10_bp  10  /* Pad hvsw Enable bit 10 position. */
#define CTE_PADHVSWEN11_bm  (1<<11)  /* Pad hvsw Enable bit 11 mask. */
#define CTE_PADHVSWEN11_bp  11  /* Pad hvsw Enable bit 11 position. */
#define CTE_PADHVSWEN12_bm  (1<<12)  /* Pad hvsw Enable bit 12 mask. */
#define CTE_PADHVSWEN12_bp  12  /* Pad hvsw Enable bit 12 position. */
#define CTE_PADHVSWEN13_bm  (1<<13)  /* Pad hvsw Enable bit 13 mask. */
#define CTE_PADHVSWEN13_bp  13  /* Pad hvsw Enable bit 13 position. */
#define CTE_PADHVSWEN14_bm  (1<<14)  /* Pad hvsw Enable bit 14 mask. */
#define CTE_PADHVSWEN14_bp  14  /* Pad hvsw Enable bit 14 position. */
#define CTE_PADHVSWEN15_bm  (1<<15)  /* Pad hvsw Enable bit 15 mask. */
#define CTE_PADHVSWEN15_bp  15  /* Pad hvsw Enable bit 15 position. */

/* CTE.PADHVSWENB  bit masks and bit positions */
/* CTE_PADHVSWEN  is already defined. */

/* CTE.PADBNX1  bit masks and bit positions */
#define CTE_SCBNX1A_gm  0x3F  /* Current source nmos calibration X1 A group mask. */
#define CTE_SCBNX1A_gp  0  /* Current source nmos calibration X1 A group position. */
#define CTE_SCBNX1A0_bm  (1<<0)  /* Current source nmos calibration X1 A bit 0 mask. */
#define CTE_SCBNX1A0_bp  0  /* Current source nmos calibration X1 A bit 0 position. */
#define CTE_SCBNX1A1_bm  (1<<1)  /* Current source nmos calibration X1 A bit 1 mask. */
#define CTE_SCBNX1A1_bp  1  /* Current source nmos calibration X1 A bit 1 position. */
#define CTE_SCBNX1A2_bm  (1<<2)  /* Current source nmos calibration X1 A bit 2 mask. */
#define CTE_SCBNX1A2_bp  2  /* Current source nmos calibration X1 A bit 2 position. */
#define CTE_SCBNX1A3_bm  (1<<3)  /* Current source nmos calibration X1 A bit 3 mask. */
#define CTE_SCBNX1A3_bp  3  /* Current source nmos calibration X1 A bit 3 position. */
#define CTE_SCBNX1A4_bm  (1<<4)  /* Current source nmos calibration X1 A bit 4 mask. */
#define CTE_SCBNX1A4_bp  4  /* Current source nmos calibration X1 A bit 4 position. */
#define CTE_SCBNX1A5_bm  (1<<5)  /* Current source nmos calibration X1 A bit 5 mask. */
#define CTE_SCBNX1A5_bp  5  /* Current source nmos calibration X1 A bit 5 position. */
#define CTE_SCBNX1B_gm  0x3F00  /* Current source nmos calibration X1 B group mask. */
#define CTE_SCBNX1B_gp  8  /* Current source nmos calibration X1 B group position. */
#define CTE_SCBNX1B0_bm  (1<<8)  /* Current source nmos calibration X1 B bit 0 mask. */
#define CTE_SCBNX1B0_bp  8  /* Current source nmos calibration X1 B bit 0 position. */
#define CTE_SCBNX1B1_bm  (1<<9)  /* Current source nmos calibration X1 B bit 1 mask. */
#define CTE_SCBNX1B1_bp  9  /* Current source nmos calibration X1 B bit 1 position. */
#define CTE_SCBNX1B2_bm  (1<<10)  /* Current source nmos calibration X1 B bit 2 mask. */
#define CTE_SCBNX1B2_bp  10  /* Current source nmos calibration X1 B bit 2 position. */
#define CTE_SCBNX1B3_bm  (1<<11)  /* Current source nmos calibration X1 B bit 3 mask. */
#define CTE_SCBNX1B3_bp  11  /* Current source nmos calibration X1 B bit 3 position. */
#define CTE_SCBNX1B4_bm  (1<<12)  /* Current source nmos calibration X1 B bit 4 mask. */
#define CTE_SCBNX1B4_bp  12  /* Current source nmos calibration X1 B bit 4 position. */
#define CTE_SCBNX1B5_bm  (1<<13)  /* Current source nmos calibration X1 B bit 5 mask. */
#define CTE_SCBNX1B5_bp  13  /* Current source nmos calibration X1 B bit 5 position. */

/* CTE.PADBPX1  bit masks and bit positions */
#define CTE_SCBPX1A_gm  0x3F  /* Current source pmos calibration X1 A group mask. */
#define CTE_SCBPX1A_gp  0  /* Current source pmos calibration X1 A group position. */
#define CTE_SCBPX1A0_bm  (1<<0)  /* Current source pmos calibration X1 A bit 0 mask. */
#define CTE_SCBPX1A0_bp  0  /* Current source pmos calibration X1 A bit 0 position. */
#define CTE_SCBPX1A1_bm  (1<<1)  /* Current source pmos calibration X1 A bit 1 mask. */
#define CTE_SCBPX1A1_bp  1  /* Current source pmos calibration X1 A bit 1 position. */
#define CTE_SCBPX1A2_bm  (1<<2)  /* Current source pmos calibration X1 A bit 2 mask. */
#define CTE_SCBPX1A2_bp  2  /* Current source pmos calibration X1 A bit 2 position. */
#define CTE_SCBPX1A3_bm  (1<<3)  /* Current source pmos calibration X1 A bit 3 mask. */
#define CTE_SCBPX1A3_bp  3  /* Current source pmos calibration X1 A bit 3 position. */
#define CTE_SCBPX1A4_bm  (1<<4)  /* Current source pmos calibration X1 A bit 4 mask. */
#define CTE_SCBPX1A4_bp  4  /* Current source pmos calibration X1 A bit 4 position. */
#define CTE_SCBPX1A5_bm  (1<<5)  /* Current source pmos calibration X1 A bit 5 mask. */
#define CTE_SCBPX1A5_bp  5  /* Current source pmos calibration X1 A bit 5 position. */
#define CTE_SCBPX1B_gm  0x3F00  /* Current source pmos calibration X1 B group mask. */
#define CTE_SCBPX1B_gp  8  /* Current source pmos calibration X1 B group position. */
#define CTE_SCBPX1B0_bm  (1<<8)  /* Current source pmos calibration X1 B bit 0 mask. */
#define CTE_SCBPX1B0_bp  8  /* Current source pmos calibration X1 B bit 0 position. */
#define CTE_SCBPX1B1_bm  (1<<9)  /* Current source pmos calibration X1 B bit 1 mask. */
#define CTE_SCBPX1B1_bp  9  /* Current source pmos calibration X1 B bit 1 position. */
#define CTE_SCBPX1B2_bm  (1<<10)  /* Current source pmos calibration X1 B bit 2 mask. */
#define CTE_SCBPX1B2_bp  10  /* Current source pmos calibration X1 B bit 2 position. */
#define CTE_SCBPX1B3_bm  (1<<11)  /* Current source pmos calibration X1 B bit 3 mask. */
#define CTE_SCBPX1B3_bp  11  /* Current source pmos calibration X1 B bit 3 position. */
#define CTE_SCBPX1B4_bm  (1<<12)  /* Current source pmos calibration X1 B bit 4 mask. */
#define CTE_SCBPX1B4_bp  12  /* Current source pmos calibration X1 B bit 4 position. */
#define CTE_SCBPX1B5_bm  (1<<13)  /* Current source pmos calibration X1 B bit 5 mask. */
#define CTE_SCBPX1B5_bp  13  /* Current source pmos calibration X1 B bit 5 position. */

/* CTE.PADX1  bit masks and bit positions */
#define CTE_SCEXTRAPXA_gm  0x0F  /* Enable extra pmos calibration X1 A group mask. */
#define CTE_SCEXTRAPXA_gp  0  /* Enable extra pmos calibration X1 A group position. */
#define CTE_SCEXTRAPXA0_bm  (1<<0)  /* Enable extra pmos calibration X1 A bit 0 mask. */
#define CTE_SCEXTRAPXA0_bp  0  /* Enable extra pmos calibration X1 A bit 0 position. */
#define CTE_SCEXTRAPXA1_bm  (1<<1)  /* Enable extra pmos calibration X1 A bit 1 mask. */
#define CTE_SCEXTRAPXA1_bp  1  /* Enable extra pmos calibration X1 A bit 1 position. */
#define CTE_SCEXTRAPXA2_bm  (1<<2)  /* Enable extra pmos calibration X1 A bit 2 mask. */
#define CTE_SCEXTRAPXA2_bp  2  /* Enable extra pmos calibration X1 A bit 2 position. */
#define CTE_SCEXTRAPXA3_bm  (1<<3)  /* Enable extra pmos calibration X1 A bit 3 mask. */
#define CTE_SCEXTRAPXA3_bp  3  /* Enable extra pmos calibration X1 A bit 3 position. */
#define CTE_SCEXTRAPXB_gm  0xF0  /* Enable extra pmos calibration X1 B group mask. */
#define CTE_SCEXTRAPXB_gp  4  /* Enable extra pmos calibration X1 B group position. */
#define CTE_SCEXTRAPXB0_bm  (1<<4)  /* Enable extra pmos calibration X1 B bit 0 mask. */
#define CTE_SCEXTRAPXB0_bp  4  /* Enable extra pmos calibration X1 B bit 0 position. */
#define CTE_SCEXTRAPXB1_bm  (1<<5)  /* Enable extra pmos calibration X1 B bit 1 mask. */
#define CTE_SCEXTRAPXB1_bp  5  /* Enable extra pmos calibration X1 B bit 1 position. */
#define CTE_SCEXTRAPXB2_bm  (1<<6)  /* Enable extra pmos calibration X1 B bit 2 mask. */
#define CTE_SCEXTRAPXB2_bp  6  /* Enable extra pmos calibration X1 B bit 2 position. */
#define CTE_SCEXTRAPXB3_bm  (1<<7)  /* Enable extra pmos calibration X1 B bit 3 mask. */
#define CTE_SCEXTRAPXB3_bp  7  /* Enable extra pmos calibration X1 B bit 3 position. */
#define CTE_SCEXTRANXA_gm  0xF00  /* Enable extra nmos calibration X1 A group mask. */
#define CTE_SCEXTRANXA_gp  8  /* Enable extra nmos calibration X1 A group position. */
#define CTE_SCEXTRANXA0_bm  (1<<8)  /* Enable extra nmos calibration X1 A bit 0 mask. */
#define CTE_SCEXTRANXA0_bp  8  /* Enable extra nmos calibration X1 A bit 0 position. */
#define CTE_SCEXTRANXA1_bm  (1<<9)  /* Enable extra nmos calibration X1 A bit 1 mask. */
#define CTE_SCEXTRANXA1_bp  9  /* Enable extra nmos calibration X1 A bit 1 position. */
#define CTE_SCEXTRANXA2_bm  (1<<10)  /* Enable extra nmos calibration X1 A bit 2 mask. */
#define CTE_SCEXTRANXA2_bp  10  /* Enable extra nmos calibration X1 A bit 2 position. */
#define CTE_SCEXTRANXA3_bm  (1<<11)  /* Enable extra nmos calibration X1 A bit 3 mask. */
#define CTE_SCEXTRANXA3_bp  11  /* Enable extra nmos calibration X1 A bit 3 position. */
#define CTE_SCEXTRANXB_gm  0xF000  /* Enable extra nmos calibration X1 B group mask. */
#define CTE_SCEXTRANXB_gp  12  /* Enable extra nmos calibration X1 B group position. */
#define CTE_SCEXTRANXB0_bm  (1<<12)  /* Enable extra nmos calibration X1 B bit 0 mask. */
#define CTE_SCEXTRANXB0_bp  12  /* Enable extra nmos calibration X1 B bit 0 position. */
#define CTE_SCEXTRANXB1_bm  (1<<13)  /* Enable extra nmos calibration X1 B bit 1 mask. */
#define CTE_SCEXTRANXB1_bp  13  /* Enable extra nmos calibration X1 B bit 1 position. */
#define CTE_SCEXTRANXB2_bm  (1<<14)  /* Enable extra nmos calibration X1 B bit 2 mask. */
#define CTE_SCEXTRANXB2_bp  14  /* Enable extra nmos calibration X1 B bit 2 position. */
#define CTE_SCEXTRANXB3_bm  (1<<15)  /* Enable extra nmos calibration X1 B bit 3 mask. */
#define CTE_SCEXTRANXB3_bp  15  /* Enable extra nmos calibration X1 B bit 3 position. */

