gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADBNP1  bit masks and bit positions */
#define CTE_SCBNP1A_gm  0x3F  /* Current source nmos calibration X2 A group mask. */
#define CTE_SCBNP1A_gp  0  /* Current source nmos calibration X2 A group position. */
#define CTE_SCBNP1A0_bm  (1<<0)  /* Current source nmos calibration X2 A bit 0 mask. */
#define CTE_SCBNP1A0_bp  0  /* Current source nmos calibration X2 A bit 0 position. */
#define CTE_SCBNP1A1_bm  (1<<1)  /* Current source nmos calibration X2 A bit 1 mask. */
#define CTE_SCBNP1A1_bp  1  /* Current source nmos calibration X2 A bit 1 position. */
#define CTE_SCBNP1A2_bm  (1<<2)  /* Current source nmos calibration X2 A bit 2 mask. */
#define CTE_SCBNP1A2_bp  2  /* Current source nmos calibration X2 A bit 2 position. */
#define CTE_SCBNP1A3_bm  (1<<3)  /* Current source nmos calibration X2 A bit 3 mask. */
#define CTE_SCBNP1A3_bp  3  /* Current source nmos calibration X2 A bit 3 position. */
#define CTE_SCBNP1A4_bm  (1<<4)  /* Current source nmos calibration X2 A bit 4 mask. */
#define CTE_SCBNP1A4_bp  4  /* Current source nmos calibration X2 A bit 4 position. */
#define CTE_SCBNP1A5_bm  (1<<5)  /* Current source nmos calibration X2 A bit 5 mask. */
#define CTE_SCBNP1A5_bp  5  /* Current source nmos calibration X2 A bit 5 position. */
#define CTE_SCBNP1B_gm  0x3F00  /* Current source nmos calibration X2 B group mask. */
#define CTE_SCBNP1B_gp  8  /* Current source nmos calibration X2 B group position. */
#define CTE_SCBNP1B0_bm  (1<<8)  /* Current source nmos calibration X2 B bit 0 mask. */
#define CTE_SCBNP1B0_bp  8  /* Current source nmos calibration X2 B bit 0 position. */
#define CTE_SCBNP1B1_bm  (1<<9)  /* Current source nmos calibration X2 B bit 1 mask. */
#define CTE_SCBNP1B1_bp  9  /* Current source nmos calibration X2 B bit 1 position. */
#define CTE_SCBNP1B2_bm  (1<<10)  /* Current source nmos calibration X2 B bit 2 mask. */
#define CTE_SCBNP1B2_bp  10  /* Current source nmos calibration X2 B bit 2 position. */
#define CTE_SCBNP1B3_bm  (1<<11)  /* Current source nmos calibration X2 B bit 3 mask. */
#define CTE_SCBNP1B3_bp  11  /* Current source nmos calibration X2 B bit 3 position. */
#define CTE_SCBNP1B4_bm  (1<<12)  /* Current source nmos calibration X2 B bit 4 mask. */
#define CTE_SCBNP1B4_bp  12  /* Current source nmos calibration X2 B bit 4 position. */
#define CTE_SCBNP1B5_bm  (1<<13)  /* Current source nmos calibration X2 B bit 5 mask. */
#define CTE_SCBNP1B5_bp  13  /* Current source nmos calibration X2 B bit 5 position. */

/* CTE.PADBPP1  bit masks and bit positions */
#define CTE_SCBPP1A_gm  0x3F  /* Current source pmos calibration X2 A group mask. */
#define CTE_SCBPP1A_gp  0  /* Current source pmos calibration X2 A group position. */
#define CTE_SCBPP1A0_bm  (1<<0)  /* Current source pmos calibration X2 A bit 0 mask. */
#define CTE_SCBPP1A0_bp  0  /* Current source pmos calibration X2 A bit 0 position. */
#define CTE_SCBPP1A1_bm  (1<<1)  /* Current source pmos calibration X2 A bit 1 mask. */
#define CTE_SCBPP1A1_bp  1  /* Current source pmos calibration X2 A bit 1 position. */
#define CTE_SCBPP1A2_bm  (1<<2)  /* Current source pmos calibration X2 A bit 2 mask. */
#define CTE_SCBPP1A2_bp  2  /* Current source pmos calibration X2 A bit 2 position. */
#define CTE_SCBPP1A3_bm  (1<<3)  /* Current source pmos calibration X2 A bit 3 mask. */
#define CTE_SCBPP1A3_bp  3  /* Current source pmos calibration X2 A bit 3 position. */
#define CTE_SCBPP1A4_bm  (1<<4)  /* Current source pmos calibration X2 A bit 4 mask. */
#define CTE_SCBPP1A4_bp  4  /* Current source pmos calibration X2 A bit 4 position. */
#define CTE_SCBPP1A5_bm  (1<<5)  /* Current source pmos calibration X2 A bit 5 mask. */
#define CTE_SCBPP1A5_bp  5  /* Current source pmos calibration X2 A bit 5 position. */
#define CTE_SCBPP1B_gm  0x3F00  /* Current source pmos calibration X2 B group mask. */
#define CTE_SCBPP1B_gp  8  /* Current source pmos calibration X2 B group position. */
#define CTE_SCBPP1B0_bm  (1<<8)  /* Current source pmos calibration X2 B bit 0 mask. */
#define CTE_SCBPP1B0_bp  8  /* Current source pmos calibration X2 B bit 0 position. */
#define CTE_SCBPP1B1_bm  (1<<9)  /* Current source pmos calibration X2 B bit 1 mask. */
#define CTE_SCBPP1B1_bp  9  /* Current source pmos calibration X2 B bit 1 position. */
#define CTE_SCBPP1B2_bm  (1<<10)  /* Current source pmos calibration X2 B bit 2 mask. */
#define CTE_SCBPP1B2_bp  10  /* Current source pmos calibration X2 B bit 2 position. */
#define CTE_SCBPP1B3_bm  (1<<11)  /* Current source pmos calibration X2 B bit 3 mask. */
#define CTE_SCBPP1B3_bp  11  /* Current source pmos calibration X2 B bit 3 position. */
#define CTE_SCBPP1B4_bm  (1<<12)  /* Current source pmos calibration X2 B bit 4 mask. */
#define CTE_SCBPP1B4_bp  12  /* Current source pmos calibration X2 B bit 4 position. */
#define CTE_SCBPP1B5_bm  (1<<13)  /* Current source pmos calibration X2 B bit 5 mask. */
#define CTE_SCBPP1B5_bp  13  /* Current source pmos calibration X2 B bit 5 position. */

/* CTE.PADP1  bit masks and bit positions */
#define CTE_SCEXTRAPPA_gm  0x0F  /* Enable extra pmos calibration P1 A group mask. */
#define CTE_SCEXTRAPPA_gp  0  /* Enable extra pmos calibration P1 A group position. */
#define CTE_SCEXTRAPPA0_bm  (1<<0)  /* Enable extra pmos calibration P1 A bit 0 mask. */
#define CTE_SCEXTRAPPA0_bp  0  /* Enable extra pmos calibration P1 A bit 0 position. */
#define CTE_SCEXTRAPPA1_bm  (1<<1)  /* Enable extra pmos calibration P1 A bit 1 mask. */
#define CTE_SCEXTRAPPA1_bp  1  /* Enable extra pmos calibration P1 A bit 1 position. */
#define CTE_SCEXTRAPPA2_bm  (1<<2)  /* Enable extra pmos calibration P1 A bit 2 mask. */
#define CTE_SCEXTRAPPA2_bp  2  /* Enable extra pmos calibration P1 A bit 2 position. */
#define CTE_SCEXTRAPPA3_bm  (1<<3)  /* Enable extra pmos calibration P1 A bit 3 mask. */
#define CTE_SCEXTRAPPA3_bp  3  /* Enable extra pmos calibration P1 A bit 3 position. */
#define CTE_SCEXTRAPPB_gm  0xF0  /* Enable extra pmos calibration P1 B group mask. */
#define CTE_SCEXTRAPPB_gp  4  /* Enable extra pmos calibration P1 B group position. */
#define CTE_SCEXTRAPPB0_bm  (1<<4)  /* Enable extra pmos calibration P1 B bit 0 mask. */
#define CTE_SCEXTRAPPB0_bp  4  /* Enable extra pmos calibration P1 B bit 0 position. */
#define CTE_SCEXTRAPPB1_bm  (1<<5)  /* Enable extra pmos calibration P1 B bit 1 mask. */
#define CTE_SCEXTRAPPB1_bp  5  /* Enable extra pmos calibration P1 B bit 1 position. */
#define CTE_SCEXTRAPPB2_bm  (1<<6)  /* Enable extra pmos calibration P1 B bit 2 mask. */
#define CTE_SCEXTRAPPB2_bp  6  /* Enable extra pmos calibration P1 B bit 2 position. */
#define CTE_SCEXTRAPPB3_bm  (1<<7)  /* Enable extra pmos calibration P1 B bit 3 mask. */
#define CTE_SCEXTRAPPB3_bp  7  /* Enable extra pmos calibration P1 B bit 3 position. */
#define CTE_SCEXTRANPA_gm  0xF00  /* Enable extra nmos calibration P1 A group mask. */
#define CTE_SCEXTRANPA_gp  8  /* Enable extra nmos calibration P1 A group position. */
#define CTE_SCEXTRANPA0_bm  (1<<8)  /* Enable extra nmos calibration P1 A bit 0 mask. */
#define CTE_SCEXTRANPA0_bp  8  /* Enable extra nmos calibration P1 A bit 0 position. */
#define CTE_SCEXTRANPA1_bm  (1<<9)  /* Enable extra nmos calibration P1 A bit 1 mask. */
#define CTE_SCEXTRANPA1_bp  9  /* Enable extra nmos calibration P1 A bit 1 position. */
#define CTE_SCEXTRANPA2_bm  (1<<10)  /* Enable extra nmos calibration P1 A bit 2 mask. */
#define CTE_SCEXTRANPA2_bp  10  /* Enable extra nmos calibration P1 A bit 2 position. */
#define CTE_SCEXTRANPA3_bm  (1<<11)  /* Enable extra nmos calibration P1 A bit 3 mask. */
#define CTE_SCEXTRANPA3_bp  11  /* Enable extra nmos calibration P1 A bit 3 position. */
#define CTE_SCEXTRANPB_gm  0xF000  /* Enable extra nmos calibration P1 B group mask. */
#define CTE_SCEXTRANPB_gp  12  /* Enable extra nmos calibration P1 B group position. */
#define CTE_SCEXTRANPB0_bm  (1<<12)  /* Enable extra nmos calibration P1 B bit 0 mask. */
#define CTE_SCEXTRANPB0_bp  12  /* Enable extra nmos calibration P1 B bit 0 position. */
#define CTE_SCEXTRANPB1_bm  (1<<13)  /* Enable extra nmos calibration P1 B bit 1 mask. */
#define CTE_SCEXTRANPB1_bp  13  /* Enable extra nmos calibration P1 B bit 1 position. */
#define CTE_SCEXTRANPB2_bm  (1<<14)  /* Enable extra nmos calibration P1 B bit 2 mask. */
#define CTE_SCEXTRANPB2_bp  14  /* Enable extra nmos calibration P1 B bit 2 position. */
#define CTE_SCEXTRANPB3_bm  (1<<15)  /* Enable extra nmos calibration P1 B bit 3 mask. */
#define CTE_SCEXTRANPB3_bp  15  /* Enable extra nmos calibration P1 B bit 3 position. */

/* CTE.PADSCCP  bit masks and bit positions */
#define CTE_PADSCPCP_gm  0x1F  /* Pad Self Cap Control Registers P C P group mask. */
#define CTE_PADSCPCP_gp  0  /* Pad Self Cap Control Registers P C P group position. */
#define CTE_PADSCPCP0_bm  (1<<0)  /* Pad Self Cap Control Registers P C P bit 0 mask. */
#define CTE_PADSCPCP0_bp  0  /* Pad Self Cap Control Registers P C P bit 0 position. */
#define CTE_PADSCPCP1_bm  (1<<1)  /* Pad Self Cap Control Registers P C P bit 1 mask. */
#define CTE_PADSCPCP1_bp  1  /* Pad Self Cap Control Registers P C P bit 1 position. */
#define CTE_PADSCPCP2_bm  (1<<2)  /* Pad Self Cap Control Registers P C P bit 2 mask. */
#define CTE_PADSCPCP2_bp  2  /* Pad Self Cap Control Registers P C P bit 2 position. */
#define CTE_PADSCPCP3_bm  (1<<3)  /* Pad Self Cap Control Registers P C P bit 3 mask. */
#define CTE_PADSCPCP3_bp  3  /* Pad Self Cap Control Registers P C P bit 3 position. */
#define CTE_PADSCPCP4_bm  (1<<4)  /* Pad Self Cap Control Registers P C P bit 4 mask. */
#define CTE_PADSCPCP4_bp  4  /* Pad Self Cap Control Registers P C P bit 4 position. */
#define CTE_PADSCPRANGECP_bm  0x20  /* Pad Selfcap Range P C P bit mask. */
#define CTE_PADSCPRANGECP_bp  5  /* Pad Selfcap Range P C P bit position. */
#define CTE_PADSCPCN_gm  0x1F00  /* Pad Self Cap Control Registers P C N group mask. */
#define CTE_PADSCPCN_gp  8  /* Pad Self Cap Control Registers P C N group position. */
#define CTE_PADSCPCN0_bm  (1<<8)  /* Pad Self Cap Control Registers P C N bit 0 mask. */
#define CTE_PADSCPCN0_bp  8  /* Pad Self Cap Control Registers P C N bit 0 position. */
#define CTE_PADSCPCN1_bm  (1<<9)  /* Pad Self Cap Control Registers P C N bit 1 mask. */
#define CTE_PADSCPCN1_bp  9  /* Pad Self Cap Control Registers P C N bit 1 position. */
#define CTE_PADSCPCN2_bm  (1<<10)  /* Pad Self Cap Control Registers P C N bit 2 mask. */
#define CTE_PADSCPCN2_bp  10  /* Pad Self Cap Control Registers P C N bit 2 position. */
#define CTE_PADSCPCN3_bm  (1<<11)  /* Pad Self Cap Control Registers P C N bit 3 mask. */
#define CTE_PADSCPCN3_bp  11  /* Pad Self Cap Control Registers P C N bit 3 position. */
#define CTE_PADSCPCN4_bm  (1<<12)  /* Pad Self Cap Control Registers P C N bit 4 mask. */
#define CTE_PADSCPCN4_bp  12  /* Pad Self Cap Control Registers P C N bit 4 position. */
#define CTE_PADSCPRANGECN_bm  0x2000  /* Pad Selfcap Range P C N bit mask. */
#define CTE_PADSCPRANGECN_bp  13  /* Pad Selfcap Range P C N bit position. */

