gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADBCX  bit masks and bit positions */
#define CTE_SCBPXC_gm  0x3F  /* Current source pmos calibration X C group mask. */
#define CTE_SCBPXC_gp  0  /* Current source pmos calibration X C group position. */
#define CTE_SCBPXC0_bm  (1<<0)  /* Current source pmos calibration X C bit 0 mask. */
#define CTE_SCBPXC0_bp  0  /* Current source pmos calibration X C bit 0 position. */
#define CTE_SCBPXC1_bm  (1<<1)  /* Current source pmos calibration X C bit 1 mask. */
#define CTE_SCBPXC1_bp  1  /* Current source pmos calibration X C bit 1 position. */
#define CTE_SCBPXC2_bm  (1<<2)  /* Current source pmos calibration X C bit 2 mask. */
#define CTE_SCBPXC2_bp  2  /* Current source pmos calibration X C bit 2 position. */
#define CTE_SCBPXC3_bm  (1<<3)  /* Current source pmos calibration X C bit 3 mask. */
#define CTE_SCBPXC3_bp  3  /* Current source pmos calibration X C bit 3 position. */
#define CTE_SCBPXC4_bm  (1<<4)  /* Current source pmos calibration X C bit 4 mask. */
#define CTE_SCBPXC4_bp  4  /* Current source pmos calibration X C bit 4 position. */
#define CTE_SCBPXC5_bm  (1<<5)  /* Current source pmos calibration X C bit 5 mask. */
#define CTE_SCBPXC5_bp  5  /* Current source pmos calibration X C bit 5 position. */
#define CTE_SCBNXC_gm  0x3F00  /* Current source nmos calibration X C group mask. */
#define CTE_SCBNXC_gp  8  /* Current source nmos calibration X C group position. */
#define CTE_SCBNXC0_bm  (1<<8)  /* Current source nmos calibration X C bit 0 mask. */
#define CTE_SCBNXC0_bp  8  /* Current source nmos calibration X C bit 0 position. */
#define CTE_SCBNXC1_bm  (1<<9)  /* Current source nmos calibration X C bit 1 mask. */
#define CTE_SCBNXC1_bp  9  /* Current source nmos calibration X C bit 1 position. */
#define CTE_SCBNXC2_bm  (1<<10)  /* Current source nmos calibration X C bit 2 mask. */
#define CTE_SCBNXC2_bp  10  /* Current source nmos calibration X C bit 2 position. */
#define CTE_SCBNXC3_bm  (1<<11)  /* Current source nmos calibration X C bit 3 mask. */
#define CTE_SCBNXC3_bp  11  /* Current source nmos calibration X C bit 3 position. */
#define CTE_SCBNXC4_bm  (1<<12)  /* Current source nmos calibration X C bit 4 mask. */
#define CTE_SCBNXC4_bp  12  /* Current source nmos calibration X C bit 4 position. */
#define CTE_SCBNXC5_bm  (1<<13)  /* Current source nmos calibration X C bit 5 mask. */
#define CTE_SCBNXC5_bp  13  /* Current source nmos calibration X C bit 5 position. */

/* CTE.PADCX  bit masks and bit positions */
#define CTE_SCEXTRAPXC_gm  0x0F  /* Enable extra pmos calibration X C group mask. */
#define CTE_SCEXTRAPXC_gp  0  /* Enable extra pmos calibration X C group position. */
#define CTE_SCEXTRAPXC0_bm  (1<<0)  /* Enable extra pmos calibration X C bit 0 mask. */
#define CTE_SCEXTRAPXC0_bp  0  /* Enable extra pmos calibration X C bit 0 position. */
#define CTE_SCEXTRAPXC1_bm  (1<<1)  /* Enable extra pmos calibration X C bit 1 mask. */
#define CTE_SCEXTRAPXC1_bp  1  /* Enable extra pmos calibration X C bit 1 position. */
#define CTE_SCEXTRAPXC2_bm  (1<<2)  /* Enable extra pmos calibration X C bit 2 mask. */
#define CTE_SCEXTRAPXC2_bp  2  /* Enable extra pmos calibration X C bit 2 position. */
#define CTE_SCEXTRAPXC3_bm  (1<<3)  /* Enable extra pmos calibration X C bit 3 mask. */
#define CTE_SCEXTRAPXC3_bp  3  /* Enable extra pmos calibration X C bit 3 position. */
#define CTE_SCEXTRANXC_gm  0xF00  /* Enable extra nmos calibration X C group mask. */
#define CTE_SCEXTRANXC_gp  8  /* Enable extra nmos calibration X C group position. */
#define CTE_SCEXTRANXC0_bm  (1<<8)  /* Enable extra nmos calibration X C bit 0 mask. */
#define CTE_SCEXTRANXC0_bp  8  /* Enable extra nmos calibration X C bit 0 position. */
#define CTE_SCEXTRANXC1_bm  (1<<9)  /* Enable extra nmos calibration X C bit 1 mask. */
#define CTE_SCEXTRANXC1_bp  9  /* Enable extra nmos calibration X C bit 1 position. */
#define CTE_SCEXTRANXC2_bm  (1<<10)  /* Enable extra nmos calibration X C bit 2 mask. */
#define CTE_SCEXTRANXC2_bp  10  /* Enable extra nmos calibration X C bit 2 position. */
#define CTE_SCEXTRANXC3_bm  (1<<11)  /* Enable extra nmos calibration X C bit 3 mask. */
#define CTE_SCEXTRANXC3_bp  11  /* Enable extra nmos calibration X C bit 3 position. */

/* CTE.PADBCY  bit masks and bit positions */
#define CTE_SCBPYC_gm  0x3F  /* Current source pmos calibration Y C group mask. */
#define CTE_SCBPYC_gp  0  /* Current source pmos calibration Y C group position. */
#define CTE_SCBPYC0_bm  (1<<0)  /* Current source pmos calibration Y C bit 0 mask. */
#define CTE_SCBPYC0_bp  0  /* Current source pmos calibration Y C bit 0 position. */
#define CTE_SCBPYC1_bm  (1<<1)  /* Current source pmos calibration Y C bit 1 mask. */
#define CTE_SCBPYC1_bp  1  /* Current source pmos calibration Y C bit 1 position. */
#define CTE_SCBPYC2_bm  (1<<2)  /* Current source pmos calibration Y C bit 2 mask. */
#define CTE_SCBPYC2_bp  2  /* Current source pmos calibration Y C bit 2 position. */
#define CTE_SCBPYC3_bm  (1<<3)  /* Current source pmos calibration Y C bit 3 mask. */
#define CTE_SCBPYC3_bp  3  /* Current source pmos calibration Y C bit 3 position. */
#define CTE_SCBPYC4_bm  (1<<4)  /* Current source pmos calibration Y C bit 4 mask. */
#define CTE_SCBPYC4_bp  4  /* Current source pmos calibration Y C bit 4 position. */
#define CTE_SCBPYC5_bm  (1<<5)  /* Current source pmos calibration Y C bit 5 mask. */
#define CTE_SCBPYC5_bp  5  /* Current source pmos calibration Y C bit 5 position. */
#define CTE_SCBNYC_gm  0x3F00  /* Current source nmos calibration Y C group mask. */
#define CTE_SCBNYC_gp  8  /* Current source nmos calibration Y C group position. */
#define CTE_SCBNYC0_bm  (1<<8)  /* Current source nmos calibration Y C bit 0 mask. */
#define CTE_SCBNYC0_bp  8  /* Current source nmos calibration Y C bit 0 position. */
#define CTE_SCBNYC1_bm  (1<<9)  /* Current source nmos calibration Y C bit 1 mask. */
#define CTE_SCBNYC1_bp  9  /* Current source nmos calibration Y C bit 1 position. */
#define CTE_SCBNYC2_bm  (1<<10)  /* Current source nmos calibration Y C bit 2 mask. */
#define CTE_SCBNYC2_bp  10  /* Current source nmos calibration Y C bit 2 position. */
#define CTE_SCBNYC3_bm  (1<<11)  /* Current source nmos calibration Y C bit 3 mask. */
#define CTE_SCBNYC3_bp  11  /* Current source nmos calibration Y C bit 3 position. */
#define CTE_SCBNYC4_bm  (1<<12)  /* Current source nmos calibration Y C bit 4 mask. */
#define CTE_SCBNYC4_bp  12  /* Current source nmos calibration Y C bit 4 position. */
#define CTE_SCBNYC5_bm  (1<<13)  /* Current source nmos calibration Y C bit 5 mask. */
#define CTE_SCBNYC5_bp  13  /* Current source nmos calibration Y C bit 5 position. */

/* CTE.PADCY  bit masks and bit positions */
#define CTE_SCEXTRAPYC_gm  0x0F  /* Enable extra pmos calibration Y C group mask. */
#define CTE_SCEXTRAPYC_gp  0  /* Enable extra pmos calibration Y C group position. */
#define CTE_SCEXTRAPYC0_bm  (1<<0)  /* Enable extra pmos calibration Y C bit 0 mask. */
#define CTE_SCEXTRAPYC0_bp  0  /* Enable extra pmos calibration Y C bit 0 position. */
#define CTE_SCEXTRAPYC1_bm  (1<<1)  /* Enable extra pmos calibration Y C bit 1 mask. */
#define CTE_SCEXTRAPYC1_bp  1  /* Enable extra pmos calibration Y C bit 1 position. */
#define CTE_SCEXTRAPYC2_bm  (1<<2)  /* Enable extra pmos calibration Y C bit 2 mask. */
#define CTE_SCEXTRAPYC2_bp  2  /* Enable extra pmos calibration Y C bit 2 position. */
#define CTE_SCEXTRAPYC3_bm  (1<<3)  /* Enable extra pmos calibration Y C bit 3 mask. */
#define CTE_SCEXTRAPYC3_bp  3  /* Enable extra pmos calibration Y C bit 3 position. */
#define CTE_SCEXTRANYC_gm  0xF00  /* Enable extra nmos calibration Y C group mask. */
#define CTE_SCEXTRANYC_gp  8  /* Enable extra nmos calibration Y C group position. */
#define CTE_SCEXTRANYC0_bm  (1<<8)  /* Enable extra nmos calibration Y C bit 0 mask. */
#define CTE_SCEXTRANYC0_bp  8  /* Enable extra nmos calibration Y C bit 0 position. */
#define CTE_SCEXTRANYC1_bm  (1<<9)  /* Enable extra nmos calibration Y C bit 1 mask. */
#define CTE_SCEXTRANYC1_bp  9  /* Enable extra nmos calibration Y C bit 1 position. */
#define CTE_SCEXTRANYC2_bm  (1<<10)  /* Enable extra nmos calibration Y C bit 2 mask. */
#define CTE_SCEXTRANYC2_bp  10  /* Enable extra nmos calibration Y C bit 2 position. */
#define CTE_SCEXTRANYC3_bm  (1<<11)  /* Enable extra nmos calibration Y C bit 3 mask. */
#define CTE_SCEXTRANYC3_bp  11  /* Enable extra nmos calibration Y C bit 3 position. */

/* CTE.PADBCP  bit masks and bit positions */
#define CTE_SCBPPC_gm  0x3F  /* Current source pmos calibration P C group mask. */
#define CTE_SCBPPC_gp  0  /* Current source pmos calibration P C group position. */
#define CTE_SCBPPC0_bm  (1<<0)  /* Current source pmos calibration P C bit 0 mask. */
#define CTE_SCBPPC0_bp  0  /* Current source pmos calibration P C bit 0 position. */
#define CTE_SCBPPC1_bm  (1<<1)  /* Current source pmos calibration P C bit 1 mask. */
#define CTE_SCBPPC1_bp  1  /* Current source pmos calibration P C bit 1 position. */
#define CTE_SCBPPC2_bm  (1<<2)  /* Current source pmos calibration P C bit 2 mask. */
#define CTE_SCBPPC2_bp  2  /* Current source pmos calibration P C bit 2 position. */
#define CTE_SCBPPC3_bm  (1<<3)  /* Current source pmos calibration P C bit 3 mask. */
#define CTE_SCBPPC3_bp  3  /* Current source pmos calibration P C bit 3 position. */
#define CTE_SCBPPC4_bm  (1<<4)  /* Current source pmos calibration P C bit 4 mask. */
#define CTE_SCBPPC4_bp  4  /* Current source pmos calibration P C bit 4 position. */
#define CTE_SCBPPC5_bm  (1<<5)  /* Current source pmos calibration P C bit 5 mask. */
#define CTE_SCBPPC5_bp  5  /* Current source pmos calibration P C bit 5 position. */
#define CTE_SCBNPC_gm  0x3F00  /* Current source nmos calibration P C group mask. */
#define CTE_SCBNPC_gp  8  /* Current source nmos calibration P C group position. */
#define CTE_SCBNPC0_bm  (1<<8)  /* Current source nmos calibration P C bit 0 mask. */
#define CTE_SCBNPC0_bp  8  /* Current source nmos calibration P C bit 0 position. */
#define CTE_SCBNPC1_bm  (1<<9)  /* Current source nmos calibration P C bit 1 mask. */
#define CTE_SCBNPC1_bp  9  /* Current source nmos calibration P C bit 1 position. */
#define CTE_SCBNPC2_bm  (1<<10)  /* Current source nmos calibration P C bit 2 mask. */
#define CTE_SCBNPC2_bp  10  /* Current source nmos calibration P C bit 2 position. */
#define CTE_SCBNPC3_bm  (1<<11)  /* Current source nmos calibration P C bit 3 mask. */
#define CTE_SCBNPC3_bp  11  /* Current source nmos calibration P C bit 3 position. */
#define CTE_SCBNPC4_bm  (1<<12)  /* Current source nmos calibration P C bit 4 mask. */
#define CTE_SCBNPC4_bp  12  /* Current source nmos calibration P C bit 4 position. */
#define CTE_SCBNPC5_bm  (1<<13)  /* Current source nmos calibration P C bit 5 mask. */
#define CTE_SCBNPC5_bp  13  /* Current source nmos calibration P C bit 5 position. */

/* CTE.PADCP  bit masks and bit positions */
#define CTE_SCEXTRAPPC_gm  0x0F  /* Enable extra pmos calibration P C group mask. */
#define CTE_SCEXTRAPPC_gp  0  /* Enable extra pmos calibration P C group position. */
#define CTE_SCEXTRAPPC0_bm  (1<<0)  /* Enable extra pmos calibration P C bit 0 mask. */
#define CTE_SCEXTRAPPC0_bp  0  /* Enable extra pmos calibration P C bit 0 position. */
#define CTE_SCEXTRAPPC1_bm  (1<<1)  /* Enable extra pmos calibration P C bit 1 mask. */
#define CTE_SCEXTRAPPC1_bp  1  /* Enable extra pmos calibration P C bit 1 position. */
#define CTE_SCEXTRAPPC2_bm  (1<<2)  /* Enable extra pmos calibration P C bit 2 mask. */
#define CTE_SCEXTRAPPC2_bp  2  /* Enable extra pmos calibration P C bit 2 position. */
#define CTE_SCEXTRAPPC3_bm  (1<<3)  /* Enable extra pmos calibration P C bit 3 mask. */
#define CTE_SCEXTRAPPC3_bp  3  /* Enable extra pmos calibration P C bit 3 position. */
#define CTE_SCEXTRANPC_gm  0xF00  /* Enable extra nmos calibration P C group mask. */
#define CTE_SCEXTRANPC_gp  8  /* Enable extra nmos calibration P C group position. */
#define CTE_SCEXTRANPC0_bm  (1<<8)  /* Enable extra nmos calibration P C bit 0 mask. */
#define CTE_SCEXTRANPC0_bp  8  /* Enable extra nmos calibration P C bit 0 position. */
#define CTE_SCEXTRANPC1_bm  (1<<9)  /* Enable extra nmos calibration P C bit 1 mask. */
#define CTE_SCEXTRANPC1_bp  9  /* Enable extra nmos calibration P C bit 1 position. */
#define CTE_SCEXTRANPC2_bm  (1<<10)  /* Enable extra nmos calibration P C bit 2 mask. */
#define CTE_SCEXTRANPC2_bp  10  /* Enable extra nmos calibration P C bit 2 position. */
#define CTE_SCEXTRANPC3_bm  (1<<11)  /* Enable extra nmos calibration P C bit 3 mask. */
#define CTE_SCEXTRANPC3_bp  11  /* Enable extra nmos calibration P C bit 3 position. */

