gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PADSCCX0  bit masks and bit positions */
#define CTE_PADSCXCP_gm  0x1F  /* Pad Self Cap Control Registers X C P group mask. */
#define CTE_PADSCXCP_gp  0  /* Pad Self Cap Control Registers X C P group position. */
#define CTE_PADSCXCP0_bm  (1<<0)  /* Pad Self Cap Control Registers X C P bit 0 mask. */
#define CTE_PADSCXCP0_bp  0  /* Pad Self Cap Control Registers X C P bit 0 position. */
#define CTE_PADSCXCP1_bm  (1<<1)  /* Pad Self Cap Control Registers X C P bit 1 mask. */
#define CTE_PADSCXCP1_bp  1  /* Pad Self Cap Control Registers X C P bit 1 position. */
#define CTE_PADSCXCP2_bm  (1<<2)  /* Pad Self Cap Control Registers X C P bit 2 mask. */
#define CTE_PADSCXCP2_bp  2  /* Pad Self Cap Control Registers X C P bit 2 position. */
#define CTE_PADSCXCP3_bm  (1<<3)  /* Pad Self Cap Control Registers X C P bit 3 mask. */
#define CTE_PADSCXCP3_bp  3  /* Pad Self Cap Control Registers X C P bit 3 position. */
#define CTE_PADSCXCP4_bm  (1<<4)  /* Pad Self Cap Control Registers X C P bit 4 mask. */
#define CTE_PADSCXCP4_bp  4  /* Pad Self Cap Control Registers X C P bit 4 position. */
#define CTE_PADSCXRANGECP_bm  0x20  /* Pad Selfcap Range X C P bit mask. */
#define CTE_PADSCXRANGECP_bp  5  /* Pad Selfcap Range X C P bit position. */
#define CTE_PADSCXCN_gm  0x1F00  /* Pad Self Cap Control Registers X C N group mask. */
#define CTE_PADSCXCN_gp  8  /* Pad Self Cap Control Registers X C N group position. */
#define CTE_PADSCXCN0_bm  (1<<8)  /* Pad Self Cap Control Registers X C N bit 0 mask. */
#define CTE_PADSCXCN0_bp  8  /* Pad Self Cap Control Registers X C N bit 0 position. */
#define CTE_PADSCXCN1_bm  (1<<9)  /* Pad Self Cap Control Registers X C N bit 1 mask. */
#define CTE_PADSCXCN1_bp  9  /* Pad Self Cap Control Registers X C N bit 1 position. */
#define CTE_PADSCXCN2_bm  (1<<10)  /* Pad Self Cap Control Registers X C N bit 2 mask. */
#define CTE_PADSCXCN2_bp  10  /* Pad Self Cap Control Registers X C N bit 2 position. */
#define CTE_PADSCXCN3_bm  (1<<11)  /* Pad Self Cap Control Registers X C N bit 3 mask. */
#define CTE_PADSCXCN3_bp  11  /* Pad Self Cap Control Registers X C N bit 3 position. */
#define CTE_PADSCXCN4_bm  (1<<12)  /* Pad Self Cap Control Registers X C N bit 4 mask. */
#define CTE_PADSCXCN4_bp  12  /* Pad Self Cap Control Registers X C N bit 4 position. */
#define CTE_PADSCXRANGECN_bm  0x2000  /* Pad Selfcap Range X C N bit mask. */
#define CTE_PADSCXRANGECN_bp  13  /* Pad Selfcap Range X C N bit position. */

/* CTE.PADSCCX13  bit masks and bit positions */
/* CTE_PADSCXCP  is already defined. */
/* CTE_PADSCXRANGECP  is already defined. */
/* CTE_PADSCXCN  is already defined. */
/* CTE_PADSCXRANGECN  is already defined. */

/* CTE.PADSCCX29  bit masks and bit positions */
/* CTE_PADSCXCP  is already defined. */
/* CTE_PADSCXRANGECP  is already defined. */
/* CTE_PADSCXCN  is already defined. */
/* CTE_PADSCXRANGECN  is already defined. */

/* CTE.PADSCCY0  bit masks and bit positions */
#define CTE_PADSCYCP_gm  0x1F  /* Pad Self Cap Control Registers Y C P group mask. */
#define CTE_PADSCYCP_gp  0  /* Pad Self Cap Control Registers Y C P group position. */
#define CTE_PADSCYCP0_bm  (1<<0)  /* Pad Self Cap Control Registers Y C P bit 0 mask. */
#define CTE_PADSCYCP0_bp  0  /* Pad Self Cap Control Registers Y C P bit 0 position. */
#define CTE_PADSCYCP1_bm  (1<<1)  /* Pad Self Cap Control Registers Y C P bit 1 mask. */
#define CTE_PADSCYCP1_bp  1  /* Pad Self Cap Control Registers Y C P bit 1 position. */
#define CTE_PADSCYCP2_bm  (1<<2)  /* Pad Self Cap Control Registers Y C P bit 2 mask. */
#define CTE_PADSCYCP2_bp  2  /* Pad Self Cap Control Registers Y C P bit 2 position. */
#define CTE_PADSCYCP3_bm  (1<<3)  /* Pad Self Cap Control Registers Y C P bit 3 mask. */
#define CTE_PADSCYCP3_bp  3  /* Pad Self Cap Control Registers Y C P bit 3 position. */
#define CTE_PADSCYCP4_bm  (1<<4)  /* Pad Self Cap Control Registers Y C P bit 4 mask. */
#define CTE_PADSCYCP4_bp  4  /* Pad Self Cap Control Registers Y C P bit 4 position. */
#define CTE_PADSCYRANGECP_bm  0x20  /* Pad Selfcap Range Y C P bit mask. */
#define CTE_PADSCYRANGECP_bp  5  /* Pad Selfcap Range Y C P bit position. */
#define CTE_PADSCYCN_gm  0x1F00  /* Pad Self Cap Control Registers Y C N group mask. */
#define CTE_PADSCYCN_gp  8  /* Pad Self Cap Control Registers Y C N group position. */
#define CTE_PADSCYCN0_bm  (1<<8)  /* Pad Self Cap Control Registers Y C N bit 0 mask. */
#define CTE_PADSCYCN0_bp  8  /* Pad Self Cap Control Registers Y C N bit 0 position. */
#define CTE_PADSCYCN1_bm  (1<<9)  /* Pad Self Cap Control Registers Y C N bit 1 mask. */
#define CTE_PADSCYCN1_bp  9  /* Pad Self Cap Control Registers Y C N bit 1 position. */
#define CTE_PADSCYCN2_bm  (1<<10)  /* Pad Self Cap Control Registers Y C N bit 2 mask. */
#define CTE_PADSCYCN2_bp  10  /* Pad Self Cap Control Registers Y C N bit 2 position. */
#define CTE_PADSCYCN3_bm  (1<<11)  /* Pad Self Cap Control Registers Y C N bit 3 mask. */
#define CTE_PADSCYCN3_bp  11  /* Pad Self Cap Control Registers Y C N bit 3 position. */
#define CTE_PADSCYCN4_bm  (1<<12)  /* Pad Self Cap Control Registers Y C N bit 4 mask. */
#define CTE_PADSCYCN4_bp  12  /* Pad Self Cap Control Registers Y C N bit 4 position. */
#define CTE_PADSCYRANGECN_bm  0x2000  /* Pad Selfcap Range Y C N bit mask. */
#define CTE_PADSCYRANGECN_bp  13  /* Pad Selfcap Range Y C N bit position. */

/* CTE.PADSCCY12  bit masks and bit positions */
/* CTE_PADSCYCP  is already defined. */
/* CTE_PADSCYRANGECP  is already defined. */
/* CTE_PADSCYCN  is already defined. */
/* CTE_PADSCYRANGECN  is already defined. */

/* CTE.PADSCCY17  bit masks and bit positions */
/* CTE_PADSCYCP  is already defined. */
/* CTE_PADSCYRANGECP  is already defined. */
/* CTE_PADSCYCN  is already defined. */
/* CTE_PADSCYRANGECN  is already defined. */

/* CTE.PADHYONXENA  bit masks and bit positions */
#define CTE_PADHYONXEN_gm  0xFFFF  /* Pad Hot YonX Enable group mask. */
#define CTE_PADHYONXEN_gp  0  /* Pad Hot YonX Enable group position. */
#define CTE_PADHYONXEN0_bm  (1<<0)  /* Pad Hot YonX Enable bit 0 mask. */
#define CTE_PADHYONXEN0_bp  0  /* Pad Hot YonX Enable bit 0 position. */
#define CTE_PADHYONXEN1_bm  (1<<1)  /* Pad Hot YonX Enable bit 1 mask. */
#define CTE_PADHYONXEN1_bp  1  /* Pad Hot YonX Enable bit 1 position. */
#define CTE_PADHYONXEN2_bm  (1<<2)  /* Pad Hot YonX Enable bit 2 mask. */
#define CTE_PADHYONXEN2_bp  2  /* Pad Hot YonX Enable bit 2 position. */
#define CTE_PADHYONXEN3_bm  (1<<3)  /* Pad Hot YonX Enable bit 3 mask. */
#define CTE_PADHYONXEN3_bp  3  /* Pad Hot YonX Enable bit 3 position. */
#define CTE_PADHYONXEN4_bm  (1<<4)  /* Pad Hot YonX Enable bit 4 mask. */
#define CTE_PADHYONXEN4_bp  4  /* Pad Hot YonX Enable bit 4 position. */
#define CTE_PADHYONXEN5_bm  (1<<5)  /* Pad Hot YonX Enable bit 5 mask. */
#define CTE_PADHYONXEN5_bp  5  /* Pad Hot YonX Enable bit 5 position. */
#define CTE_PADHYONXEN6_bm  (1<<6)  /* Pad Hot YonX Enable bit 6 mask. */
#define CTE_PADHYONXEN6_bp  6  /* Pad Hot YonX Enable bit 6 position. */
#define CTE_PADHYONXEN7_bm  (1<<7)  /* Pad Hot YonX Enable bit 7 mask. */
#define CTE_PADHYONXEN7_bp  7  /* Pad Hot YonX Enable bit 7 position. */
#define CTE_PADHYONXEN8_bm  (1<<8)  /* Pad Hot YonX Enable bit 8 mask. */
#define CTE_PADHYONXEN8_bp  8  /* Pad Hot YonX Enable bit 8 position. */
#define CTE_PADHYONXEN9_bm  (1<<9)  /* Pad Hot YonX Enable bit 9 mask. */
#define CTE_PADHYONXEN9_bp  9  /* Pad Hot YonX Enable bit 9 position. */
#define CTE_PADHYONXEN10_bm  (1<<10)  /* Pad Hot YonX Enable bit 10 mask. */
#define CTE_PADHYONXEN10_bp  10  /* Pad Hot YonX Enable bit 10 position. */
#define CTE_PADHYONXEN11_bm  (1<<11)  /* Pad Hot YonX Enable bit 11 mask. */
#define CTE_PADHYONXEN11_bp  11  /* Pad Hot YonX Enable bit 11 position. */
#define CTE_PADHYONXEN12_bm  (1<<12)  /* Pad Hot YonX Enable bit 12 mask. */
#define CTE_PADHYONXEN12_bp  12  /* Pad Hot YonX Enable bit 12 position. */
#define CTE_PADHYONXEN13_bm  (1<<13)  /* Pad Hot YonX Enable bit 13 mask. */
#define CTE_PADHYONXEN13_bp  13  /* Pad Hot YonX Enable bit 13 position. */
#define CTE_PADHYONXEN14_bm  (1<<14)  /* Pad Hot YonX Enable bit 14 mask. */
#define CTE_PADHYONXEN14_bp  14  /* Pad Hot YonX Enable bit 14 position. */
#define CTE_PADHYONXEN15_bm  (1<<15)  /* Pad Hot YonX Enable bit 15 mask. */
#define CTE_PADHYONXEN15_bp  15  /* Pad Hot YonX Enable bit 15 position. */

/* CTE.PADHYONXENB  bit masks and bit positions */
/* CTE_PADHYONXEN  is already defined. */

