gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.GCAFCRA  bit masks and bit positions */
#define CTE_GCAFEN_bm  0x01  /* GCAF Enable bit mask. */
#define CTE_GCAFEN_bp  0  /* GCAF Enable bit position. */
#define CTE_GCAFMEDM_gm  0x0E  /* GCAF Median Mode. group mask. */
#define CTE_GCAFMEDM_gp  1  /* GCAF Median Mode. group position. */
#define CTE_GCAFMEDM0_bm  (1<<1)  /* GCAF Median Mode. bit 0 mask. */
#define CTE_GCAFMEDM0_bp  1  /* GCAF Median Mode. bit 0 position. */
#define CTE_GCAFMEDM1_bm  (1<<2)  /* GCAF Median Mode. bit 1 mask. */
#define CTE_GCAFMEDM1_bp  2  /* GCAF Median Mode. bit 1 position. */
#define CTE_GCAFMEDM2_bm  (1<<3)  /* GCAF Median Mode. bit 2 mask. */
#define CTE_GCAFMEDM2_bp  3  /* GCAF Median Mode. bit 2 position. */
#define CTE_GCAFMCMEN_bm  0x10  /* GCAF Multi-cut Master Enable. bit mask. */
#define CTE_GCAFMCMEN_bp  4  /* GCAF Multi-cut Master Enable. bit position. */
#define CTE_GCAFPCEN_bm  0x20  /* GCAF Pre-cut Enable. bit mask. */
#define CTE_GCAFPCEN_bp  5  /* GCAF Pre-cut Enable. bit position. */
#define CTE_GCAFACCM_gm  0xC0  /* GCAF Accumulator Mode. group mask. */
#define CTE_GCAFACCM_gp  6  /* GCAF Accumulator Mode. group position. */
#define CTE_GCAFACCM0_bm  (1<<6)  /* GCAF Accumulator Mode. bit 0 mask. */
#define CTE_GCAFACCM0_bp  6  /* GCAF Accumulator Mode. bit 0 position. */
#define CTE_GCAFACCM1_bm  (1<<7)  /* GCAF Accumulator Mode. bit 1 mask. */
#define CTE_GCAFACCM1_bp  7  /* GCAF Accumulator Mode. bit 1 position. */
#define CTE_GCAFCNTM_gm  0x300  /* GCAF Count Mode. group mask. */
#define CTE_GCAFCNTM_gp  8  /* GCAF Count Mode. group position. */
#define CTE_GCAFCNTM0_bm  (1<<8)  /* GCAF Count Mode. bit 0 mask. */
#define CTE_GCAFCNTM0_bp  8  /* GCAF Count Mode. bit 0 position. */
#define CTE_GCAFCNTM1_bm  (1<<9)  /* GCAF Count Mode. bit 1 mask. */
#define CTE_GCAFCNTM1_bp  9  /* GCAF Count Mode. bit 1 position. */
#define CTE_GCAFACI_bm  0x400  /* GCAF Accumulator and Counter Initialization. bit mask. */
#define CTE_GCAFACI_bp  10  /* GCAF Accumulator and Counter Initialization. bit position. */
#define CTE_GCAFCUTS_bm  0x800  /* GCAF Sample Cut Store. bit mask. */
#define CTE_GCAFCUTS_bp  11  /* GCAF Sample Cut Store. bit position. */
#define CTE_GCAFGCM_gm  0x7000  /* GCAF Grass Cut Mode. group mask. */
#define CTE_GCAFGCM_gp  12  /* GCAF Grass Cut Mode. group position. */
#define CTE_GCAFGCM0_bm  (1<<12)  /* GCAF Grass Cut Mode. bit 0 mask. */
#define CTE_GCAFGCM0_bp  12  /* GCAF Grass Cut Mode. bit 0 position. */
#define CTE_GCAFGCM1_bm  (1<<13)  /* GCAF Grass Cut Mode. bit 1 mask. */
#define CTE_GCAFGCM1_bp  13  /* GCAF Grass Cut Mode. bit 1 position. */
#define CTE_GCAFGCM2_bm  (1<<14)  /* GCAF Grass Cut Mode. bit 2 mask. */
#define CTE_GCAFGCM2_bp  14  /* GCAF Grass Cut Mode. bit 2 position. */
#define CTE_GCAFNORMMEN_bm  0x8000  /* GCAF Normalization Master Enable bit mask. */
#define CTE_GCAFNORMMEN_bp  15  /* GCAF Normalization Master Enable bit position. */

/* CTE.GCAFCRB  bit masks and bit positions */
#define CTE_GCAFYDIM_gm  0x1F  /* GCAF Y-Dimension group mask. */
#define CTE_GCAFYDIM_gp  0  /* GCAF Y-Dimension group position. */
#define CTE_GCAFYDIM0_bm  (1<<0)  /* GCAF Y-Dimension bit 0 mask. */
#define CTE_GCAFYDIM0_bp  0  /* GCAF Y-Dimension bit 0 position. */
#define CTE_GCAFYDIM1_bm  (1<<1)  /* GCAF Y-Dimension bit 1 mask. */
#define CTE_GCAFYDIM1_bp  1  /* GCAF Y-Dimension bit 1 position. */
#define CTE_GCAFYDIM2_bm  (1<<2)  /* GCAF Y-Dimension bit 2 mask. */
#define CTE_GCAFYDIM2_bp  2  /* GCAF Y-Dimension bit 2 position. */
#define CTE_GCAFYDIM3_bm  (1<<3)  /* GCAF Y-Dimension bit 3 mask. */
#define CTE_GCAFYDIM3_bp  3  /* GCAF Y-Dimension bit 3 position. */
#define CTE_GCAFYDIM4_bm  (1<<4)  /* GCAF Y-Dimension bit 4 mask. */
#define CTE_GCAFYDIM4_bp  4  /* GCAF Y-Dimension bit 4 position. */
#define CTE_GCAFAM_gm  0xE0  /* GCAF Addressing Mode group mask. */
#define CTE_GCAFAM_gp  5  /* GCAF Addressing Mode group position. */
#define CTE_GCAFAM0_bm  (1<<5)  /* GCAF Addressing Mode bit 0 mask. */
#define CTE_GCAFAM0_bp  5  /* GCAF Addressing Mode bit 0 position. */
#define CTE_GCAFAM1_bm  (1<<6)  /* GCAF Addressing Mode bit 1 mask. */
#define CTE_GCAFAM1_bp  6  /* GCAF Addressing Mode bit 1 position. */
#define CTE_GCAFAM2_bm  (1<<7)  /* GCAF Addressing Mode bit 2 mask. */
#define CTE_GCAFAM2_bp  7  /* GCAF Addressing Mode bit 2 position. */
#define CTE_GCAFXDIM_gm  0x3F00  /* GCAF X-Dimension group mask. */
#define CTE_GCAFXDIM_gp  8  /* GCAF X-Dimension group position. */
#define CTE_GCAFXDIM0_bm  (1<<8)  /* GCAF X-Dimension bit 0 mask. */
#define CTE_GCAFXDIM0_bp  8  /* GCAF X-Dimension bit 0 position. */
#define CTE_GCAFXDIM1_bm  (1<<9)  /* GCAF X-Dimension bit 1 mask. */
#define CTE_GCAFXDIM1_bp  9  /* GCAF X-Dimension bit 1 position. */
#define CTE_GCAFXDIM2_bm  (1<<10)  /* GCAF X-Dimension bit 2 mask. */
#define CTE_GCAFXDIM2_bp  10  /* GCAF X-Dimension bit 2 position. */
#define CTE_GCAFXDIM3_bm  (1<<11)  /* GCAF X-Dimension bit 3 mask. */
#define CTE_GCAFXDIM3_bp  11  /* GCAF X-Dimension bit 3 position. */
#define CTE_GCAFXDIM4_bm  (1<<12)  /* GCAF X-Dimension bit 4 mask. */
#define CTE_GCAFXDIM4_bp  12  /* GCAF X-Dimension bit 4 position. */
#define CTE_GCAFXDIM5_bm  (1<<13)  /* GCAF X-Dimension bit 5 mask. */
#define CTE_GCAFXDIM5_bp  13  /* GCAF X-Dimension bit 5 position. */
#define CTE_GCAFNORMSAT_bm  0x4000  /* GCAF Normalization Saturation Enable bit mask. */
#define CTE_GCAFNORMSAT_bp  14  /* GCAF Normalization Saturation Enable bit position. */

/* CTE.GCAFMCENA  bit masks and bit positions */
#define CTE_GCAFMCEN_gm  0xFFFF  /* GCAF Multi-cut enable group mask. */
#define CTE_GCAFMCEN_gp  0  /* GCAF Multi-cut enable group position. */
#define CTE_GCAFMCEN0_bm  (1<<0)  /* GCAF Multi-cut enable bit 0 mask. */
#define CTE_GCAFMCEN0_bp  0  /* GCAF Multi-cut enable bit 0 position. */
#define CTE_GCAFMCEN1_bm  (1<<1)  /* GCAF Multi-cut enable bit 1 mask. */
#define CTE_GCAFMCEN1_bp  1  /* GCAF Multi-cut enable bit 1 position. */
#define CTE_GCAFMCEN2_bm  (1<<2)  /* GCAF Multi-cut enable bit 2 mask. */
#define CTE_GCAFMCEN2_bp  2  /* GCAF Multi-cut enable bit 2 position. */
#define CTE_GCAFMCEN3_bm  (1<<3)  /* GCAF Multi-cut enable bit 3 mask. */
#define CTE_GCAFMCEN3_bp  3  /* GCAF Multi-cut enable bit 3 position. */
#define CTE_GCAFMCEN4_bm  (1<<4)  /* GCAF Multi-cut enable bit 4 mask. */
#define CTE_GCAFMCEN4_bp  4  /* GCAF Multi-cut enable bit 4 position. */
#define CTE_GCAFMCEN5_bm  (1<<5)  /* GCAF Multi-cut enable bit 5 mask. */
#define CTE_GCAFMCEN5_bp  5  /* GCAF Multi-cut enable bit 5 position. */
#define CTE_GCAFMCEN6_bm  (1<<6)  /* GCAF Multi-cut enable bit 6 mask. */
#define CTE_GCAFMCEN6_bp  6  /* GCAF Multi-cut enable bit 6 position. */
#define CTE_GCAFMCEN7_bm  (1<<7)  /* GCAF Multi-cut enable bit 7 mask. */
#define CTE_GCAFMCEN7_bp  7  /* GCAF Multi-cut enable bit 7 position. */
#define CTE_GCAFMCEN8_bm  (1<<8)  /* GCAF Multi-cut enable bit 8 mask. */
#define CTE_GCAFMCEN8_bp  8  /* GCAF Multi-cut enable bit 8 position. */
#define CTE_GCAFMCEN9_bm  (1<<9)  /* GCAF Multi-cut enable bit 9 mask. */
#define CTE_GCAFMCEN9_bp  9  /* GCAF Multi-cut enable bit 9 position. */
#define CTE_GCAFMCEN10_bm  (1<<10)  /* GCAF Multi-cut enable bit 10 mask. */
#define CTE_GCAFMCEN10_bp  10  /* GCAF Multi-cut enable bit 10 position. */
#define CTE_GCAFMCEN11_bm  (1<<11)  /* GCAF Multi-cut enable bit 11 mask. */
#define CTE_GCAFMCEN11_bp  11  /* GCAF Multi-cut enable bit 11 position. */
#define CTE_GCAFMCEN12_bm  (1<<12)  /* GCAF Multi-cut enable bit 12 mask. */
#define CTE_GCAFMCEN12_bp  12  /* GCAF Multi-cut enable bit 12 position. */
#define CTE_GCAFMCEN13_bm  (1<<13)  /* GCAF Multi-cut enable bit 13 mask. */
#define CTE_GCAFMCEN13_bp  13  /* GCAF Multi-cut enable bit 13 position. */
#define CTE_GCAFMCEN14_bm  (1<<14)  /* GCAF Multi-cut enable bit 14 mask. */
#define CTE_GCAFMCEN14_bp  14  /* GCAF Multi-cut enable bit 14 position. */
#define CTE_GCAFMCEN15_bm  (1<<15)  /* GCAF Multi-cut enable bit 15 mask. */
#define CTE_GCAFMCEN15_bp  15  /* GCAF Multi-cut enable bit 15 position. */

/* CTE.GCAFMCENB  bit masks and bit positions */
/* CTE_GCAFMCEN  is already defined. */

/* CTE.GCAFBASELIM  bit masks and bit positions */
#define CTE_GCAFLIM_gm  0xFF  /* GCAF Delta Limit group mask. */
#define CTE_GCAFLIM_gp  0  /* GCAF Delta Limit group position. */
#define CTE_GCAFLIM0_bm  (1<<0)  /* GCAF Delta Limit bit 0 mask. */
#define CTE_GCAFLIM0_bp  0  /* GCAF Delta Limit bit 0 position. */
#define CTE_GCAFLIM1_bm  (1<<1)  /* GCAF Delta Limit bit 1 mask. */
#define CTE_GCAFLIM1_bp  1  /* GCAF Delta Limit bit 1 position. */
#define CTE_GCAFLIM2_bm  (1<<2)  /* GCAF Delta Limit bit 2 mask. */
#define CTE_GCAFLIM2_bp  2  /* GCAF Delta Limit bit 2 position. */
#define CTE_GCAFLIM3_bm  (1<<3)  /* GCAF Delta Limit bit 3 mask. */
#define CTE_GCAFLIM3_bp  3  /* GCAF Delta Limit bit 3 position. */
#define CTE_GCAFLIM4_bm  (1<<4)  /* GCAF Delta Limit bit 4 mask. */
#define CTE_GCAFLIM4_bp  4  /* GCAF Delta Limit bit 4 position. */
#define CTE_GCAFLIM5_bm  (1<<5)  /* GCAF Delta Limit bit 5 mask. */
#define CTE_GCAFLIM5_bp  5  /* GCAF Delta Limit bit 5 position. */
#define CTE_GCAFLIM6_bm  (1<<6)  /* GCAF Delta Limit bit 6 mask. */
#define CTE_GCAFLIM6_bp  6  /* GCAF Delta Limit bit 6 position. */
#define CTE_GCAFLIM7_bm  (1<<7)  /* GCAF Delta Limit bit 7 mask. */
#define CTE_GCAFLIM7_bp  7  /* GCAF Delta Limit bit 7 position. */
#define CTE_GCAFBASE_gm  0xFF00  /* GCAF Base Addess group mask. */
#define CTE_GCAFBASE_gp  8  /* GCAF Base Addess group position. */
#define CTE_GCAFBASE0_bm  (1<<8)  /* GCAF Base Addess bit 0 mask. */
#define CTE_GCAFBASE0_bp  8  /* GCAF Base Addess bit 0 position. */
#define CTE_GCAFBASE1_bm  (1<<9)  /* GCAF Base Addess bit 1 mask. */
#define CTE_GCAFBASE1_bp  9  /* GCAF Base Addess bit 1 position. */
#define CTE_GCAFBASE2_bm  (1<<10)  /* GCAF Base Addess bit 2 mask. */
#define CTE_GCAFBASE2_bp  10  /* GCAF Base Addess bit 2 position. */
#define CTE_GCAFBASE3_bm  (1<<11)  /* GCAF Base Addess bit 3 mask. */
#define CTE_GCAFBASE3_bp  11  /* GCAF Base Addess bit 3 position. */
#define CTE_GCAFBASE4_bm  (1<<12)  /* GCAF Base Addess bit 4 mask. */
#define CTE_GCAFBASE4_bp  12  /* GCAF Base Addess bit 4 position. */
#define CTE_GCAFBASE5_bm  (1<<13)  /* GCAF Base Addess bit 5 mask. */
#define CTE_GCAFBASE5_bp  13  /* GCAF Base Addess bit 5 position. */
#define CTE_GCAFBASE6_bm  (1<<14)  /* GCAF Base Addess bit 6 mask. */
#define CTE_GCAFBASE6_bp  14  /* GCAF Base Addess bit 6 position. */
#define CTE_GCAFBASE7_bm  (1<<15)  /* GCAF Base Addess bit 7 mask. */
#define CTE_GCAFBASE7_bp  15  /* GCAF Base Addess bit 7 position. */

/* CTE.GCAFPCLL  bit masks and bit positions */
#define CTE_GCAFPCLL_gm  0xFFFF  /* GCAF Pre-cut Lower Limit group mask. */
#define CTE_GCAFPCLL_gp  0  /* GCAF Pre-cut Lower Limit group position. */
#define CTE_GCAFPCLL0_bm  (1<<0)  /* GCAF Pre-cut Lower Limit bit 0 mask. */
#define CTE_GCAFPCLL0_bp  0  /* GCAF Pre-cut Lower Limit bit 0 position. */
#define CTE_GCAFPCLL1_bm  (1<<1)  /* GCAF Pre-cut Lower Limit bit 1 mask. */
#define CTE_GCAFPCLL1_bp  1  /* GCAF Pre-cut Lower Limit bit 1 position. */
#define CTE_GCAFPCLL2_bm  (1<<2)  /* GCAF Pre-cut Lower Limit bit 2 mask. */
#define CTE_GCAFPCLL2_bp  2  /* GCAF Pre-cut Lower Limit bit 2 position. */
#define CTE_GCAFPCLL3_bm  (1<<3)  /* GCAF Pre-cut Lower Limit bit 3 mask. */
#define CTE_GCAFPCLL3_bp  3  /* GCAF Pre-cut Lower Limit bit 3 position. */
#define CTE_GCAFPCLL4_bm  (1<<4)  /* GCAF Pre-cut Lower Limit bit 4 mask. */
#define CTE_GCAFPCLL4_bp  4  /* GCAF Pre-cut Lower Limit bit 4 position. */
#define CTE_GCAFPCLL5_bm  (1<<5)  /* GCAF Pre-cut Lower Limit bit 5 mask. */
#define CTE_GCAFPCLL5_bp  5  /* GCAF Pre-cut Lower Limit bit 5 position. */
#define CTE_GCAFPCLL6_bm  (1<<6)  /* GCAF Pre-cut Lower Limit bit 6 mask. */
#define CTE_GCAFPCLL6_bp  6  /* GCAF Pre-cut Lower Limit bit 6 position. */
#define CTE_GCAFPCLL7_bm  (1<<7)  /* GCAF Pre-cut Lower Limit bit 7 mask. */
#define CTE_GCAFPCLL7_bp  7  /* GCAF Pre-cut Lower Limit bit 7 position. */
#define CTE_GCAFPCLL8_bm  (1<<8)  /* GCAF Pre-cut Lower Limit bit 8 mask. */
#define CTE_GCAFPCLL8_bp  8  /* GCAF Pre-cut Lower Limit bit 8 position. */
#define CTE_GCAFPCLL9_bm  (1<<9)  /* GCAF Pre-cut Lower Limit bit 9 mask. */
#define CTE_GCAFPCLL9_bp  9  /* GCAF Pre-cut Lower Limit bit 9 position. */
#define CTE_GCAFPCLL10_bm  (1<<10)  /* GCAF Pre-cut Lower Limit bit 10 mask. */
#define CTE_GCAFPCLL10_bp  10  /* GCAF Pre-cut Lower Limit bit 10 position. */
#define CTE_GCAFPCLL11_bm  (1<<11)  /* GCAF Pre-cut Lower Limit bit 11 mask. */
#define CTE_GCAFPCLL11_bp  11  /* GCAF Pre-cut Lower Limit bit 11 position. */
#define CTE_GCAFPCLL12_bm  (1<<12)  /* GCAF Pre-cut Lower Limit bit 12 mask. */
#define CTE_GCAFPCLL12_bp  12  /* GCAF Pre-cut Lower Limit bit 12 position. */
#define CTE_GCAFPCLL13_bm  (1<<13)  /* GCAF Pre-cut Lower Limit bit 13 mask. */
#define CTE_GCAFPCLL13_bp  13  /* GCAF Pre-cut Lower Limit bit 13 position. */
#define CTE_GCAFPCLL14_bm  (1<<14)  /* GCAF Pre-cut Lower Limit bit 14 mask. */
#define CTE_GCAFPCLL14_bp  14  /* GCAF Pre-cut Lower Limit bit 14 position. */
#define CTE_GCAFPCLL15_bm  (1<<15)  /* GCAF Pre-cut Lower Limit bit 15 mask. */
#define CTE_GCAFPCLL15_bp  15  /* GCAF Pre-cut Lower Limit bit 15 position. */

/* CTE.GCAFPCUL  bit masks and bit positions */
#define CTE_GCAFPCUL_gm  0xFFFF  /* GCAF Pre-cut Upper Limit group mask. */
#define CTE_GCAFPCUL_gp  0  /* GCAF Pre-cut Upper Limit group position. */
#define CTE_GCAFPCUL0_bm  (1<<0)  /* GCAF Pre-cut Upper Limit bit 0 mask. */
#define CTE_GCAFPCUL0_bp  0  /* GCAF Pre-cut Upper Limit bit 0 position. */
#define CTE_GCAFPCUL1_bm  (1<<1)  /* GCAF Pre-cut Upper Limit bit 1 mask. */
#define CTE_GCAFPCUL1_bp  1  /* GCAF Pre-cut Upper Limit bit 1 position. */
#define CTE_GCAFPCUL2_bm  (1<<2)  /* GCAF Pre-cut Upper Limit bit 2 mask. */
#define CTE_GCAFPCUL2_bp  2  /* GCAF Pre-cut Upper Limit bit 2 position. */
#define CTE_GCAFPCUL3_bm  (1<<3)  /* GCAF Pre-cut Upper Limit bit 3 mask. */
#define CTE_GCAFPCUL3_bp  3  /* GCAF Pre-cut Upper Limit bit 3 position. */
#define CTE_GCAFPCUL4_bm  (1<<4)  /* GCAF Pre-cut Upper Limit bit 4 mask. */
#define CTE_GCAFPCUL4_bp  4  /* GCAF Pre-cut Upper Limit bit 4 position. */
#define CTE_GCAFPCUL5_bm  (1<<5)  /* GCAF Pre-cut Upper Limit bit 5 mask. */
#define CTE_GCAFPCUL5_bp  5  /* GCAF Pre-cut Upper Limit bit 5 position. */
#define CTE_GCAFPCUL6_bm  (1<<6)  /* GCAF Pre-cut Upper Limit bit 6 mask. */
#define CTE_GCAFPCUL6_bp  6  /* GCAF Pre-cut Upper Limit bit 6 position. */
#define CTE_GCAFPCUL7_bm  (1<<7)  /* GCAF Pre-cut Upper Limit bit 7 mask. */
#define CTE_GCAFPCUL7_bp  7  /* GCAF Pre-cut Upper Limit bit 7 position. */
#define CTE_GCAFPCUL8_bm  (1<<8)  /* GCAF Pre-cut Upper Limit bit 8 mask. */
#define CTE_GCAFPCUL8_bp  8  /* GCAF Pre-cut Upper Limit bit 8 position. */
#define CTE_GCAFPCUL9_bm  (1<<9)  /* GCAF Pre-cut Upper Limit bit 9 mask. */
#define CTE_GCAFPCUL9_bp  9  /* GCAF Pre-cut Upper Limit bit 9 position. */
#define CTE_GCAFPCUL10_bm  (1<<10)  /* GCAF Pre-cut Upper Limit bit 10 mask. */
#define CTE_GCAFPCUL10_bp  10  /* GCAF Pre-cut Upper Limit bit 10 position. */
#define CTE_GCAFPCUL11_bm  (1<<11)  /* GCAF Pre-cut Upper Limit bit 11 mask. */
#define CTE_GCAFPCUL11_bp  11  /* GCAF Pre-cut Upper Limit bit 11 position. */
#define CTE_GCAFPCUL12_bm  (1<<12)  /* GCAF Pre-cut Upper Limit bit 12 mask. */
#define CTE_GCAFPCUL12_bp  12  /* GCAF Pre-cut Upper Limit bit 12 position. */
#define CTE_GCAFPCUL13_bm  (1<<13)  /* GCAF Pre-cut Upper Limit bit 13 mask. */
#define CTE_GCAFPCUL13_bp  13  /* GCAF Pre-cut Upper Limit bit 13 position. */
#define CTE_GCAFPCUL14_bm  (1<<14)  /* GCAF Pre-cut Upper Limit bit 14 mask. */
#define CTE_GCAFPCUL14_bp  14  /* GCAF Pre-cut Upper Limit bit 14 position. */
#define CTE_GCAFPCUL15_bm  (1<<15)  /* GCAF Pre-cut Upper Limit bit 15 mask. */
#define CTE_GCAFPCUL15_bp  15  /* GCAF Pre-cut Upper Limit bit 15 position. */

/* CTE.GCAFWFCR  bit masks and bit positions */
#define CTE_GCAFWFEN_bm  0x01  /* GCAF Window Function Enable bit mask. */
#define CTE_GCAFWFEN_bp  0  /* GCAF Window Function Enable bit position. */
#define CTE_GCAFWFSEL_bm  0x02  /* GCAF Window Function Select bit mask. */
#define CTE_GCAFWFSEL_bp  1  /* GCAF Window Function Select bit position. */
#define CTE_GCAFWFLEN_gm  0x3C  /* GCAF Window Function Length group mask. */
#define CTE_GCAFWFLEN_gp  2  /* GCAF Window Function Length group position. */
#define CTE_GCAFWFLEN0_bm  (1<<2)  /* GCAF Window Function Length bit 0 mask. */
#define CTE_GCAFWFLEN0_bp  2  /* GCAF Window Function Length bit 0 position. */
#define CTE_GCAFWFLEN1_bm  (1<<3)  /* GCAF Window Function Length bit 1 mask. */
#define CTE_GCAFWFLEN1_bp  3  /* GCAF Window Function Length bit 1 position. */
#define CTE_GCAFWFLEN2_bm  (1<<4)  /* GCAF Window Function Length bit 2 mask. */
#define CTE_GCAFWFLEN2_bp  4  /* GCAF Window Function Length bit 2 position. */
#define CTE_GCAFWFLEN3_bm  (1<<5)  /* GCAF Window Function Length bit 3 mask. */
#define CTE_GCAFWFLEN3_bp  5  /* GCAF Window Function Length bit 3 position. */

/* CTE.GCAFADCMIN  bit masks and bit positions */
#define CTE_GCAFADCMIN_gm  0x3FF  /* GCAF Minimum ADC Result group mask. */
#define CTE_GCAFADCMIN_gp  0  /* GCAF Minimum ADC Result group position. */
#define CTE_GCAFADCMIN0_bm  (1<<0)  /* GCAF Minimum ADC Result bit 0 mask. */
#define CTE_GCAFADCMIN0_bp  0  /* GCAF Minimum ADC Result bit 0 position. */
#define CTE_GCAFADCMIN1_bm  (1<<1)  /* GCAF Minimum ADC Result bit 1 mask. */
#define CTE_GCAFADCMIN1_bp  1  /* GCAF Minimum ADC Result bit 1 position. */
#define CTE_GCAFADCMIN2_bm  (1<<2)  /* GCAF Minimum ADC Result bit 2 mask. */
#define CTE_GCAFADCMIN2_bp  2  /* GCAF Minimum ADC Result bit 2 position. */
#define CTE_GCAFADCMIN3_bm  (1<<3)  /* GCAF Minimum ADC Result bit 3 mask. */
#define CTE_GCAFADCMIN3_bp  3  /* GCAF Minimum ADC Result bit 3 position. */
#define CTE_GCAFADCMIN4_bm  (1<<4)  /* GCAF Minimum ADC Result bit 4 mask. */
#define CTE_GCAFADCMIN4_bp  4  /* GCAF Minimum ADC Result bit 4 position. */
#define CTE_GCAFADCMIN5_bm  (1<<5)  /* GCAF Minimum ADC Result bit 5 mask. */
#define CTE_GCAFADCMIN5_bp  5  /* GCAF Minimum ADC Result bit 5 position. */
#define CTE_GCAFADCMIN6_bm  (1<<6)  /* GCAF Minimum ADC Result bit 6 mask. */
#define CTE_GCAFADCMIN6_bp  6  /* GCAF Minimum ADC Result bit 6 position. */
#define CTE_GCAFADCMIN7_bm  (1<<7)  /* GCAF Minimum ADC Result bit 7 mask. */
#define CTE_GCAFADCMIN7_bp  7  /* GCAF Minimum ADC Result bit 7 position. */
#define CTE_GCAFADCMIN8_bm  (1<<8)  /* GCAF Minimum ADC Result bit 8 mask. */
#define CTE_GCAFADCMIN8_bp  8  /* GCAF Minimum ADC Result bit 8 position. */
#define CTE_GCAFADCMIN9_bm  (1<<9)  /* GCAF Minimum ADC Result bit 9 mask. */
#define CTE_GCAFADCMIN9_bp  9  /* GCAF Minimum ADC Result bit 9 position. */

/* CTE.GCAFADCMAX  bit masks and bit positions */
#define CTE_GCAFADCMAX_gm  0x3FF  /* GCAF Maximum ADC Result group mask. */
#define CTE_GCAFADCMAX_gp  0  /* GCAF Maximum ADC Result group position. */
#define CTE_GCAFADCMAX0_bm  (1<<0)  /* GCAF Maximum ADC Result bit 0 mask. */
#define CTE_GCAFADCMAX0_bp  0  /* GCAF Maximum ADC Result bit 0 position. */
#define CTE_GCAFADCMAX1_bm  (1<<1)  /* GCAF Maximum ADC Result bit 1 mask. */
#define CTE_GCAFADCMAX1_bp  1  /* GCAF Maximum ADC Result bit 1 position. */
#define CTE_GCAFADCMAX2_bm  (1<<2)  /* GCAF Maximum ADC Result bit 2 mask. */
#define CTE_GCAFADCMAX2_bp  2  /* GCAF Maximum ADC Result bit 2 position. */
#define CTE_GCAFADCMAX3_bm  (1<<3)  /* GCAF Maximum ADC Result bit 3 mask. */
#define CTE_GCAFADCMAX3_bp  3  /* GCAF Maximum ADC Result bit 3 position. */
#define CTE_GCAFADCMAX4_bm  (1<<4)  /* GCAF Maximum ADC Result bit 4 mask. */
#define CTE_GCAFADCMAX4_bp  4  /* GCAF Maximum ADC Result bit 4 position. */
#define CTE_GCAFADCMAX5_bm  (1<<5)  /* GCAF Maximum ADC Result bit 5 mask. */
#define CTE_GCAFADCMAX5_bp  5  /* GCAF Maximum ADC Result bit 5 position. */
#define CTE_GCAFADCMAX6_bm  (1<<6)  /* GCAF Maximum ADC Result bit 6 mask. */
#define CTE_GCAFADCMAX6_bp  6  /* GCAF Maximum ADC Result bit 6 position. */
#define CTE_GCAFADCMAX7_bm  (1<<7)  /* GCAF Maximum ADC Result bit 7 mask. */
#define CTE_GCAFADCMAX7_bp  7  /* GCAF Maximum ADC Result bit 7 position. */
#define CTE_GCAFADCMAX8_bm  (1<<8)  /* GCAF Maximum ADC Result bit 8 mask. */
#define CTE_GCAFADCMAX8_bp  8  /* GCAF Maximum ADC Result bit 8 position. */
#define CTE_GCAFADCMAX9_bm  (1<<9)  /* GCAF Maximum ADC Result bit 9 mask. */
#define CTE_GCAFADCMAX9_bp  9  /* GCAF Maximum ADC Result bit 9 position. */

/* CTE.GCAFNORMEN0A  bit masks and bit positions */
#define CTE_GCAFNORMEN0A_gm  0xFFFF  /*  group mask. */
#define CTE_GCAFNORMEN0A_gp  0  /*  group position. */
#define CTE_GCAFNORMEN0A0_bm  (1<<0)  /*  bit 0 mask. */
#define CTE_GCAFNORMEN0A0_bp  0  /*  bit 0 position. */
#define CTE_GCAFNORMEN0A1_bm  (1<<1)  /*  bit 1 mask. */
#define CTE_GCAFNORMEN0A1_bp  1  /*  bit 1 position. */
#define CTE_GCAFNORMEN0A2_bm  (1<<2)  /*  bit 2 mask. */
#define CTE_GCAFNORMEN0A2_bp  2  /*  bit 2 position. */
#define CTE_GCAFNORMEN0A3_bm  (1<<3)  /*  bit 3 mask. */
#define CTE_GCAFNORMEN0A3_bp  3  /*  bit 3 position. */
#define CTE_GCAFNORMEN0A4_bm  (1<<4)  /*  bit 4 mask. */
#define CTE_GCAFNORMEN0A4_bp  4  /*  bit 4 position. */
#define CTE_GCAFNORMEN0A5_bm  (1<<5)  /*  bit 5 mask. */
#define CTE_GCAFNORMEN0A5_bp  5  /*  bit 5 position. */
#define CTE_GCAFNORMEN0A6_bm  (1<<6)  /*  bit 6 mask. */
#define CTE_GCAFNORMEN0A6_bp  6  /*  bit 6 position. */
#define CTE_GCAFNORMEN0A7_bm  (1<<7)  /*  bit 7 mask. */
#define CTE_GCAFNORMEN0A7_bp  7  /*  bit 7 position. */
#define CTE_GCAFNORMEN0A8_bm  (1<<8)  /*  bit 8 mask. */
#define CTE_GCAFNORMEN0A8_bp  8  /*  bit 8 position. */
#define CTE_GCAFNORMEN0A9_bm  (1<<9)  /*  bit 9 mask. */
#define CTE_GCAFNORMEN0A9_bp  9  /*  bit 9 position. */
#define CTE_GCAFNORMEN0A10_bm  (1<<10)  /*  bit 10 mask. */
#define CTE_GCAFNORMEN0A10_bp  10  /*  bit 10 position. */
#define CTE_GCAFNORMEN0A11_bm  (1<<11)  /*  bit 11 mask. */
#define CTE_GCAFNORMEN0A11_bp  11  /*  bit 11 position. */
#define CTE_GCAFNORMEN0A12_bm  (1<<12)  /*  bit 12 mask. */
#define CTE_GCAFNORMEN0A12_bp  12  /*  bit 12 position. */
#define CTE_GCAFNORMEN0A13_bm  (1<<13)  /*  bit 13 mask. */
#define CTE_GCAFNORMEN0A13_bp  13  /*  bit 13 position. */
#define CTE_GCAFNORMEN0A14_bm  (1<<14)  /*  bit 14 mask. */
#define CTE_GCAFNORMEN0A14_bp  14  /*  bit 14 position. */
#define CTE_GCAFNORMEN0A15_bm  (1<<15)  /*  bit 15 mask. */
#define CTE_GCAFNORMEN0A15_bp  15  /*  bit 15 position. */

