gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.GCAFNORMEN0B  bit masks and bit positions */
#define CTE_GCAFNORMEN0B_gm  0xFFFF  /*  group mask. */
#define CTE_GCAFNORMEN0B_gp  0  /*  group position. */
#define CTE_GCAFNORMEN0B0_bm  (1<<0)  /*  bit 0 mask. */
#define CTE_GCAFNORMEN0B0_bp  0  /*  bit 0 position. */
#define CTE_GCAFNORMEN0B1_bm  (1<<1)  /*  bit 1 mask. */
#define CTE_GCAFNORMEN0B1_bp  1  /*  bit 1 position. */
#define CTE_GCAFNORMEN0B2_bm  (1<<2)  /*  bit 2 mask. */
#define CTE_GCAFNORMEN0B2_bp  2  /*  bit 2 position. */
#define CTE_GCAFNORMEN0B3_bm  (1<<3)  /*  bit 3 mask. */
#define CTE_GCAFNORMEN0B3_bp  3  /*  bit 3 position. */
#define CTE_GCAFNORMEN0B4_bm  (1<<4)  /*  bit 4 mask. */
#define CTE_GCAFNORMEN0B4_bp  4  /*  bit 4 position. */
#define CTE_GCAFNORMEN0B5_bm  (1<<5)  /*  bit 5 mask. */
#define CTE_GCAFNORMEN0B5_bp  5  /*  bit 5 position. */
#define CTE_GCAFNORMEN0B6_bm  (1<<6)  /*  bit 6 mask. */
#define CTE_GCAFNORMEN0B6_bp  6  /*  bit 6 position. */
#define CTE_GCAFNORMEN0B7_bm  (1<<7)  /*  bit 7 mask. */
#define CTE_GCAFNORMEN0B7_bp  7  /*  bit 7 position. */
#define CTE_GCAFNORMEN0B8_bm  (1<<8)  /*  bit 8 mask. */
#define CTE_GCAFNORMEN0B8_bp  8  /*  bit 8 position. */
#define CTE_GCAFNORMEN0B9_bm  (1<<9)  /*  bit 9 mask. */
#define CTE_GCAFNORMEN0B9_bp  9  /*  bit 9 position. */
#define CTE_GCAFNORMEN0B10_bm  (1<<10)  /*  bit 10 mask. */
#define CTE_GCAFNORMEN0B10_bp  10  /*  bit 10 position. */
#define CTE_GCAFNORMEN0B11_bm  (1<<11)  /*  bit 11 mask. */
#define CTE_GCAFNORMEN0B11_bp  11  /*  bit 11 position. */
#define CTE_GCAFNORMEN0B12_bm  (1<<12)  /*  bit 12 mask. */
#define CTE_GCAFNORMEN0B12_bp  12  /*  bit 12 position. */
#define CTE_GCAFNORMEN0B13_bm  (1<<13)  /*  bit 13 mask. */
#define CTE_GCAFNORMEN0B13_bp  13  /*  bit 13 position. */
#define CTE_GCAFNORMEN0B14_bm  (1<<14)  /*  bit 14 mask. */
#define CTE_GCAFNORMEN0B14_bp  14  /*  bit 14 position. */
#define CTE_GCAFNORMEN0B15_bm  (1<<15)  /*  bit 15 mask. */
#define CTE_GCAFNORMEN0B15_bp  15  /*  bit 15 position. */

/* CTE.GCAFNORMEN1A  bit masks and bit positions */
#define CTE_GCAFNORMEN1A_gm  0xFFFF  /*  group mask. */
#define CTE_GCAFNORMEN1A_gp  0  /*  group position. */
#define CTE_GCAFNORMEN1A0_bm  (1<<0)  /*  bit 0 mask. */
#define CTE_GCAFNORMEN1A0_bp  0  /*  bit 0 position. */
#define CTE_GCAFNORMEN1A1_bm  (1<<1)  /*  bit 1 mask. */
#define CTE_GCAFNORMEN1A1_bp  1  /*  bit 1 position. */
#define CTE_GCAFNORMEN1A2_bm  (1<<2)  /*  bit 2 mask. */
#define CTE_GCAFNORMEN1A2_bp  2  /*  bit 2 position. */
#define CTE_GCAFNORMEN1A3_bm  (1<<3)  /*  bit 3 mask. */
#define CTE_GCAFNORMEN1A3_bp  3  /*  bit 3 position. */
#define CTE_GCAFNORMEN1A4_bm  (1<<4)  /*  bit 4 mask. */
#define CTE_GCAFNORMEN1A4_bp  4  /*  bit 4 position. */
#define CTE_GCAFNORMEN1A5_bm  (1<<5)  /*  bit 5 mask. */
#define CTE_GCAFNORMEN1A5_bp  5  /*  bit 5 position. */
#define CTE_GCAFNORMEN1A6_bm  (1<<6)  /*  bit 6 mask. */
#define CTE_GCAFNORMEN1A6_bp  6  /*  bit 6 position. */
#define CTE_GCAFNORMEN1A7_bm  (1<<7)  /*  bit 7 mask. */
#define CTE_GCAFNORMEN1A7_bp  7  /*  bit 7 position. */
#define CTE_GCAFNORMEN1A8_bm  (1<<8)  /*  bit 8 mask. */
#define CTE_GCAFNORMEN1A8_bp  8  /*  bit 8 position. */
#define CTE_GCAFNORMEN1A9_bm  (1<<9)  /*  bit 9 mask. */
#define CTE_GCAFNORMEN1A9_bp  9  /*  bit 9 position. */
#define CTE_GCAFNORMEN1A10_bm  (1<<10)  /*  bit 10 mask. */
#define CTE_GCAFNORMEN1A10_bp  10  /*  bit 10 position. */
#define CTE_GCAFNORMEN1A11_bm  (1<<11)  /*  bit 11 mask. */
#define CTE_GCAFNORMEN1A11_bp  11  /*  bit 11 position. */
#define CTE_GCAFNORMEN1A12_bm  (1<<12)  /*  bit 12 mask. */
#define CTE_GCAFNORMEN1A12_bp  12  /*  bit 12 position. */
#define CTE_GCAFNORMEN1A13_bm  (1<<13)  /*  bit 13 mask. */
#define CTE_GCAFNORMEN1A13_bp  13  /*  bit 13 position. */
#define CTE_GCAFNORMEN1A14_bm  (1<<14)  /*  bit 14 mask. */
#define CTE_GCAFNORMEN1A14_bp  14  /*  bit 14 position. */
#define CTE_GCAFNORMEN1A15_bm  (1<<15)  /*  bit 15 mask. */
#define CTE_GCAFNORMEN1A15_bp  15  /*  bit 15 position. */

/* CTE.GCAFNORMEN1B  bit masks and bit positions */
#define CTE_GCAFNORMEN1B_gm  0xFFFF  /*  group mask. */
#define CTE_GCAFNORMEN1B_gp  0  /*  group position. */
#define CTE_GCAFNORMEN1B0_bm  (1<<0)  /*  bit 0 mask. */
#define CTE_GCAFNORMEN1B0_bp  0  /*  bit 0 position. */
#define CTE_GCAFNORMEN1B1_bm  (1<<1)  /*  bit 1 mask. */
#define CTE_GCAFNORMEN1B1_bp  1  /*  bit 1 position. */
#define CTE_GCAFNORMEN1B2_bm  (1<<2)  /*  bit 2 mask. */
#define CTE_GCAFNORMEN1B2_bp  2  /*  bit 2 position. */
#define CTE_GCAFNORMEN1B3_bm  (1<<3)  /*  bit 3 mask. */
#define CTE_GCAFNORMEN1B3_bp  3  /*  bit 3 position. */
#define CTE_GCAFNORMEN1B4_bm  (1<<4)  /*  bit 4 mask. */
#define CTE_GCAFNORMEN1B4_bp  4  /*  bit 4 position. */
#define CTE_GCAFNORMEN1B5_bm  (1<<5)  /*  bit 5 mask. */
#define CTE_GCAFNORMEN1B5_bp  5  /*  bit 5 position. */
#define CTE_GCAFNORMEN1B6_bm  (1<<6)  /*  bit 6 mask. */
#define CTE_GCAFNORMEN1B6_bp  6  /*  bit 6 position. */
#define CTE_GCAFNORMEN1B7_bm  (1<<7)  /*  bit 7 mask. */
#define CTE_GCAFNORMEN1B7_bp  7  /*  bit 7 position. */
#define CTE_GCAFNORMEN1B8_bm  (1<<8)  /*  bit 8 mask. */
#define CTE_GCAFNORMEN1B8_bp  8  /*  bit 8 position. */
#define CTE_GCAFNORMEN1B9_bm  (1<<9)  /*  bit 9 mask. */
#define CTE_GCAFNORMEN1B9_bp  9  /*  bit 9 position. */
#define CTE_GCAFNORMEN1B10_bm  (1<<10)  /*  bit 10 mask. */
#define CTE_GCAFNORMEN1B10_bp  10  /*  bit 10 position. */
#define CTE_GCAFNORMEN1B11_bm  (1<<11)  /*  bit 11 mask. */
#define CTE_GCAFNORMEN1B11_bp  11  /*  bit 11 position. */
#define CTE_GCAFNORMEN1B12_bm  (1<<12)  /*  bit 12 mask. */
#define CTE_GCAFNORMEN1B12_bp  12  /*  bit 12 position. */
#define CTE_GCAFNORMEN1B13_bm  (1<<13)  /*  bit 13 mask. */
#define CTE_GCAFNORMEN1B13_bp  13  /*  bit 13 position. */
#define CTE_GCAFNORMEN1B14_bm  (1<<14)  /*  bit 14 mask. */
#define CTE_GCAFNORMEN1B14_bp  14  /*  bit 14 position. */
#define CTE_GCAFNORMEN1B15_bm  (1<<15)  /*  bit 15 mask. */
#define CTE_GCAFNORMEN1B15_bp  15  /*  bit 15 position. */

/* CTE.PIFXENA  bit masks and bit positions */
#define CTE_PIFXEN_gm  0xFFFF  /* Port Interface X-line Enable group mask. */
#define CTE_PIFXEN_gp  0  /* Port Interface X-line Enable group position. */
#define CTE_PIFXEN0_bm  (1<<0)  /* Port Interface X-line Enable bit 0 mask. */
#define CTE_PIFXEN0_bp  0  /* Port Interface X-line Enable bit 0 position. */
#define CTE_PIFXEN1_bm  (1<<1)  /* Port Interface X-line Enable bit 1 mask. */
#define CTE_PIFXEN1_bp  1  /* Port Interface X-line Enable bit 1 position. */
#define CTE_PIFXEN2_bm  (1<<2)  /* Port Interface X-line Enable bit 2 mask. */
#define CTE_PIFXEN2_bp  2  /* Port Interface X-line Enable bit 2 position. */
#define CTE_PIFXEN3_bm  (1<<3)  /* Port Interface X-line Enable bit 3 mask. */
#define CTE_PIFXEN3_bp  3  /* Port Interface X-line Enable bit 3 position. */
#define CTE_PIFXEN4_bm  (1<<4)  /* Port Interface X-line Enable bit 4 mask. */
#define CTE_PIFXEN4_bp  4  /* Port Interface X-line Enable bit 4 position. */
#define CTE_PIFXEN5_bm  (1<<5)  /* Port Interface X-line Enable bit 5 mask. */
#define CTE_PIFXEN5_bp  5  /* Port Interface X-line Enable bit 5 position. */
#define CTE_PIFXEN6_bm  (1<<6)  /* Port Interface X-line Enable bit 6 mask. */
#define CTE_PIFXEN6_bp  6  /* Port Interface X-line Enable bit 6 position. */
#define CTE_PIFXEN7_bm  (1<<7)  /* Port Interface X-line Enable bit 7 mask. */
#define CTE_PIFXEN7_bp  7  /* Port Interface X-line Enable bit 7 position. */
#define CTE_PIFXEN8_bm  (1<<8)  /* Port Interface X-line Enable bit 8 mask. */
#define CTE_PIFXEN8_bp  8  /* Port Interface X-line Enable bit 8 position. */
#define CTE_PIFXEN9_bm  (1<<9)  /* Port Interface X-line Enable bit 9 mask. */
#define CTE_PIFXEN9_bp  9  /* Port Interface X-line Enable bit 9 position. */
#define CTE_PIFXEN10_bm  (1<<10)  /* Port Interface X-line Enable bit 10 mask. */
#define CTE_PIFXEN10_bp  10  /* Port Interface X-line Enable bit 10 position. */
#define CTE_PIFXEN11_bm  (1<<11)  /* Port Interface X-line Enable bit 11 mask. */
#define CTE_PIFXEN11_bp  11  /* Port Interface X-line Enable bit 11 position. */
#define CTE_PIFXEN12_bm  (1<<12)  /* Port Interface X-line Enable bit 12 mask. */
#define CTE_PIFXEN12_bp  12  /* Port Interface X-line Enable bit 12 position. */
#define CTE_PIFXEN13_bm  (1<<13)  /* Port Interface X-line Enable bit 13 mask. */
#define CTE_PIFXEN13_bp  13  /* Port Interface X-line Enable bit 13 position. */
#define CTE_PIFXEN14_bm  (1<<14)  /* Port Interface X-line Enable bit 14 mask. */
#define CTE_PIFXEN14_bp  14  /* Port Interface X-line Enable bit 14 position. */
#define CTE_PIFXEN15_bm  (1<<15)  /* Port Interface X-line Enable bit 15 mask. */
#define CTE_PIFXEN15_bp  15  /* Port Interface X-line Enable bit 15 position. */

/* CTE.PIFXENB  bit masks and bit positions */
/* CTE_PIFXEN  is already defined. */

/* CTE.PIFYENA  bit masks and bit positions */
#define CTE_PIFYEN_gm  0xFFFF  /* Port Interface Y-line Enable group mask. */
#define CTE_PIFYEN_gp  0  /* Port Interface Y-line Enable group position. */
#define CTE_PIFYEN0_bm  (1<<0)  /* Port Interface Y-line Enable bit 0 mask. */
#define CTE_PIFYEN0_bp  0  /* Port Interface Y-line Enable bit 0 position. */
#define CTE_PIFYEN1_bm  (1<<1)  /* Port Interface Y-line Enable bit 1 mask. */
#define CTE_PIFYEN1_bp  1  /* Port Interface Y-line Enable bit 1 position. */
#define CTE_PIFYEN2_bm  (1<<2)  /* Port Interface Y-line Enable bit 2 mask. */
#define CTE_PIFYEN2_bp  2  /* Port Interface Y-line Enable bit 2 position. */
#define CTE_PIFYEN3_bm  (1<<3)  /* Port Interface Y-line Enable bit 3 mask. */
#define CTE_PIFYEN3_bp  3  /* Port Interface Y-line Enable bit 3 position. */
#define CTE_PIFYEN4_bm  (1<<4)  /* Port Interface Y-line Enable bit 4 mask. */
#define CTE_PIFYEN4_bp  4  /* Port Interface Y-line Enable bit 4 position. */
#define CTE_PIFYEN5_bm  (1<<5)  /* Port Interface Y-line Enable bit 5 mask. */
#define CTE_PIFYEN5_bp  5  /* Port Interface Y-line Enable bit 5 position. */
#define CTE_PIFYEN6_bm  (1<<6)  /* Port Interface Y-line Enable bit 6 mask. */
#define CTE_PIFYEN6_bp  6  /* Port Interface Y-line Enable bit 6 position. */
#define CTE_PIFYEN7_bm  (1<<7)  /* Port Interface Y-line Enable bit 7 mask. */
#define CTE_PIFYEN7_bp  7  /* Port Interface Y-line Enable bit 7 position. */
#define CTE_PIFYEN8_bm  (1<<8)  /* Port Interface Y-line Enable bit 8 mask. */
#define CTE_PIFYEN8_bp  8  /* Port Interface Y-line Enable bit 8 position. */
#define CTE_PIFYEN9_bm  (1<<9)  /* Port Interface Y-line Enable bit 9 mask. */
#define CTE_PIFYEN9_bp  9  /* Port Interface Y-line Enable bit 9 position. */
#define CTE_PIFYEN10_bm  (1<<10)  /* Port Interface Y-line Enable bit 10 mask. */
#define CTE_PIFYEN10_bp  10  /* Port Interface Y-line Enable bit 10 position. */
#define CTE_PIFYEN11_bm  (1<<11)  /* Port Interface Y-line Enable bit 11 mask. */
#define CTE_PIFYEN11_bp  11  /* Port Interface Y-line Enable bit 11 position. */
#define CTE_PIFYEN12_bm  (1<<12)  /* Port Interface Y-line Enable bit 12 mask. */
#define CTE_PIFYEN12_bp  12  /* Port Interface Y-line Enable bit 12 position. */
#define CTE_PIFYEN13_bm  (1<<13)  /* Port Interface Y-line Enable bit 13 mask. */
#define CTE_PIFYEN13_bp  13  /* Port Interface Y-line Enable bit 13 position. */
#define CTE_PIFYEN14_bm  (1<<14)  /* Port Interface Y-line Enable bit 14 mask. */
#define CTE_PIFYEN14_bp  14  /* Port Interface Y-line Enable bit 14 position. */
#define CTE_PIFYEN15_bm  (1<<15)  /* Port Interface Y-line Enable bit 15 mask. */
#define CTE_PIFYEN15_bp  15  /* Port Interface Y-line Enable bit 15 position. */

/* CTE.PIFYENB  bit masks and bit positions */
/* CTE_PIFYEN  is already defined. */

/* CTE.PIFXPINA  bit masks and bit positions */
#define CTE_PIFXPIN_gm  0xFFFF  /* Port Interface X-lines PIN group mask. */
#define CTE_PIFXPIN_gp  0  /* Port Interface X-lines PIN group position. */
#define CTE_PIFXPIN0_bm  (1<<0)  /* Port Interface X-lines PIN bit 0 mask. */
#define CTE_PIFXPIN0_bp  0  /* Port Interface X-lines PIN bit 0 position. */
#define CTE_PIFXPIN1_bm  (1<<1)  /* Port Interface X-lines PIN bit 1 mask. */
#define CTE_PIFXPIN1_bp  1  /* Port Interface X-lines PIN bit 1 position. */
#define CTE_PIFXPIN2_bm  (1<<2)  /* Port Interface X-lines PIN bit 2 mask. */
#define CTE_PIFXPIN2_bp  2  /* Port Interface X-lines PIN bit 2 position. */
#define CTE_PIFXPIN3_bm  (1<<3)  /* Port Interface X-lines PIN bit 3 mask. */
#define CTE_PIFXPIN3_bp  3  /* Port Interface X-lines PIN bit 3 position. */
#define CTE_PIFXPIN4_bm  (1<<4)  /* Port Interface X-lines PIN bit 4 mask. */
#define CTE_PIFXPIN4_bp  4  /* Port Interface X-lines PIN bit 4 position. */
#define CTE_PIFXPIN5_bm  (1<<5)  /* Port Interface X-lines PIN bit 5 mask. */
#define CTE_PIFXPIN5_bp  5  /* Port Interface X-lines PIN bit 5 position. */
#define CTE_PIFXPIN6_bm  (1<<6)  /* Port Interface X-lines PIN bit 6 mask. */
#define CTE_PIFXPIN6_bp  6  /* Port Interface X-lines PIN bit 6 position. */
#define CTE_PIFXPIN7_bm  (1<<7)  /* Port Interface X-lines PIN bit 7 mask. */
#define CTE_PIFXPIN7_bp  7  /* Port Interface X-lines PIN bit 7 position. */
#define CTE_PIFXPIN8_bm  (1<<8)  /* Port Interface X-lines PIN bit 8 mask. */
#define CTE_PIFXPIN8_bp  8  /* Port Interface X-lines PIN bit 8 position. */
#define CTE_PIFXPIN9_bm  (1<<9)  /* Port Interface X-lines PIN bit 9 mask. */
#define CTE_PIFXPIN9_bp  9  /* Port Interface X-lines PIN bit 9 position. */
#define CTE_PIFXPIN10_bm  (1<<10)  /* Port Interface X-lines PIN bit 10 mask. */
#define CTE_PIFXPIN10_bp  10  /* Port Interface X-lines PIN bit 10 position. */
#define CTE_PIFXPIN11_bm  (1<<11)  /* Port Interface X-lines PIN bit 11 mask. */
#define CTE_PIFXPIN11_bp  11  /* Port Interface X-lines PIN bit 11 position. */
#define CTE_PIFXPIN12_bm  (1<<12)  /* Port Interface X-lines PIN bit 12 mask. */
#define CTE_PIFXPIN12_bp  12  /* Port Interface X-lines PIN bit 12 position. */
#define CTE_PIFXPIN13_bm  (1<<13)  /* Port Interface X-lines PIN bit 13 mask. */
#define CTE_PIFXPIN13_bp  13  /* Port Interface X-lines PIN bit 13 position. */
#define CTE_PIFXPIN14_bm  (1<<14)  /* Port Interface X-lines PIN bit 14 mask. */
#define CTE_PIFXPIN14_bp  14  /* Port Interface X-lines PIN bit 14 position. */
#define CTE_PIFXPIN15_bm  (1<<15)  /* Port Interface X-lines PIN bit 15 mask. */
#define CTE_PIFXPIN15_bp  15  /* Port Interface X-lines PIN bit 15 position. */

/* CTE.PIFXPINB  bit masks and bit positions */
/* CTE_PIFXPIN  is already defined. */

