gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.PIFYPINA  bit masks and bit positions */
#define CTE_PIFYPIN_gm  0xFFFF  /* Port Interface Y-lines PIN group mask. */
#define CTE_PIFYPIN_gp  0  /* Port Interface Y-lines PIN group position. */
#define CTE_PIFYPIN0_bm  (1<<0)  /* Port Interface Y-lines PIN bit 0 mask. */
#define CTE_PIFYPIN0_bp  0  /* Port Interface Y-lines PIN bit 0 position. */
#define CTE_PIFYPIN1_bm  (1<<1)  /* Port Interface Y-lines PIN bit 1 mask. */
#define CTE_PIFYPIN1_bp  1  /* Port Interface Y-lines PIN bit 1 position. */
#define CTE_PIFYPIN2_bm  (1<<2)  /* Port Interface Y-lines PIN bit 2 mask. */
#define CTE_PIFYPIN2_bp  2  /* Port Interface Y-lines PIN bit 2 position. */
#define CTE_PIFYPIN3_bm  (1<<3)  /* Port Interface Y-lines PIN bit 3 mask. */
#define CTE_PIFYPIN3_bp  3  /* Port Interface Y-lines PIN bit 3 position. */
#define CTE_PIFYPIN4_bm  (1<<4)  /* Port Interface Y-lines PIN bit 4 mask. */
#define CTE_PIFYPIN4_bp  4  /* Port Interface Y-lines PIN bit 4 position. */
#define CTE_PIFYPIN5_bm  (1<<5)  /* Port Interface Y-lines PIN bit 5 mask. */
#define CTE_PIFYPIN5_bp  5  /* Port Interface Y-lines PIN bit 5 position. */
#define CTE_PIFYPIN6_bm  (1<<6)  /* Port Interface Y-lines PIN bit 6 mask. */
#define CTE_PIFYPIN6_bp  6  /* Port Interface Y-lines PIN bit 6 position. */
#define CTE_PIFYPIN7_bm  (1<<7)  /* Port Interface Y-lines PIN bit 7 mask. */
#define CTE_PIFYPIN7_bp  7  /* Port Interface Y-lines PIN bit 7 position. */
#define CTE_PIFYPIN8_bm  (1<<8)  /* Port Interface Y-lines PIN bit 8 mask. */
#define CTE_PIFYPIN8_bp  8  /* Port Interface Y-lines PIN bit 8 position. */
#define CTE_PIFYPIN9_bm  (1<<9)  /* Port Interface Y-lines PIN bit 9 mask. */
#define CTE_PIFYPIN9_bp  9  /* Port Interface Y-lines PIN bit 9 position. */
#define CTE_PIFYPIN10_bm  (1<<10)  /* Port Interface Y-lines PIN bit 10 mask. */
#define CTE_PIFYPIN10_bp  10  /* Port Interface Y-lines PIN bit 10 position. */
#define CTE_PIFYPIN11_bm  (1<<11)  /* Port Interface Y-lines PIN bit 11 mask. */
#define CTE_PIFYPIN11_bp  11  /* Port Interface Y-lines PIN bit 11 position. */
#define CTE_PIFYPIN12_bm  (1<<12)  /* Port Interface Y-lines PIN bit 12 mask. */
#define CTE_PIFYPIN12_bp  12  /* Port Interface Y-lines PIN bit 12 position. */
#define CTE_PIFYPIN13_bm  (1<<13)  /* Port Interface Y-lines PIN bit 13 mask. */
#define CTE_PIFYPIN13_bp  13  /* Port Interface Y-lines PIN bit 13 position. */
#define CTE_PIFYPIN14_bm  (1<<14)  /* Port Interface Y-lines PIN bit 14 mask. */
#define CTE_PIFYPIN14_bp  14  /* Port Interface Y-lines PIN bit 14 position. */
#define CTE_PIFYPIN15_bm  (1<<15)  /* Port Interface Y-lines PIN bit 15 mask. */
#define CTE_PIFYPIN15_bp  15  /* Port Interface Y-lines PIN bit 15 position. */

/* CTE.PIFYPINB  bit masks and bit positions */
/* CTE_PIFYPIN  is already defined. */

/* CTE.PIFXSRLA  bit masks and bit positions */
#define CTE_PIFXSRL_gm  0xFFFF  /* Port Interface X-line Slew Rate Limit Enable group mask. */
#define CTE_PIFXSRL_gp  0  /* Port Interface X-line Slew Rate Limit Enable group position. */
#define CTE_PIFXSRL0_bm  (1<<0)  /* Port Interface X-line Slew Rate Limit Enable bit 0 mask. */
#define CTE_PIFXSRL0_bp  0  /* Port Interface X-line Slew Rate Limit Enable bit 0 position. */
#define CTE_PIFXSRL1_bm  (1<<1)  /* Port Interface X-line Slew Rate Limit Enable bit 1 mask. */
#define CTE_PIFXSRL1_bp  1  /* Port Interface X-line Slew Rate Limit Enable bit 1 position. */
#define CTE_PIFXSRL2_bm  (1<<2)  /* Port Interface X-line Slew Rate Limit Enable bit 2 mask. */
#define CTE_PIFXSRL2_bp  2  /* Port Interface X-line Slew Rate Limit Enable bit 2 position. */
#define CTE_PIFXSRL3_bm  (1<<3)  /* Port Interface X-line Slew Rate Limit Enable bit 3 mask. */
#define CTE_PIFXSRL3_bp  3  /* Port Interface X-line Slew Rate Limit Enable bit 3 position. */
#define CTE_PIFXSRL4_bm  (1<<4)  /* Port Interface X-line Slew Rate Limit Enable bit 4 mask. */
#define CTE_PIFXSRL4_bp  4  /* Port Interface X-line Slew Rate Limit Enable bit 4 position. */
#define CTE_PIFXSRL5_bm  (1<<5)  /* Port Interface X-line Slew Rate Limit Enable bit 5 mask. */
#define CTE_PIFXSRL5_bp  5  /* Port Interface X-line Slew Rate Limit Enable bit 5 position. */
#define CTE_PIFXSRL6_bm  (1<<6)  /* Port Interface X-line Slew Rate Limit Enable bit 6 mask. */
#define CTE_PIFXSRL6_bp  6  /* Port Interface X-line Slew Rate Limit Enable bit 6 position. */
#define CTE_PIFXSRL7_bm  (1<<7)  /* Port Interface X-line Slew Rate Limit Enable bit 7 mask. */
#define CTE_PIFXSRL7_bp  7  /* Port Interface X-line Slew Rate Limit Enable bit 7 position. */
#define CTE_PIFXSRL8_bm  (1<<8)  /* Port Interface X-line Slew Rate Limit Enable bit 8 mask. */
#define CTE_PIFXSRL8_bp  8  /* Port Interface X-line Slew Rate Limit Enable bit 8 position. */
#define CTE_PIFXSRL9_bm  (1<<9)  /* Port Interface X-line Slew Rate Limit Enable bit 9 mask. */
#define CTE_PIFXSRL9_bp  9  /* Port Interface X-line Slew Rate Limit Enable bit 9 position. */
#define CTE_PIFXSRL10_bm  (1<<10)  /* Port Interface X-line Slew Rate Limit Enable bit 10 mask. */
#define CTE_PIFXSRL10_bp  10  /* Port Interface X-line Slew Rate Limit Enable bit 10 position. */
#define CTE_PIFXSRL11_bm  (1<<11)  /* Port Interface X-line Slew Rate Limit Enable bit 11 mask. */
#define CTE_PIFXSRL11_bp  11  /* Port Interface X-line Slew Rate Limit Enable bit 11 position. */
#define CTE_PIFXSRL12_bm  (1<<12)  /* Port Interface X-line Slew Rate Limit Enable bit 12 mask. */
#define CTE_PIFXSRL12_bp  12  /* Port Interface X-line Slew Rate Limit Enable bit 12 position. */
#define CTE_PIFXSRL13_bm  (1<<13)  /* Port Interface X-line Slew Rate Limit Enable bit 13 mask. */
#define CTE_PIFXSRL13_bp  13  /* Port Interface X-line Slew Rate Limit Enable bit 13 position. */
#define CTE_PIFXSRL14_bm  (1<<14)  /* Port Interface X-line Slew Rate Limit Enable bit 14 mask. */
#define CTE_PIFXSRL14_bp  14  /* Port Interface X-line Slew Rate Limit Enable bit 14 position. */
#define CTE_PIFXSRL15_bm  (1<<15)  /* Port Interface X-line Slew Rate Limit Enable bit 15 mask. */
#define CTE_PIFXSRL15_bp  15  /* Port Interface X-line Slew Rate Limit Enable bit 15 position. */

/* CTE.PIFXSRLB  bit masks and bit positions */
/* CTE_PIFXSRL  is already defined. */

/* CTE.PIFYSRLA  bit masks and bit positions */
#define CTE_PIFYSRL_gm  0xFFFF  /* Port Interface Y-line Slew Rate Limit Enable group mask. */
#define CTE_PIFYSRL_gp  0  /* Port Interface Y-line Slew Rate Limit Enable group position. */
#define CTE_PIFYSRL0_bm  (1<<0)  /* Port Interface Y-line Slew Rate Limit Enable bit 0 mask. */
#define CTE_PIFYSRL0_bp  0  /* Port Interface Y-line Slew Rate Limit Enable bit 0 position. */
#define CTE_PIFYSRL1_bm  (1<<1)  /* Port Interface Y-line Slew Rate Limit Enable bit 1 mask. */
#define CTE_PIFYSRL1_bp  1  /* Port Interface Y-line Slew Rate Limit Enable bit 1 position. */
#define CTE_PIFYSRL2_bm  (1<<2)  /* Port Interface Y-line Slew Rate Limit Enable bit 2 mask. */
#define CTE_PIFYSRL2_bp  2  /* Port Interface Y-line Slew Rate Limit Enable bit 2 position. */
#define CTE_PIFYSRL3_bm  (1<<3)  /* Port Interface Y-line Slew Rate Limit Enable bit 3 mask. */
#define CTE_PIFYSRL3_bp  3  /* Port Interface Y-line Slew Rate Limit Enable bit 3 position. */
#define CTE_PIFYSRL4_bm  (1<<4)  /* Port Interface Y-line Slew Rate Limit Enable bit 4 mask. */
#define CTE_PIFYSRL4_bp  4  /* Port Interface Y-line Slew Rate Limit Enable bit 4 position. */
#define CTE_PIFYSRL5_bm  (1<<5)  /* Port Interface Y-line Slew Rate Limit Enable bit 5 mask. */
#define CTE_PIFYSRL5_bp  5  /* Port Interface Y-line Slew Rate Limit Enable bit 5 position. */
#define CTE_PIFYSRL6_bm  (1<<6)  /* Port Interface Y-line Slew Rate Limit Enable bit 6 mask. */
#define CTE_PIFYSRL6_bp  6  /* Port Interface Y-line Slew Rate Limit Enable bit 6 position. */
#define CTE_PIFYSRL7_bm  (1<<7)  /* Port Interface Y-line Slew Rate Limit Enable bit 7 mask. */
#define CTE_PIFYSRL7_bp  7  /* Port Interface Y-line Slew Rate Limit Enable bit 7 position. */
#define CTE_PIFYSRL8_bm  (1<<8)  /* Port Interface Y-line Slew Rate Limit Enable bit 8 mask. */
#define CTE_PIFYSRL8_bp  8  /* Port Interface Y-line Slew Rate Limit Enable bit 8 position. */
#define CTE_PIFYSRL9_bm  (1<<9)  /* Port Interface Y-line Slew Rate Limit Enable bit 9 mask. */
#define CTE_PIFYSRL9_bp  9  /* Port Interface Y-line Slew Rate Limit Enable bit 9 position. */
#define CTE_PIFYSRL10_bm  (1<<10)  /* Port Interface Y-line Slew Rate Limit Enable bit 10 mask. */
#define CTE_PIFYSRL10_bp  10  /* Port Interface Y-line Slew Rate Limit Enable bit 10 position. */
#define CTE_PIFYSRL11_bm  (1<<11)  /* Port Interface Y-line Slew Rate Limit Enable bit 11 mask. */
#define CTE_PIFYSRL11_bp  11  /* Port Interface Y-line Slew Rate Limit Enable bit 11 position. */
#define CTE_PIFYSRL12_bm  (1<<12)  /* Port Interface Y-line Slew Rate Limit Enable bit 12 mask. */
#define CTE_PIFYSRL12_bp  12  /* Port Interface Y-line Slew Rate Limit Enable bit 12 position. */
#define CTE_PIFYSRL13_bm  (1<<13)  /* Port Interface Y-line Slew Rate Limit Enable bit 13 mask. */
#define CTE_PIFYSRL13_bp  13  /* Port Interface Y-line Slew Rate Limit Enable bit 13 position. */
#define CTE_PIFYSRL14_bm  (1<<14)  /* Port Interface Y-line Slew Rate Limit Enable bit 14 mask. */
#define CTE_PIFYSRL14_bp  14  /* Port Interface Y-line Slew Rate Limit Enable bit 14 position. */
#define CTE_PIFYSRL15_bm  (1<<15)  /* Port Interface Y-line Slew Rate Limit Enable bit 15 mask. */
#define CTE_PIFYSRL15_bp  15  /* Port Interface Y-line Slew Rate Limit Enable bit 15 position. */

