gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxt540s.h
/* CTE.MS1IR2  bit masks and bit positions */
/* CTE_MSIR  is already defined. */

/* CTE.MS1IR3  bit masks and bit positions */
/* CTE_MSIR  is already defined. */

/* CTE.MS1IRBUFL  bit masks and bit positions */
/* CTE_MSIRBUF  is already defined. */

/* CTE.MS1IRBUFH  bit masks and bit positions */
/* CTE_MSIRBUF  is already defined. */

/* CTE.MS1R0L  bit masks and bit positions */
/* CTE_MSR0  is already defined. */

/* CTE.MS1R0H  bit masks and bit positions */
/* CTE_MSR0  is already defined. */

/* CTE.MS1REPEATL  bit masks and bit positions */
/* CTE_MSREPEAT  is already defined. */

/* CTE.MS1REPEATH  bit masks and bit positions */
/* CTE_MSREPEAT  is already defined. */

/* CTE.CTTEMP  bit masks and bit positions */
#define CTE_CTTEMP_gm  0xFF  /* CapTouch Temporary register for 16-bit group mask. */
#define CTE_CTTEMP_gp  0  /* CapTouch Temporary register for 16-bit group position. */
#define CTE_CTTEMP0_bm  (1<<0)  /* CapTouch Temporary register for 16-bit bit 0 mask. */
#define CTE_CTTEMP0_bp  0  /* CapTouch Temporary register for 16-bit bit 0 position. */
#define CTE_CTTEMP1_bm  (1<<1)  /* CapTouch Temporary register for 16-bit bit 1 mask. */
#define CTE_CTTEMP1_bp  1  /* CapTouch Temporary register for 16-bit bit 1 position. */
#define CTE_CTTEMP2_bm  (1<<2)  /* CapTouch Temporary register for 16-bit bit 2 mask. */
#define CTE_CTTEMP2_bp  2  /* CapTouch Temporary register for 16-bit bit 2 position. */
#define CTE_CTTEMP3_bm  (1<<3)  /* CapTouch Temporary register for 16-bit bit 3 mask. */
#define CTE_CTTEMP3_bp  3  /* CapTouch Temporary register for 16-bit bit 3 position. */
#define CTE_CTTEMP4_bm  (1<<4)  /* CapTouch Temporary register for 16-bit bit 4 mask. */
#define CTE_CTTEMP4_bp  4  /* CapTouch Temporary register for 16-bit bit 4 position. */
#define CTE_CTTEMP5_bm  (1<<5)  /* CapTouch Temporary register for 16-bit bit 5 mask. */
#define CTE_CTTEMP5_bp  5  /* CapTouch Temporary register for 16-bit bit 5 position. */
#define CTE_CTTEMP6_bm  (1<<6)  /* CapTouch Temporary register for 16-bit bit 6 mask. */
#define CTE_CTTEMP6_bp  6  /* CapTouch Temporary register for 16-bit bit 6 position. */
#define CTE_CTTEMP7_bm  (1<<7)  /* CapTouch Temporary register for 16-bit bit 7 mask. */
#define CTE_CTTEMP7_bp  7  /* CapTouch Temporary register for 16-bit bit 7 position. */

/* CTE.CTCRA  bit masks and bit positions */
#define CTE_CT32WE_bm  0x08  /* Enable 32-bit write bit mask. */
#define CTE_CT32WE_bp  3  /* Enable 32-bit write bit position. */

/* CTE.DMAPSCLR  bit masks and bit positions */
#define CTE_CTDMAPSA_bm  0x01  /* CPU Double Mapping Select A bit mask. */
#define CTE_CTDMAPSA_bp  0  /* CPU Double Mapping Select A bit position. */
#define CTE_CTDMAPSB_bm  0x02  /* CPU Double Mapping Select B bit mask. */
#define CTE_CTDMAPSB_bp  1  /* CPU Double Mapping Select B bit position. */

/* CTE.DMAPSSET  bit masks and bit positions */
/* CTE_CTDMAPSA  is already defined. */
/* CTE_CTDMAPSB  is already defined. */

/* DFLL - DFLL */
/* DFLL.CTRL  bit masks and bit positions */
#define DFLL_ENABLE_bm  0x01  /* DFLL Enable bit mask. */
#define DFLL_ENABLE_bp  0  /* DFLL Enable bit position. */

/* DFLL.CALA  bit masks and bit positions */
#define DFLL_CALL_gm  0x7F  /* DFLL Calibration bits [6:0] group mask. */
#define DFLL_CALL_gp  0  /* DFLL Calibration bits [6:0] group position. */
#define DFLL_CALL0_bm  (1<<0)  /* DFLL Calibration bits [6:0] bit 0 mask. */
#define DFLL_CALL0_bp  0  /* DFLL Calibration bits [6:0] bit 0 position. */
#define DFLL_CALL1_bm  (1<<1)  /* DFLL Calibration bits [6:0] bit 1 mask. */
#define DFLL_CALL1_bp  1  /* DFLL Calibration bits [6:0] bit 1 position. */
#define DFLL_CALL2_bm  (1<<2)  /* DFLL Calibration bits [6:0] bit 2 mask. */
#define DFLL_CALL2_bp  2  /* DFLL Calibration bits [6:0] bit 2 position. */
#define DFLL_CALL3_bm  (1<<3)  /* DFLL Calibration bits [6:0] bit 3 mask. */
#define DFLL_CALL3_bp  3  /* DFLL Calibration bits [6:0] bit 3 position. */
#define DFLL_CALL4_bm  (1<<4)  /* DFLL Calibration bits [6:0] bit 4 mask. */
#define DFLL_CALL4_bp  4  /* DFLL Calibration bits [6:0] bit 4 position. */
#define DFLL_CALL5_bm  (1<<5)  /* DFLL Calibration bits [6:0] bit 5 mask. */
#define DFLL_CALL5_bp  5  /* DFLL Calibration bits [6:0] bit 5 position. */
#define DFLL_CALL6_bm  (1<<6)  /* DFLL Calibration bits [6:0] bit 6 mask. */
#define DFLL_CALL6_bp  6  /* DFLL Calibration bits [6:0] bit 6 position. */

/* DFLL.CALB  bit masks and bit positions */
#define DFLL_CALH_gm  0x3F  /* DFLL Calibration bits [12:7] group mask. */
#define DFLL_CALH_gp  0  /* DFLL Calibration bits [12:7] group position. */
#define DFLL_CALH0_bm  (1<<0)  /* DFLL Calibration bits [12:7] bit 0 mask. */
#define DFLL_CALH0_bp  0  /* DFLL Calibration bits [12:7] bit 0 position. */
#define DFLL_CALH1_bm  (1<<1)  /* DFLL Calibration bits [12:7] bit 1 mask. */
#define DFLL_CALH1_bp  1  /* DFLL Calibration bits [12:7] bit 1 position. */
#define DFLL_CALH2_bm  (1<<2)  /* DFLL Calibration bits [12:7] bit 2 mask. */
#define DFLL_CALH2_bp  2  /* DFLL Calibration bits [12:7] bit 2 position. */
#define DFLL_CALH3_bm  (1<<3)  /* DFLL Calibration bits [12:7] bit 3 mask. */
#define DFLL_CALH3_bp  3  /* DFLL Calibration bits [12:7] bit 3 position. */
#define DFLL_CALH4_bm  (1<<4)  /* DFLL Calibration bits [12:7] bit 4 mask. */
#define DFLL_CALH4_bp  4  /* DFLL Calibration bits [12:7] bit 4 position. */
#define DFLL_CALH5_bm  (1<<5)  /* DFLL Calibration bits [12:7] bit 5 mask. */
#define DFLL_CALH5_bp  5  /* DFLL Calibration bits [12:7] bit 5 position. */










/* MCU - MCU Control */
/* MCU.MCUCR  bit masks and bit positions */
#define MCU_JTAGD_bm  0x01  /* JTAG Disable bit mask. */
#define MCU_JTAGD_bp  0  /* JTAG Disable bit position. */

/* MCU.EVSYSLOCK  bit masks and bit positions */
#define MCU_EVSYS0LOCK_bm  0x01  /* Event Channel 0-3 Lock bit mask. */
#define MCU_EVSYS0LOCK_bp  0  /* Event Channel 0-3 Lock bit position. */
#define MCU_EVSYS1LOCK_bm  0x10  /* Event Channel 4-7 Lock bit mask. */
#define MCU_EVSYS1LOCK_bp  4  /* Event Channel 4-7 Lock bit position. */

